<?
require_once('engine/init.php');
require_once('header.php');

if ($data['ΤύποςΔιαγωνισμού'] == 'Χωρίς Διαγωνισμό')
	trigger_error('Επιλέξατε τη δαπάνη «Χωρίς Διαγωνισμό»', E_USER_ERROR);
$a = $data['ΤύποςΔιαγωνισμού'] == 'Δημόσιος Διαγωνισμός' ? 'Δημόσιου' : 'Πρόχειρου';
?>

\sectd\pgwsxn11906\pghsxn16838\marglsxn1984\margrsxn1134\margtsxn1134\margbsxn1134

<?
echo preOrder(!$draft || isset($data['ΔγηΚατακύρωσης']) ? $data['ΔγηΚατακύρωσης'] : null, array(null), array(null), $draft);
echo '\pard\plain\par\par\par';
echo subjectOrder('Κατακύρωση Διαγωνισμού', array($data['ΔγηΔιάθεσης'], $data['ΔγηΔιαγωνισμού'], 'Πρακτικό διαγωνισμού', 'Εισηγητική έκθεση επιτροπής'));
?>
\pard\plain\sb57\sa57\fs28\tx567\tx1134\tx1701\tx2268\qj

<? if (isset($data['Νικητής'])) { ?>
\tab\b 1.\b0\tab Κατόπιν των σχετικών εγκρίνεται και κατακυρώνεται το πρακτικό του διενεργηθέντος <?=$a?> Διαγωνισμού που αφορά «<?=chk($data['ΘέμαΔιαγωνισμού'])?>» στο μειοδότη «<?=chk($data['Νικητής']['Επωνυμία'])?>» (ΑΦΜ: <?=chk($data['Νικητής']['ΑΦΜ'])?>, ΔΟΥ: <?=chk($data['Νικητής']['ΔΟΥ'])?>
<?
if (isset($data['Νικητής']['Τηλέφωνο'])) echo ', τηλέφωνο: ' . chk($data['Νικητής']['Τηλέφωνο']);
if (isset($data['Νικητής']['Τ.Κ.'])) echo ', Τ.Κ.: ' . chk($data['Νικητής']['Τ.Κ.']);
if (isset($data['Νικητής']['Πόλη'])) echo ', πόλη: ' . chk($data['Νικητής']['Πόλη']);
if (isset($data['Νικητής']['Διεύθυνση'])) echo ', διεύθυνση: ' . chk($data['Νικητής']['Διεύθυνση']);
?>).\par
<? } else { ?>
\tab\b 1.\b0\tab Κατόπιν των σχετικών εγκρίνεται η ΜΗ κατακύρωση του Διαγωνισμού για τους παρακάτω λόγους:\par
\tab\tab α. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\par
\tab\tab β. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\par
\tab\tab γ. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\par
\tab\b 2.\b0\tab Ο Διαγωνισμός θα επαναληφθεί με νεώτερη διαταγή.\par
<? } ?>

<? if ($draft) draftOrder(); else bottomOrder(); ?>

\sect

