<?

function get_java($k, $v) {
	if (is_int($v)) $a = 'java.lang.Integer';
	elseif (is_bool($v)) {
		$a = 'java.lang.Boolean';
		$v = $v ? 'true' : 'false';
	} elseif (is_string($v)) {
		$a = 'java.lang.String';
		$v = '"' . preg_replace('/[\\\"]/', '\\\$0' , $v) . '"';
	} elseif (is_float($v)) $a = 'java.lang.Double';
	else {
		trigger_error("'$v' has '" . gettype($v) . "' type which is unsupported.");
		return;
	}
	return $k ? "$a $k=$v;" : "$a $v;";
}

function get($a) {
	echo 'java.util.Vector {';
	foreach($a as $v) {
		echo 'cost.ContentItem {';
		foreach($v as $key => $val)
			echo get_java($key, $val);
		echo '};';
	}
	echo '};';
}

$papers = array(
	array('Δικαιολογητικό' => 'Διαβιβαστικό Δαπάνης', 'Αρχείο' => 'route_slip', 'Ακαταχώρητο' => true, 'Δγη' => 'Διαβιβαστικό'),
	array('Δικαιολογητικό' => 'Εξώφυλλο Δαπάνης', 'Αρχείο' => 'outpaper', 'Ακαταχώρητο' => true),
	array('Δικαιολογητικό' => 'Φύλλο Καταχώρησης Εγγράφων', 'Αρχείο' => 'contents', 'Ακαταχώρητο' => true),
	array('Δικαιολογητικό' => 'ΥΠΟΦΑΚΕΛΟΣ', 'Αρχείο' => 'subfolder'),
	array('Δικαιολογητικό' => 'Διαταγή Διάθεσης Πίστωσης', 'Δγη' => 'ΔγηΔιάθεσης'),
	array('Δικαιολογητικό' => 'Δγη Συγκρότησης Επιτροπών', 'Αρχείο' => 'order', 'Δγη' => 'ΔγηΑνάθεσης'),
	array('Δικαιολογητικό' => 'Πρωτόκολλο Αγοράς και Διάθεσης', 'Αρχείο' => 'buy_service'),
	array('Δικαιολογητικό' => 'Πρωτόκολλο Παραλαβής Γενόμενης Εργασίας', 'Αρχείο' => 'contracting'),
	array('Δικαιολογητικό' => 'Πρωτόκολλο Ποιοτικής και Ποσοτικής Παραλαβής', 'Αρχείο' => 'quality_quantity'),
	array('Δικαιολογητικό' => 'Έκθεση Γενόμενης Δαπάνης', 'Αρχείο' => 'report'),
	array('Δικαιολογητικό' => 'Τιμολόγια'),
	array('Δικαιολογητικό' => 'Κρατήσεις υπέρ Τρίτων', 'Αρχείο' => 'holds'),
	array('Δικαιολογητικό' => 'Βεβαίωση Ανεφοδιαστικού Οργάνου', 'Αρχείο' => 'refit_unit_affirmation'),
	array('Δικαιολογητικό' => 'Βεβαίωση Επισκευαστικού Οργάνου', 'Αρχείο' => 'repair_unit_affirmation'),
	array('Δικαιολογητικό' => 'Βεβαίωση Απόδοσης ΦΕ'),
	array('Δικαιολογητικό' => 'Βεβαίωση Απόδοσης Κρατήσεων'),
	array('Δικαιολογητικό' => 'ΑΔΔΥ'),
	array('Δικαιολογητικό' => 'Φορολογική Ενημερότητα'),
	array('Δικαιολογητικό' => 'Ασφαλιστική Ενημερότητα')
);

if ($argv[2] == 'all') { get($papers); exit; }



function put($a) {
	global $papers;
	echo 'common.VectorObject {';
	for($z = 0; $z < count($a); $z += 2) {
		$v = $papers[$a[$z]];
		echo 'cost.ContentItem {';
		foreach($v as $key => $val)
			echo get_java($key, $val);
		echo "java.lang.Byte Πλήθος={$a[$z + 1]};";
		echo '};';
	}
	echo '};';
}


$out = array(

	array(	// ΠΡΟΜΗΘΕΙΑ - ΣΥΝΤΗΡΗΣΗ - ΕΠΙΣΚΕΥΗ | ΧΩΡΙΣ ΔΙΑΓΩΝΙΣΜΟ
		0, 1, // Διαβιβαστικό
		1, 1, // Εξώφυλλο
		2, 1, // Φύλλο καταχώρησης
		3, 1, // ΥΠΟΦΑΚΕΛΟΣ
		4, 1, // Διάθεση πίστωσης
		5, 1, // Επιτροπές
		3, 1, // ΥΠΟΦΑΚΕΛΟΣ
		5, 1, // Επιτροπές
		6, 3, // Αγορά - Διάθεση
		7, 3, // Παραλαβή εργασίας
		8, 3, // Ποιοτική - Ποσοτική παραλαβή
		9, 3, // Έκθεση
		10,1, // Τιμολόγια
		17,1, // Φορολογική Ενημερότητα
		18,1, // Ασφαλιστική Ενημερότητα
		11,3, // Κρατήσεις
		3, 1, // ΥΠΟΦΑΚΕΛΟΣ
		14,1, // ΦΕ
		15,1, // Κρατήσεις
		12,1, // Βεβαίωση ανεφοδιαστή
		13,1, // Βεβαίωση επισκευαστή
		16,1  // ΑΔΔΥ
	),

	array(	// ΑΛΛΕΣ - ΜΗ ΥΠΟΣΤΗΡΙΖΟΜΕΝΕΣ ΑΚΟΜΑ
		0, 1, // Διαβιβαστικό
		1, 1, // Εξώφυλλο
		3, 1, // ΥΠΟΦΑΚΕΛΟΣ
		3, 1, // ΥΠΟΦΑΚΕΛΟΣ
		3, 1, // ΥΠΟΦΑΚΕΛΟΣ
		4, 1, // Διάθεση πίστωσης
		8, 3, // Ποιοτική - Ποσοτική παραλαβή
		9, 3,  // Έκθεση
		11, 3, // Κρατήσεις
	)

);

$type = 0;
switch($argv[2]) {
	case 'Κατασκευή Έργων με Υλικά Δημοσίου ή Εμπορίου και Οπλίτες ή Εργατοτεχνίτες': $type++;
	case 'Κατασκευή Έργων από Εργοληπτική Επιχείρηση': $type++;
}
switch($argv[3]) {
	case 'Δημόσιος Διαγωνισμός': $type += 3;
	case 'Πρόχειρος Διαγωνισμός': $type += 3;
}


put($out[$type ? 1 : 0]);

?>