<?

// Για να βγεί η Έκθεση "Γενομένης" και όχι "Απαιτουμένης" Δαπάνης
$prereport = false;

// Για να βγεί ακριβές αντίγραφο των διαταγών και όχι σχέδιο
$draft = false;

require_once('engine/functions.php');

$type1 = 0;
switch($data['ΤύποςΔαπάνης']) {
	case 'Κατασκευή Έργων με Υλικά Δημοσίου ή Εμπορίου και Οπλίτες ή Εργατοτεχνίτες': $type1++;
	case 'Κατασκευή Έργων από Εργοληπτική Επιχείρηση': $type1++;
}
$type2 = 0;
switch($data['ΤύποςΔιαγωνισμού']) {
	case 'Δημόσιος Διαγωνισμός': $type2++;
	case 'Πρόχειρος Διαγωνισμός': $type2++;
}

require("cost$type1$type2.php");
?>