package cost;

import java.awt.*;
import java.awt.event.*;
import javax.swing.*;
import tables.*;

public class CostData extends JPanel implements DataTransmitter {
	final static protected String[] cosT = { "Κατασκευή Έργων από Εργοληπτική Επιχείρηση", "Κατασκευή Έργων από Εργοληπτική Επιχείρηση με Υλικά Δημοσίου ή Εμπορίου", "Κατασκευή Έργων από Οπλίτες ή Εργατοτεχνίτες με Υλικά Δημοσίου ή Εμπορίου", "Προμήθεια - Συντήρηση - Επισκευή" };
	final static protected String[] contesT = { "Δημόσιος Διαγωνισμός", "Πρόχειρος Διαγωνισμός", "Χωρίς Διαγωνισμό" };

	public CostData(ItemListener il) {
		final String[] hdr = { "<html><b>ΚΟΙΝΕΣ ΔΑΠΑΝΕΣ", "Τύπος Δαπάνης", "Διαγωνισμός", "Δγη διάθεσης",
				"Δγη συγκρότησης επιτροπών", null, null, null, null, null, "Ημερομηνία υποβολής", "Αξκος Έργου",
				"Πρόεδρος Αγοράς Διάθεσης", "Α' Μέλος Αγοράς Διάθεσης", "Β' Μέλος Αγοράς Διάθεσης",
				"Πρόεδρος Ποιοτ. Ποσοτ. Παραλαβης", "Α' Μέλος Ποιοτ. Ποσοτ. Παραλαβης", "Β' Μέλος Ποιοτ. Ποσοτ. Παραλαβης",
				null, "<html><b>ΔΑΠΑΝΕΣ ΕΡΓΩΝ", null, "Περιοχή Έργου", "Εργολάβος ή Εργατοτεχνίτης", "Ημερομηνία Ελέγχ. Αφαν. Εργασιών",
				"Ημερομηνία Οριστ. Επιμέτρησης", "Ημερομηνία Προσ. Οριστ. Παραλαβής", "Ημερομηνία Δοικητ. Παράδοσης",
				"Πρόεδρος Αφανών Εργασιών", "Μέλος Αφανών Εργασιών",
				"Πρόεδρος Προσ. Οριστ. Παραλαβής", "Α' Μέλος Προσ. Οριστ. Παραλαβής",	"Β' Μέλος Προσ. Οριστ. Παραλαβής",
				"<html><b>Εργολαβίες", "Δγη Ανάθεσης Εργολαβίας", "Δγη Ορισμού Αξκου Έργου", "Δγη Συγκρ. Επ. Αφαν. Εργασιών",
				"Δγη Συγκρ. Επ. Προσ. Ορ. Παραλαβής", "Δγη Συγκρ. Επ. Ποιοτ. Ποσ. Παραλαβ.",  "Δγη Συγκρ. Επ. Αγοράς Διάθεσης",
				null, "<html><b>ΑΜΕΤΑΒΛΗΤΑ ΣΤΟΙΧΕΙΑ", "Μονάδα (συντ.)", "Μονάδα (πλήρ.)", "Γραφείο Σχηματισμού", null,
				"Ιδιότητα Αξκού",	"Πόλη ή Χωρίο", null, "Τηλέφωνο (εξωτερικό)",	"Τηλέφωνο (εσωτερικό)", "Τ.Κ.",	null,
				null, "Αξκος Γραφείου"
		};
		final String[] hash = { null, "ΤύποςΔαπάνης", "ΤύποςΔιαγωνισμού", "ΔγηΔιάθεσης", "ΔγηΑνάθεσης",
				"Διαβιβαστικό", "Ποσό", "ΕΦ", "ΚΑ", "Τίτλος", "ΗμερομηνίαΥποβολής", "ΑξκοςΈργου",
				"ΠρόεδροςΑγοράςΔιάθεσης", "ΜέλοςΑγοράςΔιάθεσηςΑ", "ΜέλοςΑγοράςΔιάθεσηςΒ",
				"ΠρόεδροςΠοιοτικήςΠοσοτικήςΠαραλαβής", "ΜέλοςΠοιοτικήςΠοσοτικήςΠαραλαβήςΑ", "ΜέλοςΠοιοτικήςΠοσοτικήςΠαραλαβήςΒ",
				null, null, "Έργο", "ΠεριοχήΈργου", "Εργολάβος",
				"ΗμερομηνίαΑφανώνΕργασιών", "ΗμερομηνίαΟριστικήςΕπιμέτρησης", "ΗμερομηνίαΠροσωρινήςΟριστικήςΠαραλαβής", "ΗμερομηνίαΔιοικητικήςΠαράδοσης",
				"ΠρόεδροςΑφανώνΕργασιών", "ΜέλοςΑφανώνΕργασιών",
				"ΠρόεδροςΠροσωρινήςΟριστικήςΠαραλαβής", "ΜέλοςΠροσωρινήςΟριστικήςΠαραλαβήςΑ", "ΜέλοςΠροσωρινήςΟριστικήςΠαραλαβήςΒ",
				null, "ΔγηΑνάθεσηςΕργολαβίας", "ΔγηΑξκουΈργου", "ΔγηΑφανώνΕργασιών",
				"ΔγηΠροσωρινήςΟριστικήςΠαραλαβής", "ΔγηΠοιοτικήςΠοσοτικήςΠαραλαβής", "ΔγηΑγοράςΔιάθεσης",
				null, null, "ΣύντμησηΜονάδας", "Μονάδα", "ΓραφείοΣχηματισμού", "Γραφείο", "ΙδιότηταΑξκου", "Πόλη",
				"Διεύθυνση", "ΕξωτερικόΤηλέφωνο", "ΕσωτερικόΤηλέφωνο", "ΤΚ", "Δκτης", "ΕΟΥ", "ΑξκοςΓραφείου"
		};
		JComboBox[] cmp = new JComboBox[hash.length];
		cmp[1] = new JComboBox(cosT);
		cmp[2] = new JComboBox(contesT);
		cmp[1].addItemListener(il);
		cmp[2].addItemListener(il);
		cmp[22] = Providers.providers;
		for (int z = 11; z < 11 + 7; z++) cmp[z] = Men.men;
		for (int z = 27; z < 27 + 5; z++) cmp[z] = Men.men;
		for (int z = hash.length - 3; z < hash.length; z++) cmp[z] = Men.men;
		setLayout(new BorderLayout());
		add(PropertiesTable.getScrolled(new PropertiesTableModel(hash, this, hdr), cmp, 210));
	}
	public Object getData() { return MainFrame.costs.get(); }
}