package cost;

import java.awt.*;
import java.util.*;
import javax.swing.*;
import tables.*;

public class CostData extends JPanel implements DataTransmitter {
  public CostData() {
/*    protected static final String[] properties = {
	"Πρόεδρος Αφανών Εργασιών",
	"Β' Μέλος Αγοράς Διάθεσης",
	"Πρόεδρος Ποιοτ. Ποσοτ. Παραλαβης", "Α' Μέλος Ποιοτ. Ποσοτ. Παραλαβης", "Β' Μέλος Ποιοτ. Ποσοτ. Παραλαβης",
	"Πρόεδρος Προσ. Οριστ. Παραλαβής", "Α' Μέλος Προσ. Οριστ. Παραλαβής", "Β' Μέλος Προσ. Οριστ. Παραλαβής",
    };*/
    final String[][] hash = {
	{ ":Τύπος Δαπάνης", "ΤύποςΔαπάνης" },
	{ ":Διαγωνισμός", "ΤύποςΔιαγωνισμού" },
	{ ":Δγη διάθεσης", "ΔγηΔιάθεσης" },
	{ ":Δγη ανάθεσης", "ΔγηΑνάθεσης" },
	{ ":Ποσό", "Ποσό" },
	{ ":ΕΦ", "ΕΦ" },
	{ ":ΚΑ", "ΚΑ" },
	{ ":Τίτλος", "Τίτλος" },
	{ ":Ημερομηνία υποβολής", "ΗμερομηνίαΥποβολής" },
	{ ":Αξκος Έργου", "ΑξκοςΈργου" },
	{ ":Πρόεδρος Αγοράς Διάθεσης", "ΠρόεδροςΑγοράςΔιάθεσης" },
	{ ":Α' Μέλος Αγοράς Διάθεσης", "ΜέλοςΑγοράςΔιάθεσηςΑ" },
	{ ":Β' Μέλος Αγοράς Διάθεσης", "ΜέλοςΑγοράςΔιάθεσηςΒ" },
	{ ":Πρόεδρος Ποιοτ. Ποσοτ. Παραλαβης", "ΠρόεδροςΠοιοτικήςΠοσοτικήςΠαραλαβής" },
	{ ":Α' Μέλος Ποιοτ. Ποσοτ. Παραλαβης", "ΜέλοςΠοιοτικήςΠοσοτικήςΠαραλαβήςΑ" },
	{ ":Β' Μέλος Ποιοτ. Ποσοτ. Παραλαβης", "ΜέλοςΠοιοτικήςΠοσοτικήςΠαραλαβήςΒ" },
	{ ":Πρόεδρος Ζυγ. Υλικών Εμπορίου", "ΠρόεδροςΖυγίσεωςΥλικώνΕμπορίου" },
	{ ":Μέλος Ζυγ. Υλικών Εμπορίου", "ΜέλοςΖυγίσεωςΥλικώνΕμπορίου" }
    };
    final String[] cosT = { "Προμήθεια - Συντήρηση - Επισκευή", "Κατασκευή Έργων με Υλικά Δημοσίου ή Εμπορίου και Οπλίτες ή Εργατοτεχνίτες", "Κατασκευή Έργων από Εργοληπτική Επιχείρηση" };
    final String[] contesT = { "Χωρίς Διαγωνισμό", "Πρόχειρος Διαγωνισμός", "Δημόσιος Διαγωνισμός" };
    final int[] d = { 210 };
    Component[][] cmp = new Component[hash.length][2];
    cmp[0][1] = new JComboBox(cosT);
    cmp[1][1] = new JComboBox(contesT);
    for (int z = hash.length - 9; z < hash.length; z++) cmp[z][1] = Men.men;
    setLayout(new BorderLayout());
    add(new JScrollPane(new PropertiesTable(new PropertiesTableModel(hash, this, null), d, cmp)));
  }

  public Object getData() {
    Object o = MainFrame.costs.get(MainFrame.currentCost);
    return o instanceof Dictionary ? o : null;
  }
}