<?
require_once('engine/init.php');
require_once('header.php');

if ($data['ΤύποςΔιαγωνισμού'] == 'Χωρίς Διαγωνισμό')
	trigger_error('Επιλέξατε τη δαπάνη «Χωρίς Διαγωνισμό»', E_USER_ERROR);
$a = $data['ΤύποςΔιαγωνισμού'] == 'Δημόσιος Διαγωνισμός';
?>

\sectd\pgwsxn11906\pghsxn16838\marglsxn1984\margrsxn1134\margtsxn1134\margbsxn1134

<?
echo preOrder(!$draft || isset($data['ΔγηΚατακύρωσης']) ? $data['ΔγηΚατακύρωσης'] : null, array($data['Νικητής']['Επωνυμία'], man_ext($data['ΑξκοςΈργου'], 2)), array(null), $draft);
$c = $a || isset($data['ΏραΔιαγωνισμού'], $data['ΤόποςΔιαγωνισμού']);
if ($c) $b = get_datetime($data['ΏραΔιαγωνισμού']);
echo subjectOrder('Δαπάνες Στρατού (Κατακύρωση Διαγωνισμού)', array($data['ΔγηΔιάθεσης'], $data['ΔγηΑνάθεσης'], ($c ? "Η από $b[1] " : '') . 'Εισηγητική Έκθεση της Επιτροπής Διαγωνισμού'));
?>
\pard\plain\sb57\sa57\fs24\tx567\tx1134\tx1701\tx2268\qj

<? if (isset($data['Νικητής'])) { ?>
\tab 1.\tab Σε συνέχεια του (γ) σχετικού εγκρίνεται και κατακυρώνεται το πρακτικό του διενεργηθέντος <?=$a ? 'Δημοσίου' : 'Προχείρου'?> Διαγωνισμού που αφορά «<?=chk($data['ΘέμαΔιαγωνισμού'])?>» στο μειοδότη «<?=chk($data['Νικητής']['Επωνυμία'])?>» (ΑΦΜ: <?=chk($data['Νικητής']['ΑΦΜ'])?>, ΔΟΥ: <?=chk($data['Νικητής']['ΔΟΥ'])?>
<?
if (isset($data['Νικητής']['Τηλέφωνο'])) echo ', τηλέφωνο: ' . chk($data['Νικητής']['Τηλέφωνο']);
if (isset($data['Νικητής']['Τ.Κ.'])) echo ', Τ.Κ.: ' . chk($data['Νικητής']['Τ.Κ.']);
if (isset($data['Νικητής']['Πόλη'])) echo ', πόλη: ' . chk($data['Νικητής']['Πόλη']);
if (isset($data['Νικητής']['Διεύθυνση'])) echo ', διεύθυνση: ' . chk($data['Νικητής']['Διεύθυνση']);
?>).\par
\tab 2.\tab Λοιπά σύμφωνα με τους όρους του διαγωνισμού.\par
<? } else { ?>
\tab 1.\tab Σε συνέχεια των σχετικών εγκρίνεται η ΜΗ κατακύρωση του Διαγωνισμού για τους παρακάτω λόγους:\par
\tab\tab α. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\par
\tab\tab β. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\par
\tab\tab γ. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\par
\tab 2.\tab Ο Διαγωνισμός θα επαναληφθεί με νεώτερη διαταγή.\par
<? } ?>

<? if ($draft) draftOrder(); else bottomOrder(); ?>

\sect

