<?
require_once('engine/init.php');
require_once('header.php');

$a = $data['ΤύποςΔιαγωνισμού'] == 'Δημόσιος Διαγωνισμός';
$b = $data['ΤύποςΔιαγωνισμού'] != 'Χωρίς Διαγωνισμό';
$c = $data['ΤύποςΔαπάνης'] == 'Προμήθεια - Συντήρηση - Επισκευή';
?>

\sectd\pgwsxn11906\pghsxn16838\marglsxn1984\margrsxn1134\margtsxn1134\margbsxn1134

<?=preOrder(!$draft || isset($data['ΔγηΑνάθεσης']) ? $data['ΔγηΑνάθεσης'] : null, array(man_ext($data['ΑξκοςΈργου'], 2), 'Μέλη Επιτροπών'), array(null), $draft)?>
<?=subjectOrder('Διάθεση Πίστωσης', array($data['ΔγηΔιάθεσης']))?>
\pard\plain\fs24\tx567\tx1134\tx1701\tx2268\qj
\tab 1.\tab Έχοντας υπόψη το σχετικό με το οποίο διατέθηκαν στη Μονάδα <?=euro2str($data['Ποσό'])?> (<?=euro($data['Ποσό'])?>), για «<?=chk($data['Τίτλος'])?>»\par\par
\qc{\b σ α ς  ο ρ ί ζ ω}\par\qj\par
Υπεύθυνο Αξκό Έργου για την εκτέλεση της παραπάνω εργασίας και τη σύνταξη των δικαιολογητικών της δαπάνης σύμφωνα με τους ισχύοντες Νόμους και Διαταγές.\par\par
\tab 2.\tab Συγκροτώ επιπρόσθετα τις παρακάτω επιτροπές:\par\par
<? $count = 0;
if ($b) { ?>
\tab\tab <?=countGreek(++$count)?>.\tab\ul Διενέργειας <?$a ? 'Δημόσιου' : 'Πρόχειρου'?> Διαγωνισμού\ul0  <?=$data['Τίτλος'] == $data['ΘέμαΔιαγωνισμού'] ? '' : 'για «' . chk($data['ΘέμαΔιαγωνισμού']) .'», '?>αποτελούμενη από τους:\par
\tab\tab\tab (1)\tab <?=man_ext($data['ΠρόεδροςΔιαγωνισμού'], 2)?> ως πρόεδρο\par
\tab\tab\tab (2)\tab <?=man_ext($data['ΜέλοςΔιαγωνισμούΑ'], 2)?> και\par
\tab\tab\tab (3)\tab <?=man_ext($data['ΜέλοςΔιαγωνισμούΒ'], 2)?> ως μέλη.\par\par
<? }
if (!$b || !$c && (isset($data['ΠρόεδροςΑγοράςΔιάθεσης']) || isset($data['ΜέλοςΑγοράςΔιάθεσηςΑ']) || isset($data['ΜέλοςΑγοράςΔιάθεσηςΒ']))) { ?>
\tab\tab <?=countGreek(++$count)?>.\tab\ul Aγοράς και διάθεσης\ul0  αποτελούμενη από τους:\par
\tab\tab\tab (1)\tab <?=man_ext($data['ΠρόεδροςΑγοράςΔιάθεσης'], 2)?> ως πρόεδρο\par
\tab\tab\tab (2)\tab <?=man_ext($data['ΜέλοςΑγοράςΔιάθεσηςΑ'], 2)?> και\par
\tab\tab\tab (3)\tab <?=man_ext($data['ΜέλοςΑγοράςΔιάθεσηςΒ'], 2)?> ως μέλη.\par\par
<? }
if ($c || isset($data['ΠρόεδροςΠοιοτικήςΠοσοτικήςΠαραλαβής']) || isset($data['ΜέλοςΠοιοτικήςΠοσοτικήςΠαραλαβήςΑ']) || isset($data['ΜέλοςΠοιοτικήςΠοσοτικήςΠαραλαβήςΒ'])) { ?>
\tab\tab <?=countGreek(++$count)?>.\tab\ul Ποιοτικού ελέγχου και ποσοτικής παραλαβής\ul0  αποτελούμενη από τους:\par
\tab\tab\tab (1)\tab <?=man_ext($data['ΠρόεδροςΠοιοτικήςΠοσοτικήςΠαραλαβής'], 2)?> ως πρόεδρο\par
\tab\tab\tab (2)\tab <?=man_ext($data['ΜέλοςΠοιοτικήςΠοσοτικήςΠαραλαβήςΑ'], 2)?> και\par
\tab\tab\tab (3)\tab <?=man_ext($data['ΜέλοςΠοιοτικήςΠοσοτικήςΠαραλαβήςΒ'], 2)?> ως μέλη.\par\par
<? }
if (!$c) { ?>
\tab\tab <?=countGreek(++$count)?>.\tab\ul Αφανών εργασιών\ul0  αποτελούμενη από τους:\par
\tab\tab\tab (1)\tab <?=man_ext($data['ΠρόεδροςΑφανώνΕργασιών'], 2)?> ως πρόεδρο\par
\tab\tab\tab (2)\tab <?=man_ext($data['ΜέλοςΑφανώνΕργασιών'], 2)?> ως μέλος.\par\par
\tab\tab <?=countGreek(++$count)?>.\tab\ul Προσωρινής και οριστικής παραλαβής\ul0  αποτελούμενη από τους:\par
\tab\tab\tab (1)\tab <?=man_ext($data['ΠρόεδροςΠροσωρινήςΟριστικήςΠαραλαβής'], 2)?> ως πρόεδρο\par
\tab\tab\tab (2)\tab <?=man_ext($data['ΜέλοςΠροσωρινήςΟριστικήςΠαραλαβήςΑ'], 2)?> και\par
\tab\tab\tab (3)\tab <?=man_ext($data['ΜέλοςΠροσωρινήςΟριστικήςΠαραλαβήςΒ'], 2)?> ως μέλη.\par\par
'<? }
$count = 3;
if (isset($data['ΗμερομηνίαΥποβολής'])) {?>\tab <?=$count++?>.\tab Φάκελος δαπάνης μαζί με τα υπόλοιπα δικαιολογητικά να υποβληθούν μέχρι <?=chk_date($data['ΗμερομηνίαΥποβολής'])?>.\par\par<? }
if ($b) {?>\tab <?=$count++?>.\tab Ο διαγωνισμός θα γίνει <?=$a || isset($data['ΏραΔιαγωνισμού'], $data['ΤόποςΔιαγωνισμού']) ? 'τις ' . chk_datetime($data['ΏραΔιαγωνισμού']) . ', ' . chk($data['ΤόποςΔιαγωνισμού']) : 'με περιφορά'?>.\par\par<? } ?>
\tab <?=$count++?>.\tab Η δαπάνη υπόκειται στις νόμιμες κρατήσεις.\par\par
\tab <?=$count++?>.\tab Λοιπά, όπως ορίζονται στο σχετικό.\par\par

<? if ($draft) draftOrder(); else bottomOrder(); ?>

\sect

