<?

function get_java($k, $v) {
	if (is_int($v)) $a = 'java.lang.Integer';
	elseif (is_bool($v)) {
		$a = 'java.lang.Boolean';
		$v = $v ? 'true' : 'false';
	} elseif (is_string($v)) {
		$a = 'java.lang.String';
		$v = '"' . preg_replace('/[\\\"]/', '\\\$0' , $v) . '"';
	} elseif (is_float($v)) $a = 'java.lang.Double';
	else {
		trigger_error("Το '<b>$v</b>' είναι τύπου '<b>" . gettype($v) . "</b>' και δεν υποστηρίζεται.");
		return;
	}
	return $k ? "$a $k=$v;" : "$a $v;";
}


function get_contents($k) {

	static $papers = array(
		'Διαβιβαστικό Δαπάνης' => array('Αρχείο' => true, 'Ακαταχώρητο' => true, 'Δγη' => 'Διαβιβαστικό'),
		'Εξώφυλλο Δαπάνης' => array('Αρχείο' => true, 'Ακαταχώρητο' => true),
		'Φύλλο Καταχώρησης Εγγράφων' => array('Αρχείο' => true, 'Ακαταχώρητο' => true),
		'ΥΠΟΦΑΚΕΛΟΣ' => array('Αρχείο' => true),
		'Δγη Διάθεσης Πίστωσης' => array('Δγη' => 'ΔγηΔιάθεσης'),
		'Δγη Συγκρότησης Επιτροπών' => array('Αρχείο' => true, 'Δγη' => 'ΔγηΑνάθεσης'),
		'Πρωτόκολλο Αγοράς και Διάθεσης' => array('Αρχείο' => true),
		'Πρωτόκολλο Παραλαβής Γενόμενης Εργασίας' => array('Αρχείο' => true),
		'Πρωτόκολλο Ποιοτικής και Ποσοτικής Παραλαβής' => array('Αρχείο' => true),
		'Έκθεση Γενόμενης Δαπάνης' => array('Αρχείο' => true),
		'Τιμολόγια' => null,
		'Κρατήσεις υπέρ Τρίτων' => array('Αρχείο' => true),
		'Βεβαίωση Ανεφοδιαστικού Οργάνου' => array('Αρχείο' => true),
		'Βεβαίωση Επισκευαστικού Οργάνου' => array('Αρχείο' => true),
		'Βεβαίωση Απόδοσης ΦΕ' => null,
		'Βεβαίωση Απόδοσης Κρατήσεων' => null,
		'ΑΔΔΥ' => null,
		'Φορολογική Ενημερότητα' => null,
		'Ασφαλιστική Ενημερότητα' => null,
		'Πρωτόκολλο Παραλαβής Αφανών Εργασιών' => array('Αρχείο' => true),
		'Αναλυτική Επιμέτρηση' => array('Αρχείο' => true),
		'Πρωτόκολλο Εκτελεσθέντων Εργασιών' => array('Αρχείο' => true),
		'Οριστική Επιμέτρηση' => array('Αρχείο' => true),
//-------\/
		'Πρωτόκολλο Διοικητικής Παράδοσης' => array('Αρχείο' => 'executive_delivery'),
//-------/\
		'Πρωτόκολλο Προσωρινής και Οριστικής Παραλαβής' => array('Αρχείο' => true),
		'Βεβαίωση Μη Χρέωσης Υλικών' => array('Αρχείο' => true),
//-------\/
		'Διαταγή που Ορίζει Αξκο Έργου' => array('Αρχείο' => 'order_work_officer', 'Δγη' => 'ΔγηΑξκουΈργου'),
		'Διαταγή Ανάθεσης της Εργολαβίας' => array('Αρχείο' => 'order_contractor', 'Δγη' => 'ΔγηΑνάθεσηςΕργολαβίας'),
//-------/\
		'Σύμβαση' => null,
//-------\/
		'Διαταγή Συγκρότησης Επιτροπής Αφανών Εργασιών' => array('Αρχείο' => 'order_obscure_work', 'Δγη' => 'ΔγηΑφανώνΕργασιών'),
		'Διαταγή Συγκρότησης Επιτροπής Προσωρινής και Οριστικής Παραλαβής' => array('Αρχείο' => 'order_temporary_finally_taking', 'Δγη' => 'ΔγηΠροσωρινήςΟριστικήςΠαραλαβής'),
		'Διαταγή Συγκρότησης Επιτροπής Αγοράς και Διάθεσης' => array('Αρχείο' => 'order_buy_service', 'Δγη' => 'ΔγηΑγοράςΔιάθεσης'),
		'Διαταγή Συγκρότησης Επιτροπής Ποιοτικής και Ποσοτικής Παραλαβής' => array('Αρχείο' => 'order_quality_quantity', 'Δγη' => 'ΔγηΠοιοτικήςΠοσοτικήςΠαραλαβής'),
//-------/\
		'Βεβαίωση Περάτωσης του Έργου' => array('Αρχείο' => true),
		'Τεύχη Μελέτης' => null,
		'Δγη Διακήρυξης Διαγωνισμού' => array('Αρχείο' => true, 'Δγη' => 'ΔγηΔιακήρυξης'),
		'Αποκόμματα Εφημερίδων με τη Διακήρυξη' => null,
		'Πρακτικό Διαγωνισμού' => null,
		'Εισηγητική Έκθεση Διαγωνισμού' => array('Αρχείο' => true),
		'Δγη Κατακύρωσης Διαγωνισμού' => array('Αρχείο' => true, 'Δγη' => 'ΔγηΚατακύρωσης')
	);

	if (is_string($k)) {
		if (substr($k, -4) != '.php')
			return array_key_exists($k, $papers) ? $papers[$k] : array();
		else {
			$k = substr($k, 0, -4);
			foreach($papers as $key => $v)
				if ($v['Αρχείο'] == $k) return $key;
		}
	}
	else

		if ($k == -1) {
			$a = array_keys($papers);
			echo 'java.util.ArrayList {';
			foreach($a as $v)
				echo get_java(null, $v);
			echo '};';

		} else {

			static $out = array(

				array(	// ΠΡΟΜΗΘΕΙΑ - ΣΥΝΤΗΡΗΣΗ - ΕΠΙΣΚΕΥΗ | ΧΩΡΙΣ ΔΙΑΓΩΝΙΣΜΟ
					0, 1, // Διαβιβαστικό
					1, 1, // Εξώφυλλο
					2, 1, // Φύλλο καταχώρησης
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					4, 1, // Διάθεση πίστωσης
					5, 2, // Επιτροπές
					28,1, // Σύμβαση
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					6, 3, // Αγορά - Διάθεση
					7, 3, // Παραλαβή εργασίας
					8, 3, // Ποιοτική - Ποσοτική παραλαβή
					9, 3, // Έκθεση
					25,3, // Βεβαίωση
					21,3, // Εκτελεσθείσες Εργασίες
					10,1, // Τιμολόγια
					17,1, // Φορολογική Ενημερότητα
					18,1, // Ασφαλιστική Ενημερότητα
					11,3, // Κρατήσεις
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					14,1, // ΦΕ
					15,1, // Κρατήσεις
					12,1, // Βεβαίωση ανεφοδιαστή
					13,1, // Βεβαίωση επισκευαστή
					16,1  // ΑΔΔΥ
				),

				array(	// ΚΑΤΑΣΚΕΥH EΡΓΩΝ | ΧΩΡΙΣ ΔΙΑΓΩΝΙΣΜΟ
					0, 1, // Διαβιβαστικό
					1, 1, // Εξώφυλλο
					2, 1, // Φύλλο καταχώρησης
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					4, 1, // Διάθεση πίστωσης
					5, 1, // Επιτροπές
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					28,1, // Σύμβαση
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					19,2, // Αφανών Εργασιών
					20,2, // Αναλυτική Επιμέτρηση
					22,2, // Οριστική Επιμέτρηση
					24,3, // Προσωρινή - Οριστική Παραλαβή
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					8, 3, // Ποιοτική - Ποσοτική παραλαβή
					9, 3, // Έκθεση
					25,3, // Βεβαίωση
					10,1, // Τιμολόγια
					17,1, // Φορολογική Ενημερότητα
					18,1, // Ασφαλιστική Ενημερότητα
					11,3, // Κρατήσεις
					15,1, // Κρατήσεις
					14,1, // ΦΕ
					21,1, // Εκτελεσθέντων Εργασιών
					16,1, // ΑΔΔΥ
					33,1  // Βεβαίωση Περάτωσης
				),

				array(	// ΠΡΟΜΗΘΕΙΑ - ΣΥΝΤΗΡΗΣΗ - ΕΠΙΣΚΕΥΗ | ΠΡΟΧΕΙΡΟΣ ΔΙΑΓΩΝΙΣΜΟΣ
					0, 1, // Διαβιβαστικό
					1, 1, // Εξώφυλλο
					2, 1, // Φύλλο καταχώρησης
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					4, 1, // Διάθεση πίστωσης
					5, 2, // Επιτροπές
					37,3, // Πρακτικό διαγωνισμού
					38,1, // Εισηγητική έκθεση
					39,1, // Κατακύρωση διαγωνισμού
					28,1, // Σύμβαση
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					6, 3, // Αγορά - Διάθεση
					7, 3, // Παραλαβή εργασίας
					8, 3, // Ποιοτική - Ποσοτική παραλαβή
					9, 3, // Έκθεση
					25,3, // Βεβαίωση
					21,3, // Εκτελεσθείσες Εργασίες
					10,1, // Τιμολόγια
					17,1, // Φορολογική Ενημερότητα
					18,1, // Ασφαλιστική Ενημερότητα
					11,3, // Κρατήσεις
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					14,1, // ΦΕ
					15,1, // Κρατήσεις
					12,1, // Βεβαίωση ανεφοδιαστή
					13,1, // Βεβαίωση επισκευαστή
					16,1  // ΑΔΔΥ
				),

				array(	// ΚΑΤΑΣΚΕΥH EΡΓΩΝ | ΠΡΟΧΕΙΡΟΣ ΔΙΑΓΩΝΙΣΜΟΣ
					0, 1, // Διαβιβαστικό
					1, 1, // Εξώφυλλο
					2, 1, // Φύλλο καταχώρησης
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					5, 1, // Επιτροπές
					4, 1, // Διάθεση πίστωσης
					37,3, // Πρακτικό διαγωνισμού
					38,1, // Εισηγητική έκθεση
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					39,1, // Κατακύρωση διαγωνισμού
					28,1, // Σύμβαση
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					19,2, // Αφανών Εργασιών
					20,2, // Αναλυτική Επιμέτρηση
					22,2, // Οριστική Επιμέτρηση
					24,3, // Προσωρινή - Οριστική Παραλαβή
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					8, 3, // Ποιοτική - Ποσοτική παραλαβή
					9, 3, // Έκθεση
					25,3, // Βεβαίωση
					10,1, // Τιμολόγια
					17,1, // Φορολογική Ενημερότητα
					18,1, // Ασφαλιστική Ενημερότητα
					11,3, // Κρατήσεις
					15,1, // Κρατήσεις
					14,1, // ΦΕ
					21,1, // Εκτελεσθέντων Εργασιών
					16,1, // ΑΔΔΥ
					33,1  // Βεβαίωση Περάτωσης
				),

				array(	// ΠΡΟΜΗΘΕΙΑ - ΣΥΝΤΗΡΗΣΗ - ΕΠΙΣΚΕΥΗ | ΔΗΜΟΣΙΟΣ ΔΙΑΓΩΝΙΣΜΟΣ
					0, 1, // Διαβιβαστικό
					1, 1, // Εξώφυλλο
					2, 1, // Φύλλο καταχώρησης
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					4, 1, // Διάθεση πίστωσης
					5, 2, // Επιτροπές
					35,1, // Διακήρυξη διαγωνισμού
					36,1, // Αποκόμματα εφημερίδων
					37,3, // Πρακτικό διαγωνισμού
					38,1, // Εισηγητική έκθεση
					39,1, // Κατακύρωση διαγωνισμού
					28,1, // Σύμβαση
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					6, 3, // Αγορά - Διάθεση
					7, 3, // Παραλαβή εργασίας
					8, 3, // Ποιοτική - Ποσοτική παραλαβή
					9, 3, // Έκθεση
					25,3, // Βεβαίωση
					21,3, // Εκτελεσθείσες Εργασίες
					10,1, // Τιμολόγια
					17,1, // Φορολογική Ενημερότητα
					18,1, // Ασφαλιστική Ενημερότητα
					11,3, // Κρατήσεις
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					14,1, // ΦΕ
					15,1, // Κρατήσεις
					12,1, // Βεβαίωση ανεφοδιαστή
					13,1, // Βεβαίωση επισκευαστή
					16,1  // ΑΔΔΥ
				),

				null

			);

			$a = $out[$k];
			$k = array_keys($papers);
			echo 'common.VectorObject {';
			for($z = 0; $z < count($a); $z += 2) {
				echo 'cost.ContentItem {';
					echo get_java('Δικαιολογητικό', $k[$a[$z]]);
					echo get_java('Πλήθος', $a[$z + 1]);
				echo '};';
			}
			echo '};';
		}
}


if (!isset($data)) get_contents((int) $argv[2]);

?>