<?

function get_java($k, $v) {
	if (is_int($v)) $a = 'java.lang.Integer';
	elseif (is_bool($v)) {
		$a = 'java.lang.Boolean';
		$v = $v ? 'true' : 'false';
	} elseif (is_string($v)) {
		$a = 'java.lang.String';
		$v = '"' . preg_replace('/[\\\"]/', '\\\$0' , $v) . '"';
	} elseif (is_float($v)) $a = 'java.lang.Double';
	else {
		trigger_error("Το '<b>$v</b>' είναι τύπου '<b>" . gettype($v) . "</b>' και δεν υποστηρίζεται.");
		return;
	}
	return $k ? "$a $k=$v;" : "$a $v;";
}


function get_contents($k) {

	static $papers = array(
		'Διαβιβαστικό Δαπάνης' => array('Αρχείο' => 'route_slip', 'Ακαταχώρητο' => true, 'Δγη' => 'Διαβιβαστικό'),
		'Εξώφυλλο Δαπάνης' => array('Αρχείο' => 'outpaper', 'Ακαταχώρητο' => true),
		'Φύλλο Καταχώρησης Εγγράφων' => array('Αρχείο' => 'contents', 'Ακαταχώρητο' => true),
		'ΥΠΟΦΑΚΕΛΟΣ' => array('Αρχείο' => 'subfolder'),
		'Διαταγή Διάθεσης Πίστωσης' => array('Δγη' => 'ΔγηΔιάθεσης'),
		'Δγη Συγκρότησης Επιτροπών' => array('Αρχείο' => 'order', 'Δγη' => 'ΔγηΑνάθεσης'),
		'Πρωτόκολλο Αγοράς και Διάθεσης' => array('Αρχείο' => 'buy_service'),
		'Πρωτόκολλο Παραλαβής Γενόμενης Εργασίας' => array('Αρχείο' => 'contracting'),
		'Πρωτόκολλο Ποιοτικής και Ποσοτικής Παραλαβής' => array('Αρχείο' => 'quality_quantity'),
		'Έκθεση Γενόμενης Δαπάνης' => array('Αρχείο' => 'report'),
		'Τιμολόγια' => null,
		'Κρατήσεις υπέρ Τρίτων' => array('Αρχείο' => 'holds'),
		'Βεβαίωση Ανεφοδιαστικού Οργάνου' => array('Αρχείο' => 'refit_unit_affirmation'),
		'Βεβαίωση Επισκευαστικού Οργάνου' => array('Αρχείο' => 'repair_unit_affirmation'),
		'Βεβαίωση Απόδοσης ΦΕ' => null,
		'Βεβαίωση Απόδοσης Κρατήσεων' => null,
		'ΑΔΔΥ' => null,
		'Φορολογική Ενημερότητα' => null,
		'Ασφαλιστική Ενημερότητα' => null,
		'Πρωτόκολλο Παραλαβής Αφανών Εργασιών' => array('Αρχείο' => 'obscure_work'),
		'Αναλυτική Επιμέτρηση' => array('Αρχείο' => 'analytic_measurement'),
		'Πρωτόκολλο Εκτελεσθέντων Εργασιών' => array('Αρχείο' => 'finished_works'),
		'Οριστική Επιμέτρηση' => array('Αρχείο' => 'hard_measurement'),
		'Πρωτόκολλο Διοικητικής Παράδοσης' => array('Αρχείο' => 'executive_delivery'),
		'Πρωτόκολλο Προσωρινής και Οριστικής Παραλαβής' => array('Αρχείο' => 'temporary_finally_taking'),
		'Βεβαίωση Μη Χρέωσης Υλικών' => array('Αρχείο' => 'certification'),
		'Διαταγή που Ορίζει Αξκο Έργου' => array('Αρχείο' => 'order_work_officer', 'Δγη' => 'ΔγηΑξκουΈργου'),
		'Διαταγή Ανάθεσης της Εργολαβίας' => array('Αρχείο' => 'order_contractor', 'Δγη' => 'ΔγηΑνάθεσηςΕργολαβίας'),
		'Συμφωνητικό με Εργολάβο' => null,
		'Διαταγή Συγκρότησης Επιτροπής Αφανών Εργασιών' => array('Αρχείο' => 'order_obscure_work', 'Δγη' => 'ΔγηΑφανώνΕργασιών'),
		'Διαταγή Συγκρότησης Επιτροπής Προσωρινής και Οριστικής Παραλαβής' => array('Αρχείο' => 'order_temporary_finally_taking', 'Δγη' => 'ΔγηΠροσωρινήςΟριστικήςΠαραλαβής'),
		'Διαταγή Συγκρότησης Επιτροπής Αγοράς και Διάθεσης' => array('Αρχείο' => 'order_buy_service', 'Δγη' => 'ΔγηΑγοράςΔιάθεσης'),
		'Διαταγή Συγκρότησης Επιτροπής Ποιοτικής και Ποσοτικής Παραλαβής' => array('Αρχείο' => 'order_quality_quantity', 'Δγη' => 'ΔγηΠοιοτικήςΠοσοτικήςΠαραλαβής'),
		'Βεβαίωση Περάτωσης του Έργου' => array('Αρχείο' => 'finished_work_affirmation'),
		'Τεύχη Μελέτης' => null
	);

	if (is_string($k)) {
		if (substr($k, -4) != '.php')
			return array_key_exists($k, $papers) ? $papers[$k] : array();
		else {
			$k = substr($k, 0, -4);
			foreach($papers as $key => $v)
				if ($v['Αρχείο'] == $k) return $key;
		}
	}
	else

		if ($k == -1) {
			$a = array_keys($papers);
			echo 'java.util.Vector {';
			foreach($a as $v)
				echo get_java(null, $v);
			echo '};';

		} else {

			static $out = array(

				array(	// ΠΡΟΜΗΘΕΙΑ - ΣΥΝΤΗΡΗΣΗ - ΕΠΙΣΚΕΥΗ | ΧΩΡΙΣ ΔΙΑΓΩΝΙΣΜΟ
					0, 1, // Διαβιβαστικό
					1, 1, // Εξώφυλλο
					2, 1, // Φύλλο καταχώρησης
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					4, 1, // Διάθεση πίστωσης
					5, 1, // Επιτροπές
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					5, 1, // Επιτροπές
					6, 3, // Αγορά - Διάθεση
					7, 3, // Παραλαβή εργασίας
					8, 3, // Ποιοτική - Ποσοτική παραλαβή
					9, 3, // Έκθεση
					25,3, // Βεβαίωση
					21,3, // Εκτελεσθέντες Εργασίες
					10,1, // Τιμολόγια
					17,1, // Φορολογική Ενημερότητα
					18,1, // Ασφαλιστική Ενημερότητα
					11,3, // Κρατήσεις
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					14,1, // ΦΕ
					15,1, // Κρατήσεις
					12,1, // Βεβαίωση ανεφοδιαστή
					13,1, // Βεβαίωση επισκευαστή
					16,1  // ΑΔΔΥ
				),

				array(	// ΚΑΤΑΣΚΕΥH EΡΓΩΝ ΑΠΟ ΟΠΛIΤΕΣ Ή ΕΡΓΑΤΟΤΕΧΝIΤΕΣ ΜΕ ΥΛΙΚA ΔΗΜΟΣIΟΥ Ή ΕΜΠΟΡIΟΥ | ΧΩΡΙΣ ΔΙΑΓΩΝΙΣΜΟ
					0, 1, // Διαβιβαστικό
					1, 1, // Εξώφυλλο
					2, 1, // Φύλλο καταχώρησης
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					5, 3, // Επιτροπές
					4, 1, // Διάθεση πίστωσης
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					19,3, // Αφανών Εργασιών
					20,3, // Αναλυτική Επιμέτρηση
					9, 3, // Έκθεση
					11,3, // Κρατήσεις
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					6, 3, // Αγορά - Διάθεση
					8, 3, // Ποιοτική - Ποσοτική παραλαβή
					10,1, // Τιμολόγια
					17,1, // Φορολογική Ενημερότητα
					18,1, // Ασφαλιστική Ενημερότητα
					14,1, // ΦΕ
					15,1, // Κρατήσεις
					25,3, // Βεβαίωση
					21,3, // Εκτελεσθείσες Εργασίες
					16,1, // ΑΔΔΥ
					22,3, // Οριστική Επιμέτρηση
					23,3, // Διοικητική Παράδοση
					24,3  // Προσωρινή - Οριστική Παραλαβή
				),

				array(	// ΚΑΤΑΣΚΕΥH EΡΓΩΝ ΑΠΟ ΕΡΓΟΛΗΠΤΙΚΗ ΕΠΙΧΕΙΡΗΣΗ ΜΕ ΥΛΙΚA ΔΗΜΟΣIΟΥ Ή ΕΜΠΟΡIΟΥ | ΧΩΡΙΣ ΔΙΑΓΩΝΙΣΜΟ
					0, 1, // Διαβιβαστικό
					1, 1, // Εξώφυλλο
					2, 1, // Φύλλο καταχώρησης
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					27,1, // Ορισμός Εργολάβου
					26,1, // Ορισμός Αξκου Έργου
					28,1, // Συμφωνητικό
					4, 1, // Διάθεση πίστωσης
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					29,1, // Επιτροπή Αφανών Εργασιών
					19,3, // Αφανών Εργασιών
					20,3, // Αναλυτική Επιμέτρηση
					22,3, // Οριστική Επιμέτρηση
					30,1, // Επιτροπή Προσωρινής Οριστικής Παραλαβής
					24,3, // Προσωρινή Παραλαβή
					23,3, // Διοικητική Παράδοση
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					9, 3, // Έκθεση
					11,3, // Κρατήσεις
					33,1, // Βεβαίωση Περάτωσης
					10,1, // Τιμολόγια
					17,1, // Φορολογική Ενημερότητα
					18,1, // Ασφαλιστική Ενημερότητα
					14,1, // ΦΕ
					15,1, // Κρατήσεις
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					31,1, // Επιτροπή Αγοράς Διάθεσης
					6, 3, // Αγορά - Διάθεση
					32,1, // Επιτροπή Ποιοτικής Ποσοτικής Παραλαβής
					8, 3, // Ποιοτική - Ποσοτική παραλαβή
					25,3, // Βεβαίωση
					21,3, // Εκτελεσθείσες Εργασίες
					16,1, // ΑΔΔΥ
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					34,1  // Τεύχη Μελέτης
				),

				array(	// ΚΑΤΑΣΚΕΥH EΡΓΩΝ ΑΠΟ ΕΡΓΟΛΗΠΤΙΚΗ ΕΠΙΧΕΙΡΗΣΗ | ΧΩΡΙΣ ΔΙΑΓΩΝΙΣΜΟ
					0, 1, // Διαβιβαστικό
					1, 1, // Εξώφυλλο
					2, 1, // Φύλλο καταχώρησης
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					4, 1, // Διάθεση πίστωσης
					27,1, // Ορισμός Εργολάβου
					26,1, // Ορισμός Αξκου Έργου
					28,1, // Συμφωνητικό
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					29,1, // Επιτροπή Αφανών Εργασιών
					19,3, // Αφανών Εργασιών
					20,3, // Αναλυτική Επιμέτρηση
					22,3, // Οριστική Επιμέτρηση
					30,1, // Επιτροπή Προσωρινής Οριστικής Παραλαβής
					24,3, // Προσωρινή Παραλαβή
					23,3, // Διοικητική Παράδοση
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					9, 3, // Έκθεση
					11,3, // Κρατήσεις
					33,1, // Βεβαίωση Περάτωσης
					10,1, // Τιμολόγια
					17,1, // Φορολογική Ενημερότητα
					18,1, // Ασφαλιστική Ενημερότητα
					14,1, // ΦΕ
					15,1, // Κρατήσεις
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					34,1  // Τεύχη Μελέτης
				),

				array(	// ΑΛΛΕΣ - ΜΗ ΥΠΟΣΤΗΡΙΖΟΜΕΝΕΣ ΑΚΟΜΑ
					0, 1, // Διαβιβαστικό
					1, 1, // Εξώφυλλο
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					3, 1, // ΥΠΟΦΑΚΕΛΟΣ
					9, 3,  // Έκθεση
					11, 3, // Κρατήσεις
				)

			);

			$a = $out[$k % 4];
			$k = array_keys($papers);
			echo 'common.VectorObject {';
			for($z = 0; $z < count($a); $z += 2) {
				echo 'cost.ContentItem {';
					echo get_java('Δικαιολογητικό', $k[$a[$z]]);
					echo get_java('Πλήθος', $a[$z + 1]);
				echo '};';
			}
			echo '};';
		}
}


if (!isset($data)) get_contents((int) $argv[2]);

?>