<?php
require_once('functions.php');
require_once('report.php');

/** Εξάγει μια σύμβαση.
 * Η σύμβαση εξάγεται χωρίς έναρξη και τέλος ενότητας.
 * @param array $per_contract Αν $output είναι ένα στοιχείο του $data['Συμβάσεις'], ειδάλλως είναι
 * ένα στοιχείο του $data['Διαγωνισμοί']
 * @param bool $output Δεν πρόκειται για σχέδιο σύμβασης */
function export_contract($per_contract, $output) {
	global $data;
	$invoices = $per_contract['Τιμολόγια'];
	// Αν είναι σχέδιο σύμβασης υπάρχουν κενά (σχέδιο είναι στην διακήρυξη)
	if ($output) {
		$contractor = $per_contract['Δικαιούχος'];
		$contractor['Επωνυμία'] = rtf($contractor['Επωνυμία']);
		$contract = $per_contract['Σύμβαση'];
		$contract_name = $contract['Σύμβαση'];
		$contract_title = $contract['Τίτλος'];
		$date = strftime('%d %b %y', $contract['Ημερομηνία']);
		// Μέχρι πότε πρέπει ο ανάδοχος να παραδώσει το αντικείμενο της σύμβασης
		$when = get_newer_timestamp($invoices);
		if (!isset($when)) $when = time() + 24 * 3600 * 1000 * ($data['Έργο'] ? 40 : 20);
		$when = strftime('%d %b %Y', $when);
	} else {
		$contract_name = $when = $date = '\u8230_\u8230_\u8230_';
		$contract_title = $per_contract['Διαγωνισμός']['Τίτλος'];
		$contractor = array('Επωνυμία' => $date, 'Τύπος' => 'Ιδιωτικός Τομέας');
	}
?>

\pard\plain\li5103
<?=wordwrap(rtf(strtouppergn($data['Μονάδα Πλήρες'])), 25, '\line ')?>\line <?=rtf(strtouppergn($data['Γραφείο']))?>\line<?=rtf($data['Έδρα'])?>, <?=$date?>\par

\pard\plain\sb283\sa60\qc\b{\ul ΣΥΜΒΑΣΗ <?=$contract_name?>}\par
\sb60 <?=rtf($contract_title)?>\par
<?php if ($output) echo euro($per_contract['Τιμές']['Καταλογιστέο']) . '\par' . PHP_EOL; ?>

\pard\plain\sb120\sa120\fi567\tx1134\tx1701\tx2268\qj
Σήμερα την <?=$date?>, οι υπογεγραμμένοι, <?=person($data['Δκτης'])?>, Δκτης <?=rtf(article(gender($data['Μονάδα Πλήρες']), 1) . ' ' . inflectPhrase($data['Μονάδα Πλήρες'], 1))?>, ως εκπρόσωπος του Ελληνικού Δημοσίου το οποίο στο εξής θα καλείται για συντομία «Στρατιωτική Υπηρεσία» και <?=isset($contractor['Ονοματεπώνυμο']) ? article(gender($contractor['Ονοματεπώνυμο']), 0) . ' ' . rtf($contractor['Ονοματεπώνυμο']) . ' ως' : 'ο'?> εκπρόσωπος της επιχείρησης «<?=$contractor['Επωνυμία']?>», η οποία στο εξής θα καλείται για συντομία «Επιχείρηση», συνήλθαν για το θέμα της σύμβασης και αφού συμφώνησαν, αποδέχθηκαν από κοινού τα ακόλουθα:\par

\sa30\qc{\b ΑΡΘΡΟ 1\par\sb30 Αντικείμενο - Οικονομικά Στοιχεία}\par\sa120\sb120\qj
1.\tab <?=ucfirst($per_contract['Κατηγορία'])?> όπως παρακάτω:\par
<?php
if ($output) report($invoices, $per_contract['Τιμές']);
else report_no_prices($invoices);
?>
\pard\plain\sb120\sa120\fi567\tx1134\tx1701\tx2268\qj
2.\tab Οι κρατήσεις <?php
if ($contractor['Τύπος'] == 'Ιδιωτικός Τομέας') {
	if (!isset($per_contract['Τιμές']) /*από διακήρυξη*/ || $per_contract['Τιμές']['ΦΕ'])
		echo 'και το ΦΕ, βαρύνουν την Επιχείρηση. Για το ΦΕ, χορηγείται βεβαίωση από τη Στρατιωτική Υπηρεσία.';
	else echo 'βαρύνουν την Επιχείρηση.';
} else echo 'βαρύνουν τη Στρατιωτική Υπηρεσία.';
?>\par

\sa30\qc{\b ΑΡΘΡΟ 2\par\sb30 Υποχρεώσεις Επιχείρησης}\par\sa120\sb120\qj
1.\tab Η Επιχείρηση πρέπει να έχει ολοκληρώσει την παράδοση του αντικειμένου της σύμβασης, στη Στρατιωτική Υπηρεσία, μέχρι <?=$when?>.\par
2.\tab Το αντικείμενο της σύμβασης πρέπει να παραδοθεί ποιοτικά και ποσοτικά σύμφωνο με την ισχύουσα νομοθεσία.\par
3.\tab Η Επιχείρηση, προ της υπογραφής της σύμβασης έχει προσυπογράψει τις προδιαγραφές, τεχνικές μελέτες και ότι άλλο συνοδεύει τη σύμβαση και οφείλει να παραδώσει το αντικείμενο της σύμβασης ποιοτικά και ποσοτικά σύμφωνο με τα έντυπα που προσυπέγραψε.\par
<?php if ($data['Έργο']) { ?>
4.\tab Η Επιχείρηση εκτέλεσε ενδελεχή αναγνώριση στην περιοχή και στο χώρο του έργου και έχει πλήρη επίγνωση όλων των τοπικών περιορισμών τους οποίους αργότερα δε θα επικαλεστεί ως ανωτέρα βία ή υπαιτιότητα της Στρατιωτικής Υπηρεσίας. Παράδειγμα τέτοιων περιορισμών περιλαμβάνουν τοπικά καιρικά φαινόμενα, διαμόρφωση κτηρίων, εναέρια ή υπόγεια δίκτυα, πύλες που παραμένουν κλειστές κτλ\par
<?php } ?>

\sa30\qc{\b ΑΡΘΡΟ 3\par\sb30 Παράδοση - Ποιοτικός Έλεγχος}\par\sa120\sb120\qj
Η ποιοτική παραλαβή πραγματοποιείται από καθορισμένη Επιτροπή της Στρατιωτικής Υπηρεσίας, η οποία συντάσσει Πρωτόκολλο Οριστικής Ποιοτικής και Ποσοτικής Παραλαβής, παρουσία Εκπροσώπου της Επιχείρησης. Αμφότεροι προσυπογράφουν το Πρωτόκολλο.\par

\sa30\qc{\b ΑΡΘΡΟ 4\par\sb30 Έκπτωση - Κυρώσεις - Διαιτησία}\par\sa120\sb120\qj
Σε περίπτωση που η Επιχείρηση δεν ανταποκριθεί στις παραπάνω υποχρεώσεις της, η Στρατιωτική Υπηρεσία επιβάλει αθροιστικά ή διαζευκτικά τις ακόλουθες κυρώσεις:\par
1.\tab Κήρυξη της Επιχείρησης έκπτωτης από την κατακύρωση που έχει γίνει στο όνομα της και γενικά από κάθε δικαίωμα που προκύπτει από αυτή.\par
2.\tab Κατάπτωση της εγγύησης καλής εκτέλεσης της σύμβασης υπέρ του Μετοχικού Ταμείου Στρατού.\par
<?php
 if (isset($per_contract['Διαγωνισμός'])) { ?>
3.\tab Ανάθεση του αντικειμένου της σύμβασης, είτε στον επόμενο μειοδότη του διαγωνισμού, είτε στο μειοδότη ενός επαναληπτικού διαγωνισμού, με την απόφαση να είναι στην ευχέρεια της Στρατιωτικής Υπηρεσίας
 <?php } else { ?>
3.\tab Ανάθεση του αντικειμένου της σύμβασης σε άλλο οικονομικό φορέα
 <?php } ?> και καταλογισμό σε βάρος της Επιχείρησης, της επιπρόσθετης αξίας, η οποία εισπράττεται, είτε με απομείωση οφειλών του Δημοσίου προς την Επιχείρηση, είτε με όσα προβλέπονται από τις διατάξεις του νόμου «Περί Εισπράξεως Δημοσίων Εσόδων».\par

\sa30\qc{\b ΑΡΘΡΟ 5\par\sb30 Εξαίρεση Επιβολής Κυρώσεων}\par\sa120\sb120\qj
Δεν επιβάλλονται κυρώσεις στην Επιχείρηση, αλλά χορηγείται παράταση των συμβατικών προθεσμιών παράδοσης του αντικειμένου της σύμβασης, εφόσον διαπιστωθεί:\par
1.\tab Υπαιτιότητα της Στρατιωτικής Υπηρεσίας.\par
\tab α.\tab Ενέργειες ή αδράνεια ή καταστάσεις που δεν ήταν γνωστές κατά την υπογραφή της σύμβασης, καθυστερούν την υλοποίηση του αντικειμένου της σύμβασης από την Επιχείρηση και οφείλονται στη Στρατιωτική Υπηρεσία.\par
\tab β.\tab Η Επιχείρηση θα πρέπει να έχει καταθέσει την προσβολή εγγράφως στη Στρατιωτική Υπηρεσία, μέχρι και 5 ημέρες μετά το περιστατικό που στοιχειοθετεί υπαιτιότητα της Στρατιωτικής Υπηρεσίας.\par
2.\tab Ανωτέρα βία.\par
\tab α.\tab Γεγονότα, συνέπεια των οποίων προκαλείται αδυναμία υλοποίησης του αντικειμένου της σύμβασης στον συμβατικό χρόνο.\par
\tab β.\tab Η ανωτέρα βία έχει το χαρακτηριστικό του έκτακτου. Δεν θεωρείται ανωτέρα βία κάτι που είναι γνωστό κατά την υπογραφή της σύμβασης.\par
\tab γ.\tab Η ανωτέρα βία δύναται μόνο να καθυστερήσει την υλοποίηση του αντικειμένου της σύμβασης και όχι να το ακυρώσει.\par
\tab δ.\tab Η ανωτέρα βία πρέπει να στοιχειοθετείται από την Επιχείρηση με έγγραφο που πρέπει να κατατεθεί στη Στρατιωτική Υπηρεσία εντός 10 ημερών από το συμβάν.\par
3.\tab Τόσο η έγκριση όσο και η έκταση της παράτασης υλοποίησης του αντικειμένου της σύμβασης, εξαιτίας των παραπάνω αιτιών ανήκει στην ευχέρεια της Στρατιωτικής Υπηρεσίας.\par
4.\tab Η έγκριση παράτασης από τη Στρατιωτική Υπηρεσία, δεν απαλλάσσει την Επιχείρηση από την αποζημίωση της Στρατιωτικής Υπηρεσίας, αν από την καθυστέρηση υλοποίησης του αντικειμένου της σύμβασης προκληθούν ζημιές στη Στρατιωτική Υπηρεσία.\par

\sa30\qc{\b ΑΡΘΡΟ 6\par\sb30 Πληρωμή - Δικαιολογητικά}\par\sa120\sb120\qj
Η πληρωμή της Επιχείρησης θα πραγματοποιηθεί με Τακτικό Χρηματικό Ένταλμα, όχι πριν υλοποιηθούν τα παρακάτω:\par
1.\tab Παραδώσει στη Στρατιωτική Υπηρεσία, το αντικείμενο της σύμβασης.\par
2.\tab Εκπρόσωπος προσυπογράψει το Πρωτόκολλο Επιτροπής Οριστικής Ποιοτικής και Ποσοτικής Παραλαβής της ομώνυμης επιτροπής.\par
3.\tab Υποβάλλει στη Στρατιωτική Υπηρεσία, τα τιμολόγια του αντικειμένου της σύμβασης.\par
4.\tab Υποβάλλει στη Στρατιωτική Υπηρεσία, Υπεύθυνη Δήλωση ΙΒΑΝ τραπεζικού λογαριασμού.\par
5.\tab Υποβάλλει στη Στρατιωτική Υπηρεσία, Υπεύθυνη Δήλωση ότι δεν εκπροσωπείται από πρόσωπο που αποστρατεύτηκε από τις Ένοπλες Δυνάμεις, μέχρι και πριν 5 χρόνια.\par
6.\tab Υποβάλλει στη Στρατιωτική Υπηρεσία, Φορολογική Ενημερότητα.\par
7.\tab Υποβάλλει στη Στρατιωτική Υπηρεσία, Ασφαλιστική Ενημερότητα.\par

\sa30\qc{\b ΑΡΘΡΟ 7\par\sb30 ’λλοι Γενικοί Όροι}\par\sa120\sb120\qj
1.\tab Αποκλείεται στην Επιχείρηση η εκχώρηση δικαιωμάτων και ευθυνών, εξ ολοκλήρου ή τμήματα αυτών, σε τρίτο.\par
2.\tab Κάθε διαφορά σχετικά με την ερμηνεία και την εκτέλεση της παρούσας καθώς και την μη ικανοποίηση από τη Στρατιωτική Υπηρεσία, θεμάτων του άρθρου 5, λύνεται από δικαστήριο.\par
3.\tab Η σύμβαση υπερισχύει κάθε άλλου κειμένου.\par
4.\tab Η Στρατιωτική Υπηρεσία δεν αναλαμβάνει καμία οικονομική υποχρέωση για αυξομειώσεις πάσης φύσεως δαπανών, φόρων τελών κλπ. που προκύψουν μετά την υπογραφή της σύμβασης.\par
5.\tab Μετά την υπογραφή της σύμβασης από τους προαναφερθέντες εκπροσώπους της Στρατιωτικής Υπηρεσίας και της Επιχείρησης, η Στρατιωτική Υπηρεσία αναθέτει στην Επιχείρηση το αντικείμενο του θέματος της σύμβασης και η Επιχείρηση αναλαμβάνει την εκτέλεσή του.\par
6.\tab Η σύμβαση συντάχθηκε σε 3 αντίγραφα, αναγνώσθηκε και υπογράφεται και από τους δύο συμβαλλόμενους, στην έδρα <?=article(gender($data['Μονάδα Πλήρες']), 1)?> <?=inflectPhrase($data['Μονάδα Πλήρες'], 1)?>.\par

\pard\plain\qc\par
\trowd\trkeep\trqc\trautofit1\trpaddfl3\trpaddl113\trpaddfr3\trpaddr113
\clftsWidth1\clNoWrap\cellx4394\clftsWidth1\clNoWrap\cellx8788
ΓΙΑ ΤΗ ΣΤΡΑΤΙΩΤΙΚΗ ΥΠΗΡΕΣΙΑ\line\line\line\line <?=person($data['Δκτης'])?>\line ΔΙΟΙΚΗΤΗΣ\cell
ΓΙΑ ΤΗΝ ΕΠΙΧΕΙΡΗΣΗ\line\line\line\line <?php if (isset($contractor['Ονοματεπώνυμο'])) echo rtf($contractor['Ονοματεπώνυμο']) . '\line '; ?>Εκπρόσωπος επιχείρησης\cell\row

<?php
}

/** Εξάγει όλες τις συμβάσεις της δαπάνης. */
function export_contracts() {
	global $data;
	init(7);
	foreach($data['Συμβάσεις'] as $per_contract) {
		start_35_20();
		export_contract($per_contract, true);
		echo '\sect' . PHP_EOL . PHP_EOL;
	}
}