<?php

/** Επιστρέφει ένα array με όλα τα ονόματα των Αναθετουσών Αρχών σαν κλειδιά τους ΑΑΗΤ σαν τιμές.
 * @param string|null $a Η αναθέτουσα αρχή της οποίας τα στοιχεία αναζητούμε ή null.
 * @return Αν $a είναι null τότε επιστρέφει λίστα με όλες τις αναθέτουσες αρχές. Ειδάλλως επιστρέφει
 * μόνο τα στοιχεία της δοσμένης αναθέτουσας αρχής. */
function contracting_authorities_list($a = null) {
	$b = array(
		'ΥΠΟΥΡΓΕΙΟ ΕΘΝΙΚΗΣ ΑΜΥΝΑΣ' => array('Κωδικός ΑΑΗΤ' => '1011.0000000000.0001', 'Σύντμηση' => 'ΥΠΕΘΑ'),
		'ΓΕΝΙΚΟ ΕΠΙΤΕΛΕΙΟ ΕΘΝΙΚΗΣ ΑΜΥΝΑΣ' => array('Κωδικός ΑΑΗΤ' => '1011.2010000000.0001', 'Σύντμηση' => 'ΓΕΕΘΑ'),
		'ΠΕΔΙΟ ΒΟΛΗΣ ΚΡΗΤΗΣ (ΠΒΚ)' => array('Κωδικός ΑΑΗΤ' => '1011.2010000000.0002', 'Σύντμηση' => 'ΠΒΚ'),
		'ΓΕΝΙΚΟ ΕΠΙΤΕΛΕΙΟ ΣΤΡΑΤΟΥ' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0001', 'Σύντμηση' => 'ΓΕΣ'),
		'1η ΣΤΡΑΤΙΑ/EU/QHQ «ΑΧΙΛΛΕΑΣ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0002', 'Σύντμηση' => '1 ΣΤΡΑΤΙΑ/EU/QHQ'),
		'Γ΄ ΣΣ «ΜΕΓΑΣ ΑΛΕΞΑΝΔΡΟΣ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0003', 'Σύντμηση' => 'Γ΄ ΣΣ'),
		'Δ΄ ΣΣ «ΘΡΑΚΗ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0004', 'Σύντμηση' => 'Δ΄ ΣΣ'),
		'ΑΣΔΕΝ «ΑΙΓΕΑΣ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0005', 'Σύντμηση' => 'ΑΣΔΕΝ'),
		'ΑΣΔΥΣ «ΘΗΣΕΑΣ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0006', 'Σύντμηση' => 'ΑΣΔΥΣ'),
		'Ι ΜΠ «ΣΜΥΡΝΗ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0007', 'Σύντμηση' => 'Ι ΜΠ'),
		'ΙΙ Μ/Κ ΜΠ «ΕΛΑΣΣΩΝ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0008', 'Σύντμηση' => 'ΙΙ Μ/Κ ΜΠ'),
		'ΧΙΙ Μ/Κ ΜΠ «ΕΒΡΟΥ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0009', 'Σύντμηση' => 'ΧΙΙ Μ/Κ ΜΠ'),
		'XVI Μ/Κ ΜΠ «ΔΙΔΥΜΟΤΕΙΧΟΥ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0010', 'Σύντμηση' => 'XVI Μ/Κ ΜΠ'),
		'ΧΧ ΤΘΜ «ΜΕΡΑΡΧΙΑ ΙΠΠΙΚΟΥ-ΜΑΚΕΔΟΝΙΑ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0011', 'Σύντμηση' => 'ΧΧ ΤΘΜ'),
		'95 ΑΔΤΕ «ΔΙΑΓΟΡΙΔΩΝ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0012', 'Σύντμηση' => '95 ΑΔΤΕ'),
		'98 ΑΔΤΕ «ΑΡΧΙΠΕΛΑΓΟΥΣ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0013', 'Σύντμηση' => '98 ΑΔΤΕ'),
		'ΜΕΡΥΠ' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0014'),
		'ΔΥΒ' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0015'),
		'8η Μ/Π ΤΑΞ «VIII ΜΠ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0016', 'Σύντμηση' => '8 Μ/Π ΤΑΞ'),
		'5η ΤΑΞΠΖ «V ΜΕΡΑΡΧΙΑ ΚΡΗΤΩΝ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0017', 'Σύντμηση' => '5 ΤΑΞΠΖ'),
		'9η Μ/Π ΤΑΞΠΖ «ΑΔΡΙΑΝΟΥΠΟΛΗ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0018', 'Σύντμηση' => '9 Μ/Π ΤΑΞΠΖ'),
		'29 Μ/Π ΤΑΞΠΖ «ΠΟΓΡΑΔΕΤΣ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0019', 'Σύντμηση' => '29 Μ/Π ΤΑΞΠΖ'),
		'3η Μ/Κ ΤΑΞ «ΡΙΜΙΝΙ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0020', 'Σύντμηση' => '3 Μ/Κ ΤΑΞ'),
		'7η Μ/Κ ΤΑΞ «ΣΑΡΑΝΤΑΠΟΡΟΣ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0021', 'Σύντμηση' => '7 Μ/Κ ΤΑΞ'),
		'30 Μ/Κ ΤΑΞ «ΤΟΜΟΡΙΤΣΑ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0022', 'Σύντμηση' => '30 Μ/Κ ΤΑΞ'),
		'31 Μ/Κ ΤΑΞ «ΚΑΜΙΑ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0023', 'Σύντμηση' => '31 Μ/Κ ΤΑΞ'),
		'34 Μ/Κ ΤΑΞ «ΑΠΟΣΠΑΣΜΑ ΣΧΟΥ ΔΙΑΛΕΤΗ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0025', 'Σύντμηση' => '34 Μ/Κ ΤΑΞ'),
		'50 Μ/Κ ΤΑΞΠΖ «ΑΨΟΣ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0026', 'Σύντμηση' => '50 Μ/Κ ΤΑΞΠΖ'),
		'71 Α/Μ ΤΑΞ «ΠΟΝΤΟΣ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0027', 'Σύντμηση' => '71 Α/Μ ΤΑΞ'),
		'1η ΤΑΞ Κ/Δ-ΑΛ «ΕΛ ΑΛΑΜΕΙΝ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0028', 'Σύντμηση' => '1 ΤΑΞ Κ/Δ-ΑΛ'),
		'32 ΤΑΞ ΠΖΝ «ΜΟΡΑΒΑ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0029', 'Σύντμηση' => '32 ΤΑΞ ΠΖΝ'),
		'88 ΣΔΙ «ΛΗΜΝΟΣ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0031', 'Σύντμηση' => '88 ΣΔΙ'),
		'79 ΑΔΤΕ «ΜΥΚΑΛΗ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0032', 'Σύντμηση' => '79 ΑΔΤΕ'),
		'80 ΑΔΤΕ «ΚΩΣ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0033', 'Σύντμηση' => '80 ΑΔΤΕ'),
		'96 ΑΔΤΕ «ΧΙΟΣ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0034', 'Σύντμηση' => '96 ΑΔΤΕ'),
		'ΧΧΙ ΤΘΤ [ΤΑΞ.ΙΠΠ «ΠΙΝΔΟΣ»]' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0035', 'Σύντμηση' => 'ΧΧΙ ΤΘΤ'),
		'ΧΧΙΙΙ ΤΘΤ [3Ο ΣΙ «ΔΟΡΥΛΑΙΟ»]' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0036', 'Σύντμηση' => 'ΧΧΙΙΙ ΤΘΤ'),
		'ΧΧΙV ΤΘΤ [1Ο ΣΙ «ΦΛΩΡΙΝΑΣ»]' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0037', 'Σύντμηση' => 'ΧΧΙV ΤΘΤ'),
		'ΧΧV ΤΘΤ [2Ο ΣΙ «ΕΦΕΣΣΟΣ»]' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0038', 'Σύντμηση' => 'ΧΧV ΤΘΤ'),
		'1η ΤΑΞΑΣ «ΚΙΛΚΙΣ-ΛΑΧΑΝΑ»' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0039', 'Σύντμηση' => '1 ΤΑΞΑΣ'),
		'IV ΤΑΞΥΠ' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0040'),
		'ΕΛΔΥΚ' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0041'),
		'ΑΣΔΥΣ/ΔΠΜ' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0042'),
		'ΔΙΟΙΚΗΣΗ ΚΕΝΤΡΩΝ ΕΦΟΔΙΑΣΜΟΥ ΜΟΝΑΔΩΝ ΣΤΡΑΤΟΥ (ΔΙΚΕΜΣ)' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0045', 'ΑΦΜ' => '090070164', 'Σύντμηση' => 'ΔΙΚΕΜΣ'),
		'ΣΤΡΑΤΙΩΤΙΚΟ ΦΑΡΜΑΚΕΙΟ ΑΘΗΝΩΝ' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0046', 'ΑΦΜ' => '090036306', 'Σύντμηση' => 'ΣΦΑ'),
		'ΣΕΑΠ-44 ΣΔΙ' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0047'),
		'VIη ΤΑΞΙΑΡΧΙΑ ΥΠΟΣΤΗΡΙΞΗΣ (VI ΤΑΞΥΠ)' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0048', 'Σύντμηση' => 'VI ΤΑΞΥΠ'),
		'10η ΜΗΧΑΝΟΠΟΙΗΜΕΝΗ ΤΑΞΙΑΡΧΙΑ (10 Μ/Π ΤΑΞ)' => array('Κωδικός ΑΑΗΤ' => '1011.2020000000.0049', 'Σύντμηση' => '10 Μ/Π ΤΑΞ'),
		'401 ΓΕΝΙΚΟ ΣΤΡΑΤΙΩΤΙΚΟ ΝΟΣΟΚΟΜΕΙΟ ΑΘΗΝΩΝ' => array('Κωδικός ΑΑΗΤ' => '1011.2029900200.0001', 'Σύντμηση' => '401 ΓΣΝΑ'),
		'424 ΓΕΝΙΚΟ ΣΤΡΑΤΙΩΤΙΚΟ ΝΟΣΟΚΟΜΕΙΟ ΕΚΠΑΙΔΕΥΣΕΩΣ' => array('Κωδικός ΑΑΗΤ' => '1011.2029900300.0001', 'Σύντμηση' => '424 ΓΣΝΕ'),
		'ΑΥΤΟΝΟΜΟΣ ΟΙΚΟΔΟΜΙΚΟΣ ΟΡΓΑΝΙΣΜΟΣ ΑΞΙΩΜΑΤΙΚΩΝ (Α.Ο.Ο.Α)' => array('Κωδικός ΑΑΗΤ' => '1011.E00012.0001', 'ΑΦΜ' => '090010259', 'Σύντμηση' => 'ΑΟΟΑ'),
		'ΤΑΜΕΙΟ ΕΘΝΙΚΗΣ ΑΜΥΝΑΣ' => array('Κωδικός ΑΑΗΤ' => '1011.E00013.0001', 'ΑΦΜ' => '997165051', 'Σύντμηση' => 'ΤΕΘΑ'),
		'ΝΟΣΗΛΕΥΤΙΚΟ ΙΔΡΥΜΑ ΜΕΤΟΧΙΚΟΥ ΤΑΜΕΙΟΥ ΣΤΡΑΤΟΥ (ΝΙΜΤΣ)' => array('Κωδικός ΑΑΗΤ' => '1011.E00015.0001', 'ΑΦΜ' => '090158844', 'Σύντμηση' => 'ΝΙΜΤΣ'),
		'ΜΕΤΟΧΙΚΟ ΤΑΜΕΙΟ ΣΤΡΑΤΟΥ' => array('Κωδικός ΑΑΗΤ' => '1011.E00016.0001', 'ΑΦΜ' => '090016633', 'Σύντμηση' => 'ΜΤΣ'),
		'ΕΙΔΙΚΟΣ ΚΛΑΔΟΣ ΟΙΚΟΝΟΜΙΚΗΣ ΕΝΙΣΧΥΣΗΣ ΜΕΡΙΣΜΑΤΟΥΧΩΝ ΣΤΡΑΤΟΥ ΞΗΡΑΣ' => array('Κωδικός ΑΑΗΤ' => '1011.E00018.0001', 'ΑΦΜ' => '999600282', 'Σύντμηση' => 'ΕΚΟΕΜΣ'),
		'ΕΙΔΙΚΟΣ ΛΟΓΑΡΙΑΣΜΟΣ ΑΛΛΗΛΟΒΟΗΘΕΙΑΣ ΣΤΡΑΤΟΥ' => array('Κωδικός ΑΑΗΤ' => '1011.E00019.0001', 'ΑΦΜ' => '090016621', 'Σύντμηση' => 'ΕΛΟΑΣ'),
		'ΤΑΜΕΙΟ ΑΡΩΓΗΣ ΜΟΝΙΜΩΝ ΠΟΛΙΤΙΚΩΝ ΥΠΑΛΛΗΛΩΝ ΥΕΘΑ/ΓΕΣ' => array('Κωδικός ΑΑΗΤ' => '1011.E00023.0001', 'ΑΦΜ' => '090145142', 'Σύντμηση' => 'ΤΑΜΠΥ/ΥΠΕΘΑ/ΓΕΣ'),
		'ΤΑΜΕΙΟ ΑΡΩΓΗΣ ΑΝΑΠΗΡΩΝ ΚΑΙ ΘΥΜΑΤΩΝ ΠΟΛΕΜΟΥ' => array('Κωδικός ΑΑΗΤ' => '1011.E00025.0001', 'ΑΦΜ' => '090016694', 'Σύντμηση' => 'ΤΑΑΘΠ'),
		'ΕΛΛΗΝΙΚΑ ΑΜΥΝΤΙΚΑ ΣΥΣΤΗΜΑΤΑ Α.Β.Ε.Ε. (Ε.Α.Σ.)' => array('Κωδικός ΑΑΗΤ' => '1011.E00029.0001', 'ΑΦΜ' => '997180750', 'Σύντμηση' => 'ΕΑΣ'),
		'ΛΕΣΧΗ ΑΞΙΩΜΑΤΙΚΩΝ ΕΝΟΠΛΩΝ ΔΥΝΑΜΕΩΝ (Λ.Α.Ε.Δ.)' => array('Κωδικός ΑΑΗΤ' => '1011.E00555.0001', 'ΑΦΜ' => '090009501', 'Σύντμηση' => 'ΛΑΕΔ'),
		'ΠΟΛΕΜΙΚΟ ΜΟΥΣΕΙΟ' => array('Κωδικός ΑΑΗΤ' => '1011.E00556.0001', 'ΑΦΜ' => '090372222'),
		'ΕΙΔΙΚΟΣ ΛΟΓΑΡΙΑΣΜΟΣ ΠΡΟΝΟΙΑΣ ΣΤΡΑΤΟΥ ΞΗΡΑΣ (ΕΛΠΣΞ)' => array('Κωδικός ΑΑΗΤ' => '1011.E00999.0001', 'ΑΦΜ' => '090016633', 'Σύντμηση' => 'ΕΛΠΣΞ'),
		'ΤΑΜΕΙΟ ΑΚΙΝΗΤΩΝ ΕΘΝΙΚΗΣ ΑΜΥΝΑΣ (Τ.Α.Εθ.Α)' => array('Κωδικός ΑΑΗΤ' => '1011.E01002.0001', 'ΑΦΜ' => '899958866', 'Σύντμηση' => 'ΤΑΕθΑ'),
		'ΕΝΩΣΗ ΑΠΟΣΤΡΑΤΩΝ ΑΞΙΩΜΑΤΙΚΩΝ ΣΤΡΑΤΟΥ (ΕΑΑΣ)' => array('Κωδικός ΑΑΗΤ' => '1011.F01120.0001', 'ΑΦΜ' => '090231150', 'Σύντμηση' => 'ΕΑΑΣ')
	);
	return $a === null ? $b : $b[$a];
}

/// Επιστρέφει μια λίστα με όλα τα ονόματα των αναθετουσών αρχών χωρισμένων με ';' για το gui.
function export_contracting_authorities() {
	$a = array_keys(contracting_authorities_list());
	$total = count($a) - 1;
	for ($i = 0; $i < $total; ++$i)
		echo $a[$i] . ';';
	echo $a[$i];
}

/** Αρχικοποιεί πεδία του $data στο στάδιο αρχικοποίησης 4, σχετικά με την Αναθέτουσα Αρχή.
 * Αρχικοποιεί το πεδίο 'Κωδικός ΑΑΗΤ', 'ΑΦΜ', 'Σχηματισμός' */
function init_contracting_authority() {
	global $data;
	$b = $data['Αναθέτουσα Αρχή'];
	$a = contracting_authorities_list($b);
	if ($a === null) trigger_error("Η Αναθέτουσα Αρχή '$b' δεν υπάρχει στο μητρώο");
	$data['Κωδικός ΑΑΗΤ'] = $a['Κωδικός ΑΑΗΤ'];
	$data['ΑΦΜ'] = isset($a['ΑΦΜ']) ? $a['ΑΦΜ'] : '090153025';
	$data['Σχηματισμός'] = isset($a['Σύντμηση']) ? $a['Σύντμηση'] : $b;
}

?>