<?
require_once('basic.php');

init_deduction_names();
init_invoices();
init_newer_invoice_date();
init_invoices_by_contractor();
check_invoices_contracts_contractors();
init_empty_fields();
/*var_dump($data);
die;
$bills_buy = getBillsCategory($bills, 'Παροχή υπηρεσιών', false);
$bills_contract = getBillsCategory($bills, 'Παροχή υπηρεσιών');
$bills_warrant = getBillsType($bills, '*Στρατός*Δημόσιο*');
$bills_hold = bills_by_hold($bills);
$bills_hold_all = bills_by_hold($bills, true);
$bills_fe = bills_by_fe($bills);


// συμπληρώνει όσα κελιά αφέθηκαν κενά
//if (!isset($data['Έργο']) && isset($data['Τίτλος'])) $data['Έργο'] = $data['Τίτλος'];
//if (!isset($data['ΠεριοχήΈργου'])) $data['ΠεριοχήΈργου'] = $data['Πόλη'];
//if (!isset($data['ΜέλοςΑφανώνΕργασιών']) && isset($data['ΑξκοςΈργου'])) $data['ΜέλοςΑφανώνΕργασιών'] = $data['ΑξκοςΈργου'];
//if (!isset($data['ΜέλοςΠροσωρινήςΟριστικήςΠαραλαβήςΒ']) && isset($data['ΑξκοςΈργου'])) $data['ΜέλοςΠροσωρινήςΟριστικήςΠαραλαβήςΒ'] = $data['ΑξκοςΈργου'];
//if (!isset($data['ΘέμαΔιαγωνισμού']) && isset($data['Έργο'])) $data['ΘέμαΔιαγωνισμού'] = $data['Έργο'];

// Λαμβάνει και ελέγχει την ημερομηνία του πιο νέου τιμολογίου
$a = null;
foreach($bills as $v)
	if (isset($v['Τιμολόγιο']) && preg_match('/(\d{1,2})-(\d{1,2})-(\d{4})/', $v['Τιμολόγιο'], $b)) {
		$b = mktime(0, 0, 0, $b[2], $b[1], $b[3]);
		if ($a < $b) $a = $b;
	}
if ($a) $a = $data['ΗμερομηνίαΤελευταίουΤιμολογίου'] = strftime('%d %b %Y', $a);

// συμπληρώνει όσες ημερομηνίες αφέθηκαν κενές
$b = array('ΗμερομηνίαΑφανώνΕργασιών', 'ΗμερομηνίαΟριστικήςΕπιμέτρησης', 'ΗμερομηνίαΠροσωρινήςΟριστικήςΠαραλαβής', 'ΗμερομηνίαΔιοικητικήςΠαράδοσης');
foreach($b as $v)
	if (isset($data[$v])) $a = chk_date($data[$v]);
	elseif ($a) $data[$v] = $a;

// Πέθανε αμα έχουμε έργο με δημόσιο διαγωνισμό
if (isset($data['ΤύποςΔαπάνης'], $data['ΤύποςΔιαγωνισμού']) && $data['ΤύποςΔαπάνης'] != 'Προμήθεια - Συντήρηση - Επισκευή' && $data['ΤύποςΔιαγωνισμού'] == 'Δημόσιος Διαγωνισμός')
	trigger_error('Τα έργα με Δημόσιο Διαγωνισμό γίνονται με ανάθεση σε εργοληπτικές επιχειρήσεις και επίβλεψη από ΔΣΕ', E_USER_ERROR);

// Συμπληρώνει τα κενά όταν έχουμε Διαγωνισμό
if (isset($data['ΤύποςΔαπάνης'], $data['ΤύποςΔιαγωνισμού']) && $data['ΤύποςΔαπάνης'] == 'Προμήθεια - Συντήρηση - Επισκευή' && $data['ΤύποςΔιαγωνισμού'] != 'Χωρίς Διαγωνισμό') {
	if (isset($data['ΠρόεδροςΔιαγωνισμού'])) $data['ΠρόεδροςΑγοράςΔιάθεσης'] = $data['ΠρόεδροςΔιαγωνισμού'];
	if (isset($data['ΜέλοςΔιαγωνισμούΑ'])) $data['ΜέλοςΑγοράςΔιάθεσηςΑ'] = $data['ΜέλοςΔιαγωνισμούΑ'];
	if (isset($data['ΜέλοςΔιαγωνισμούΒ'])) $data['ΜέλοςΑγοράςΔιάθεσηςΒ'] = $data['ΜέλοςΔιαγωνισμούΒ'];
}*/