<?php
require_once('functions.php');
require_once('order.php');

init(7);

$contracts = isset($data['Συμβάσεις'])
	? array_filter($data['Συμβάσεις'], function($per_contract) { return !isset($per_contract['Διαγωνισμός']); })
	: array();
foreach ($contracts as $per_contract) {
	$contract = $per_contract['Σύμβαση'];
	$to = get_contractor_recipient($per_contract['Δικαιούχος']);

	start_35_20();
	order_publish(ifexist($contract, 'Απόφαση Απευθείας Ανάθεσης'));
	order_header(ifexist2($output, $contract, 'Απόφαση Απευθείας Ανάθεσης'), $to, $data['Μονάδα'], $output, null,
			'Άλλα Θέματα Συμβάσεων (Απόφαση Απευθείας Ανάθεσης)',
			array(
				'ΝΔ.721/1970 Περί «Οικονομικής Μερίμνης και Λογιστικού των Ενόπλων Δυνάμεων» (Α\' 251)',
				'Ν.4270/2014 «Αρχές Δημοσιονομικής Διαχείρισης και Εποπτείας (Ενσωμάτωση της Οδηγίας (ΕΕ) 2011/85) - Δημόσιο Λογιστικό και Άλλες Διατάξεις»',
				'Ν.4412/2016 «Δημόσιες Συμβάσεις Έργων, Προμηθειών και Υπηρεσιών» (Α\' 147)',
				'Ν.4727/2020 «Ψηφιακή Διακυβέρνηση (Ενσωμάτωση στην Ελληνική Νομοθεσία της Οδηγίας (ΕΕ) 2016/2102 και της Οδηγίας (ΕΕ) 2019/1024) Ηλεκτρονικές Επικοινωνίες (Ενσωμάτωση στο Ελληνικό Δίκαιο της Οδηγίας (ΕΕ) 2018/1972) και Άλλες Διατάξεις» (Α\' 184)',
				$data['Απόφαση Ανάληψης Υποχρέωσης']['Ταυτότητα'],
				$contract['Πρόσκληση Υποβολής Προσφορών']['Ταυτότητα'],
			));
?>Έχοντας υπόψη:\par
α.\tab Τις διατάξεις των (α) έως (δ) σχετικών.\par
β.\tab Το (ε) σχετικό με το οποίο εγκρίθηκε η ανάληψη υποχρέωσης, σε βάρος πιστώσεων <?=$data['Τύπος Χρηματοδότησης']?> και Ειδικού Φορέα (ΕΦ) <?=$data['ΕΦ']?><?php
if ($data['Τύπος Χρηματοδότησης'] != 'Ιδίων πόρων')
	echo ", οικονομικού έτους " . date('Y', orelse($data, 'Ημερομηνία Τελευταίου Τιμολογίου', time())) . ', επί ΑΛΕ ' . $data['ΑΛΕ']; ?>.\par.
γ.\tab Το (στ) σχετικό το οποίο αφορά πρόσκληση υποβολής προσφορών για την «<?=rtf($contract['Τίτλος'])?>», με κριτήριο ανάθεσης την πλέον συμφέρουσα από οικονομική άποψη προσφορά, βάσει βέλτιστης σχέσης ποιότητας - τιμής.\par
\qc{\b ΑΠΟΦΑΣΙΖΕΤΑΙ}\par\qj
1.\tab Η ανάθεση στον οικονομικό φορέα με την επωνυμία <?=rtf(get_contractor_full_info($per_contract['Δικαιούχος']))?>, καταλογιστέας αξίας <?=euro($per_contract['Τιμές']['Καταλογιστέο'])?> (<?=euro2str($per_contract['Τιμές']['Καταλογιστέο'])?>).\par
2.\tab Στοιχεία Αναθέτουσας Αρχής:\par
\tab α.\tab Επωνυμία: <?=rtf($data['Μονάδα Πλήρες'])?> (<?=rtf($data['Αναθέτουσα Αρχή'])?>).\par
\tab β.\tab ΑΦΜ: <?=$data['ΑΦΜ']?>.\par
\tab γ.\tab Κωδικός Ηλεκτρονικής Τιμολόγησης: <?=rtf($data['Κωδικός ΑΑΗΤ'])?>.\par
\tab δ.\tab Διεύθυνση ηλεκτρονικού ταχυδρομείου: <?=rtf($data['email'])?>.\par
\tab ε.\tab Ταχυδρομική διεύθυνση: <?=rtf($data['Διεύθυνση'])?>.\par
\tab στ.\tab Δήμος: <?=rtf($data['Έδρα'])?>.\par
\tab ζ.\tab Ταχυδρομικός κωδικός: <?=rtf($data['Τ.Κ.'])?>.\par
\tab η.\tab Αρμόδιος για πληροφορίες: <?=person($data['Αξκος Γραφείου'])?>, τηλ. <?=rtf($data['Τηλέφωνο'])?>.\par
3.\tab Με βάση τα παραπάνω, απαιτείται υπογραφή σχετικής σύμβασης <?=rtf(article(gender($data['Μονάδα Πλήρες']), 1) . ' ' . inflectPhrase($data['Μονάδα Πλήρες'], 1))?> με τον παραπάνω οικονομικό φορέα για <?=rtf($contract['Τίτλος'])?>.\par
<?php
$count = 3;
if (published()) echo $count++ . '.\tab Το παρόν θα αναρτηθεί στο διαδικτυακό τόπο του «ΚΗΜΔΗΣ» από ' . rtf(article(gender($data['Μονάδα Πλήρες']), 2) . ' ' . inflectPhrase($data['Μονάδα Πλήρες'], 2)) . '.\par' . PHP_EOL; ?>
<?=$count++?>.\tab Παρακαλούμε για τις ενέργειές σας.\par
<?=$count++?>.\tab Χειριστής θέματος: <?=person($data['Αξκος Γραφείου'])?>, <?=rtf($data['Ιδιότητα Αξκου'])?>, τηλ. <?=rtf($data['Τηλέφωνο'])?>, διεύθυνση ηλεκτρονικού ταχυδρομείου <?=rtf($data['email'])?>.\par
<?php
order_footer($output);
order_recipient_table($to, $data['Μονάδα']);
?>

\sect

<?php
}

if (!is_expenditure() && !isset($per_contract)) trigger_error('Δεν έχουμε απευθείας ανάθεση', E_USER_ERROR);

unset($contract, $contracts, $per_contract, $count, $to);

rtf_close(__FILE__);