<?php
require_once('functions.php');
require_once('order.php');
require_once('report.php');

init(6);

if (has_direct_assignment()) {

start_35_20();
order_publish(ifexist($data, 'Απόφαση Απευθείας Ανάθεσης'));
order_header_recipients(ifexist2($output, $data, 'Απόφαση Απευθείας Ανάθεσης'), $output, null,
		'Απόφαση Απευθείας Ανάθεσης για ' . rtf(ucwords($data['Τίτλος'])),
		array(
			'ΝΔ.721/1970 Περί «Οικονομικής Μερίμνης και Λογιστικού των Ενόπλων Δυνάμεων» (Α\' 251)',
			'Ν.4270/2014 «Αρχές Δημοσιονομικής Διαχείρισης και Εποπτείας (Ενσωμάτωση της Οδηγίας (ΕΕ) 2011/85) - Δημόσιο Λογιστικό και Άλλες Διατάξεις»',
			'Ν.4412/2016 «Δημόσιες Συμβάσεις Έργων, Προμηθειών και Υπηρεσιών» (Α\' 147)',
			'Ν.4727/2020 «Ψηφιακή Διακυβέρνηση (Ενσωμάτωση στην Ελληνική Νομοθεσία της Οδηγίας (ΕΕ) 2016/2102 και της Οδηγίας (ΕΕ) 2019/1024) Ηλεκτρονικές Επικοινωνίες (Ενσωμάτωση στο Ελληνικό Δίκαιο της Οδηγίας (ΕΕ) 2018/1972) και Άλλες Διατάξεις» (Α\' 184)',
			'ΤΕ 61-4/2022/ΓΕΣ/ΔΟΙ',
			$data['Απόφαση Ανάληψης Υποχρέωσης']['Ταυτότητα']
		));
?>\tab Έχοντας υπόψη:\par
\tab α.\tab Τις διατάξεις των (α) έως (ε) σχετικών.\par
\tab β.\tab Το (στ) σχετικό με το οποίο εγκρίθηκε η ανάληψη υποχρέωσης, σε βάρος πιστώσεων <?=$data['Τύπος Χρηματοδότησης']?> και Ειδικού Φορέα (ΕΦ) <?=$data['ΕΦ']?><?php
if ($data['Τύπος Χρηματοδότησης'] != 'Ιδίων Πόρων')
	echo ", οικονομικού έτους " . date('Y', orelse($data, 'Ημερομηνία Τελευταίου Τιμολογίου', time()));
?>, επί ΑΛΕ <?=$data['ΑΛΕ']?>.\par
\tab γ.\tab Το (ζ) σχετικό το οποίο αφορά πρόσκληση υποβολής προσφορών για την «<?=rtf($data['Τίτλος'])?>», με κριτήριο ανάθεσης την πλέον συμφέρουσα από οικονομική άποψη προσφορά, βάσει βέλτιστης σχέσης ποιότητας - τιμής.\par
\qc{\b ΑΠΟΦΑΣΙΖΕΤΑΙ}\par\qj
<?php
$count = 1;
$contracts = array();
$to = array();	// Αποδέκτες
foreach($data['Δικαιούχοι'] as $per_contractor) {
	if (isset($per_contractor['Σύμβαση'])) {
		if (isset($per_contractor['Διαγωνισμός'])) continue;
		$contracts[] = $per_contractor['Σύμβαση']['Σύμβαση'];
	}
	$to[] = get_contractor_recipient($per_contractor['Δικαιούχος']);
	$invoices = $per_contractor['Τιμολόγια'];
	$contractor = $per_contractor['Δικαιούχος'];
	echo $count++ . '.\tab Η ανάθεση στον οικονομικό φορέα με την επωνυμία ' . rtf(get_contractor_full_info($contractor));
	if (isset($per_contractor['Σύμβαση']) && $per_contractor['Σύμβαση']['Τίτλος'] != $data['Τίτλος'])
		echo ', για «' . rtf($per_contractor['Σύμβαση']['Τίτλος']) . '»';
	echo ', καταλογιστέας αξίας ' . euro($per_contractor['Τιμές']['Καταλογιστέο']) . ' (' . euro2str($per_contractor['Τιμές']['Καταλογιστέο']) . ').\par';
} ?>

<?=$count++?>.\tab Με βάση τα παραπάνω, απαιτείται υπογραφή σχετικής σύμβασης <?=rtf(article(gender($data['Μονάδα Πλήρες']), 1) . ' ' . inflectPhrase($data['Μονάδα Πλήρες'], 1))?> με <?=count($contracts) == 1 ? 'τον παραπάνω οικονομικό φορέα' : 'τους παραπάνω οικονομικούς φορείς'?>.\par
<?=$count++?>.\tab Το παρόν θα αναρτηθεί στο διαδικτυακό τόπο του «ΚΗΜΔΗΣ» από <?=rtf(article(gender($data['Μονάδα Πλήρες']), 2) . ' ' . inflectPhrase($data['Μονάδα Πλήρες'], 2))?>.\par
<?=$count++?>.\tab Χειριστής θέματος: <?=personi($data['Αξκος Γραφείου'], 0)?>, τηλ. <?=rtf($data['Τηλέφωνο'])?>.\par
<?php
order_footer($output);
order_recipient_table($to, array($data['Μονάδα']));
?>

\sect

<?php
unset($contractor, $contracts, $count, $invoices, $per_contractor, $to);

}	// if

rtf_close(__FILE__);