<?php
require_once('functions.php');
require_once('order.php');
require_once('tender.php');
init(8);

/** Κοινό κείμενο. */
$common_func = function($tender) { ?>

3.\tab Το αντικείμενο του διαγωνισμού θα πραγματοποιηθεί με βάση τους όρους της διακήρυξης του διαγωνισμού, της προσφοράς του αναδόχου, η οποία είναι σύμφωνη με τη διακήρυξη και το σχέδιο σύμβασης που έχει επισυναφθεί στη διακήρυξη.\par
4.\tab Ο ανάδοχος, στον οποίο κοινοποιείται η παρούσα, οφείλει να προσέλθει μέχρι <?=strftime('%A, %d %b %y και ώρα %H:%M', $tender['Χρόνος Κατάθεσης Δικαιολογητικών Κατακύρωσης'])?> <?=rtf(at_unit_address())?>, προκειμένου να καταθέσει τα παρακάτω αποδεικτικά:\par
<?php
	contractor_legal_documents($tender);
};

foreach($data['Διαγωνισμοί'] as $per_tender) {
	$tender = $per_tender['Διαγωνισμός'];

	start_35_20();
	order_header_recipients(ifexist2($output, $tender, 'Απόφαση Ανάδειξης Προσωρινού Αναδόχου'), $output, 'Το (κα) σχετικό', 'Απόφαση Ανάδειξης Προσωρινού Αναδόχου',
			array(
				'ΝΔ.721/1970 (ΦΕΚ Α\' 251) περί «Οικονομικής Μερίμνης και Λογιστικού των Ενόπλων Δυνάμεων»',
				'Ν.2690/1999 (ΦΕΚ Α\' 45) «Κύρωση του Κώδικα Διοικητικής Διαδικασίας και άλλες διατάξεις» και ιδίως των άρθρων 7 και 13 έως 15',
				'Ν.3861/2010 (ΦΕΚ Α\' 112) «Ενίσχυση της διαφάνειας με την υποχρεωτική ανάρτηση νόμων και πράξεων των κυβερνητικών, διοικητικών και αυτοδιοικητικών οργάνων στο διαδίκτυο "Πρόγραμμα Διαύγεια" και άλλες διατάξεις»',
				'Ν.3871/2010 (ΦΕΚ Α\' 141/17-8-2010) «Δημοσιονομική Διαχείριση και Ευθύνη»',
				'Ν.4013/2011 (ΦΕΚ Α\' 204) «Σύσταση ενιαίας Ανεξάρτητης Αρχής Δημοσίων Συμβάσεων και Κεντρικού Ηλεκτρονικού Μητρώου Δημοσίων Συμβάσεων»',
				'Παρ. Ζ του Ν.4152/2013 (ΦΕΚ Α\' 107) «Προσαρμογή της ελληνικής νομοθεσίας στην Οδηγία 2011/7 της 16.2.2011 για την καταπολέμηση των καθυστερήσεων πληρωμών στις εμπορικές συναλλαγές»',
				'Ν.4172/2013 (ΦΕΚ Α\' 167/23-7-13) «Φορολογία εισοδήματος, επείγοντα μέτρα εφαρμογής του Ν.4046/2012, του Ν.4093/2012 και του Ν.4127/2013 και άλλες διατάξεις»',
				'Ν.4270/2014 (ΦΕΚ Α\' 143) «Αρχές δημοσιονομικής διαχείρισης και εποπτείας (ενσωμάτωση της οδηγίας 2011/85/ΕΕ) - Δημόσιο λογιστικό και άλλες διατάξεις»',
				'Ν.4412/2016 (ΦΕΚ Α\' 147) «Δημόσιες Συμβάσεις Έργων, Προμηθειών και Υπηρεσιών (προσαρμογή στις Οδηγίες 2014/24/ΕΕ και 2014/25/ΕΕ)»',
				'’ρθρο 47 του Ν.4472/17 (ΦΕΚ Α\' 74) «Συνταξιοδοτικές διατάξεις Δημοσίου και τροποποίηση διατάξεων του Ν.4387/16, μέτρα εφαρμογής των δημοσιονομικών στόχων και μεταρρυθμίσεων, μέτρα κοινωνικής στήριξης και εργασιακές ρυθμίσεις, Μεσοπρόθεσμο Πλαίσιο Δημοσιονομικής Στρατηγικής 2018-21 και λοιπές διατάξεις»',
				'Π.Δ. 80/2016 (ΦΕΚ Α\' 145) «Ανάληψη υποχρεώσεων από τους Διατάκτες» καθώς και τις οδηγίες ορθής εφαρμογής του, βάσει του υπ\' αριθμόν πρωτοκόλλου 2/1000018/0026/30-12-2016 εγγράφου του Υπουργείου Οικονομικών',
				'Φ.800/133/134893/19-11-2007 Απόφαση ΥΕΘΑ (ΦΕΚ Β\' 2300/03-12-2007) «Περί Μεταβίβασης Οικονομικής Εξουσίας σε Κεντρικά και Περιφερειακά Όργανα της Διοίκησης των Ενόπλων Δυνάμεων και σε Προϊσταμένους των Υπηρεσιών που εξαρτώνται από αυτές»',
				'Υπ\' αριθμ. Π1/2380/18 Δεκ 2012 Απόφαση για τη «Ρύθμιση των ειδικότερων θεμάτων λειτουργίας και διαχείρισης του Κεντρικού Ηλεκτρονικού Μητρώου Δημοσίων Συμβάσεων του Υπουργείου Ανάπτυξης, Ανταγωνιστικότητας, Υποδομών, μεταφορών και Δικτύων»',
				'Υπ\' αριθμ. 15143 Απόφαση του Υπουργείου Οικονομικών (ΦΕΚ Β\' 3335/11-12-14) «Καθορισμός του τρόπου υπολογισμού, της διαδικασίας παρακράτησης και απόδοσης της κράτησης υπέρ ΕΑΑΔΗΣΥ, καθώς και των λοιπών λεπτομερειών εφαρμογής της παραγράφου 3, άρθρου 4 του Ν.4013/11 (ΦΕΚ Α\' 204)',
				'Υπ\' αριθμ. 158/2016/25-10-16 (ΦΕΚ Β\' 3698/16-11-16) Απόφασης της ΕΑΑΔΗΣΥ «Έγκριση Ευρωπαϊκού Ενιαίου Εγγράφου Σύμβασης (ΕΕΕΣ)του άρθρου 79 παρ.4 του Ν.4412/16 (ΦΕΚ Α\' 147), για διαδικασίες σύναψης δημοσίας σύμβασης κάτω των ορίων των οδηγιών», όσον αφορά παρ. 4 άρθρου 79 Ν.4412/16 (ΦΕΚ Α\' 147)',
				'Υπ\' αριθμ. 1191/14-03-17 Απόφασης των Υπουργών Δικαιοσύνης, Διαφάνειας και Ανθρωπίνων Δικαιωμάτων και του Αναπληρωτή Υπουργού Οικονομικών περί «Καθορισμού του χρόνου, τρόπου υπολογισμού της διαδικασίας παρακράτησης και απόδοσης της κράτησης 0,06% υπέρ της Αρχής Εξέτασης 384627 Προδικαστικών Προσφυγών (Α.Ε.Π.Π.), καθώς και των λοιπών λεπτομερειών εφαρμογής της παρ. 3 άρθρου 350 του Ν.4412/16 (ΦΕΚ Α\' 147)',
				'Υπ\' αριθμ. 57654/22-05-17 (ΦΕΚ Β\' 1781/23-05-17) Απόφασης του Υπουργού Οικονομίας και περί «Ρύθμιση ειδικότερων θεμάτων λειτουργίας και διαχείρισης του Κεντρικού Ηλεκτρονικού Μητρώου Δημοσίων Συμβάσεων (ΚΗΜΔΗΣ) του Υπουργείου Οικονομίας και Ανάπτυξης',
				//TODO: 'Υπ\' αριθμ. ___Αφορά στον αριθμό που δίδεται στην εντολή αγοράς που αναρτάται στο ΚΗΜΔΗΣ από τον αρμόδιο φορέα (π.χ. εφοδιασμός) πριν από την υπογραφή της από το ΕΟΕ___ Πρωτογενές Αίτημα μέσω της πλατφόρμας του Κεντρικού Ηλεκτρονικού Μητρώου Δημοσίων Συμβάσεων (ΚΗΜΔΗΣ) για ' . $category,
				$data['Απόφαση Ανάληψης Υποχρέωσης']['Ταυτότητα'] . ' Απόφαση Ανάληψης Υποχρέωσης',
				//TODO: 'Υπ\' αριθμ. ___Αναγράφεται Αριθμός Διαδικτυακής Ανάρτησης Μητρώου (ΑΔΑΜ) του εγκεκριμένου αιτήματος, που αποτυπώνεται στην ΑΑΥ που αφορά στη συγκεκριμένη προμήθεια___ Εγκεκριμένο Αίτημα μέσω της πλατφόρμας του Κεντρικού Ηλεκτρονικού Μητρώου Δημοσίων Συμβάσεων (ΚΗΜΔΗΣ) για ' . $category,
				$data['Δγη Συγκρότησης Επιτροπών']['Ταυτότητα'] . ' με την οποία συγκροτήθηκε η Επιτροπή Διενέργειας Διαγωνισμού και Αξιολόγησης Προσφορών',
				$tender['Διακήρυξη Διαγωνισμού']['Ταυτότητα'] . ' διακήρυξη διαγωνισμού',
				'Εισήγηση της Επιτροπής Διενέργειας Διαγωνισμού και Αξιολόγησης Προσφορών που αφορά την αξιολόγηση των δικαιολογητικών συμμετοχής, των τεχνικών προσφορών και των οικονομικών προσφορών των οικονομικών φορέων'
			));
?>

\pard\plain\sb120\sa120\fi567\tx1134\tx1701\tx2268\qj 1.\tab Λαμβάνοντας υπόψη τα σχετικά, <?php
	// Κείμενο σχετικό με το ποιος απορρίφθηκε.
	$accepted = $tender['Προκριθέντες Β'];
	$rejected = $tender['Απορριφθέντες'];
	if (!count($accepted)) {
		echo 'δεν κρίνουμε αποδεκτές τις προσφορές των συμμετεχόντων οικονομικών φορέων, στους οποίους κοινοποιείται η παρούσα διαταγή, για τους παρακάτω λόγους:\par' . PHP_EOL;
		tender_rejected_competitors_list($rejected);
	} else {
		echo 'κρίνουμε αποδεκτές τις προσφορές των συμμετεχόντων οικονομικών φορέων, στους οποίους κοινοποιείται η παρούσα διαταγή, καθώς πληρούν τις απαιτήσεις της διακήρυξης';
		if (count($rejected)) {
			echo ', με εξαίρεση τους παρακάτω οικονομικούς φορείς που οι προσφορές τους δε γίνονται αποδεκτές για τους παρακάτω λόγους:\par' . PHP_EOL;
			tender_rejected_competitors_list($rejected);
		} else echo '.\par' . PHP_EOL;
	}
?>

2.\tab Κατόπιν των παραπάνω,\par
\qc{\b Α π ο φ α σ ί ζ ου μ ε}\par\qj
την αποδοχή της εισήγησης της Επιτροπής Διενέργειας Διαγωνισμού και Αξιολόγησης Προσφορών, όπως αποτυπώθηκε στο (κα) σχετικό, με <?php
	if (count($accepted)) {
		if ($tender['Προσφορά κατά είδος']) {
			unseal_per_item_contractors($tender);
			$common_func($tender);
			$par = 5;
		} else {
			$accepted = $tender['Μειοδότες'];
			if (count($accepted) != 1) {
				if (is_expenditure()) trigger_error('Ο διαγωνισμός δε μπορεί να είναι άγονος');
				echo 'την επανάληψη του διαγωνισμού σε 24 ώρες, με υποβολή κατ\' ελάχιστον νέων οικονομικών προσφορών, μόνο από τους παρακάτω οικονομικούς φορείς, οι οποίοι υπέβαλαν την οικονομικότερη προσφορά, αλλά ισόποση:\par' . PHP_EOL;
				foreach($accepted as $par => $competitor)
					tender_competitor($competitor['Ενδιαφερόμενος'], $par);
				$par = 3;
			} else {
				$contractor = $per_tender['Συμβάσεις'][0]['Ανάδοχος'];
				echo 'την αποδοχή της οικονομικότερης προσφοράς και την ανάδειξη ως προσωρινού αναδόχου, της επιχείρησης '
						. rtf($contractor['Επωνυμία']) . ' (ΑΦΜ: ' . rtf($contractor['ΑΦΜ']) .
						').\par' . PHP_EOL;
				$common_func($tender);
				$par = 5;
			}
		}
	} else {
		echo 'την επανάληψη του διαγωνισμού σε άλλο χρόνο, καθόσον καμία συμμετέχουσα επιχείρηση δεν πληρούσε τις απαιτήσεις της διακήρυξης.\par' . PHP_EOL;
		if (is_expenditure()) trigger_error('Ο διαγωνισμός δε μπορεί να είναι άγονος');
		$par = 3;
	}
?>

<?=$par?>.\tab Χειριστής θέματος: <?=personi($data['Αξκος Γραφείου'], 0)?>, τηλ. <?=rtf($data['Τηλέφωνο'])?>.\par
<?php
	order_footer($output);

	// Πίνακας αποδεκτών
	$to = array_map(function($competitor) { return get_contractor_recipient($competitor['Ενδιαφερόμενος']); },
			$tender['Ενδιαφερόμενοι']);
	order_recipient_table($to, array($data['Μονάδα']));
?>


\sect

<?php
	// Αποδεικτικό κοινοποίησης στον ανάδοχο
	if ($output && count($accepted))
		foreach($per_tender['Συμβάσεις'] as $contract)
			sharing_proof($contract['Ανάδοχος'], 'Απόφαση Ανάδειξης Προσωρινού Αναδόχου για το αντικείμενο '
					. $tender['Τίτλος'], $tender['Απόφαση Ανάδειξης Προσωρινού Αναδόχου']['Ταυτότητα']);

}	// foreach

unset($accepted, $common_func, $competitor, $contract, $contractor, $par, $per_tender, $rejected, $tender, $to);

rtf_close(__FILE__);