<?php
require_once('functions.php');
require_once('order.php');

init(7);

$contracts = isset($data['Συμβάσεις'])
	? array_filter($data['Συμβάσεις'], function($per_contract) { return !isset($per_contract['Διαγωνισμός']); })
	: array();
foreach ($contracts as $per_contract) {
	start_35_20();
	order_publish(ifexist($data, 'Απόφαση Απευθείας Ανάθεσης'));
	order_header_recipients(ifexist2($output, $per_contract['Σύμβαση'], 'Απόφαση Απευθείας Ανάθεσης'), $output, null,
			'Απόφαση Απευθείας Ανάθεσης για ' . rtf(ucwords($data['Τίτλος'])),
			array(
				'ΝΔ.721/1970 Περί «Οικονομικής Μερίμνης και Λογιστικού των Ενόπλων Δυνάμεων» (Α\' 251)',
				'Ν.4270/2014 «Αρχές Δημοσιονομικής Διαχείρισης και Εποπτείας (Ενσωμάτωση της Οδηγίας (ΕΕ) 2011/85) - Δημόσιο Λογιστικό και Άλλες Διατάξεις»',
				'Ν.4412/2016 «Δημόσιες Συμβάσεις Έργων, Προμηθειών και Υπηρεσιών» (Α\' 147)',
				'Ν.4727/2020 «Ψηφιακή Διακυβέρνηση (Ενσωμάτωση στην Ελληνική Νομοθεσία της Οδηγίας (ΕΕ) 2016/2102 και της Οδηγίας (ΕΕ) 2019/1024) Ηλεκτρονικές Επικοινωνίες (Ενσωμάτωση στο Ελληνικό Δίκαιο της Οδηγίας (ΕΕ) 2018/1972) και Άλλες Διατάξεις» (Α\' 184)',
				$data['Απόφαση Ανάληψης Υποχρέωσης']['Ταυτότητα'],
				$per_contract['Σύμβαση']['Πρόσκληση Υποβολής Προσφορών']['Ταυτότητα'],
			));
?>Έχοντας υπόψη:\par
α.\tab Τις διατάξεις των (α) έως (δ) σχετικών.\par
β.\tab Το (ε) σχετικό με το οποίο εγκρίθηκε η ανάληψη υποχρέωσης, σε βάρος πιστώσεων <?=$data['Τύπος Χρηματοδότησης']?> και Ειδικού Φορέα (ΕΦ) <?=$data['ΕΦ']?><?php
if ($data['Τύπος Χρηματοδότησης'] != 'Ιδίων Πόρων')
	echo ", οικονομικού έτους " . date('Y', orelse($data, 'Ημερομηνία Τελευταίου Τιμολογίου', time()));
?>, επί ΑΛΕ <?=$data['ΑΛΕ']?>.\par
γ.\tab Το (στ) σχετικό το οποίο αφορά πρόσκληση υποβολής προσφορών για την «<?=rtf($per_contract['Σύμβαση']['Τίτλος'])?>», με κριτήριο ανάθεσης την πλέον συμφέρουσα από οικονομική άποψη προσφορά, βάσει βέλτιστης σχέσης ποιότητας - τιμής.\par
\qc{\b ΑΠΟΦΑΣΙΖΕΤΑΙ}\par\qj
1.\tab Η ανάθεση στον οικονομικό φορέα με την επωνυμία <?=rtf(get_contractor_full_info($per_contract['Δικαιούχος']))?>, καταλογιστέας αξίας <?=euro($per_contract['Τιμές']['Καταλογιστέο'])?> (<?=euro2str($per_contract['Τιμές']['Καταλογιστέο'])?>).\par
2.\tab Με βάση τα παραπάνω, απαιτείται υπογραφή σχετικής σύμβασης <?=rtf(article(gender($data['Μονάδα Πλήρες']), 1) . ' ' . inflectPhrase($data['Μονάδα Πλήρες'], 1))?> με τον παραπάνω οικονομικό φορέα.\par
<?php
$count = 3;
if (published()) echo $count++ . '.\tab Το παρόν θα αναρτηθεί στο διαδικτυακό τόπο του «ΚΗΜΔΗΣ» από ' . rtf(article(gender($data['Μονάδα Πλήρες']), 2) . ' ' . inflectPhrase($data['Μονάδα Πλήρες'], 2)) . '.\par' . PHP_EOL; ?>
<?=$count++?>.\tab Παρακαλούμε για τις ενέργειές σας.\par
<?=$count++?>.\tab Χειριστής θέματος: <?=personi($data['Αξκος Γραφείου'], 0)?>, τηλ. <?=rtf($data['Τηλέφωνο'])?>.\par
<?php
order_footer($output);
order_recipient_table(array(get_contractor_recipient($per_contract['Δικαιούχος'])), array($data['Μονάδα']));
?>

\sect

<?php
}

if (!is_expenditure() && !isset($per_contract)) trigger_error('Δεν έχουμε απευθείας ανάθεση', E_USER_ERROR);

unset($contracts, $per_contract, $count);

rtf_close(__FILE__);