<?php
require_once('functions.php');
require_once('order.php');

init(4);

start_35_20();
order_publish(ifexist($data, 'Δγη Συγκρότησης Επιτροπών'));
order_header(ifexist2($output, $data, 'Δγη Συγκρότησης Επιτροπών'), array('Μέλη Επιτροπών'),
		array($data['Μονάδα']), $output, null, 'Συγκρότηση Επιτροπών',
		array(
			'Ν.2690/1999 «Κώδικας Διοικητικής Διαδικασίας» (Α\' 45)',
			'Ν.3213/2003 «Δήλωση και έλεγχος περιουσιακής κατάστασης βουλευτών, δημόσιων λειτουργών και υπαλλήλων, ιδιοκτητών μέσων μαζικής ενημέρωσης και άλλων κατηγοριών προσώπων» (Α\' 309)',
			'Ν.4412/2016 «Δημόσιες Συμβάσεις Έργων, Προμηθειών και Υπηρεσιών (Α\' 147)',
			'Ν.4727/2020 «Ψηφιακή Διακυβέρνηση (Ενσωμάτωση στην Ελληνική Νομοθεσία της Οδηγίας (ΕΕ) 2016/2102 και της Οδηγίας (ΕΕ) 2019/1024) Ηλεκτρονικές Επικοινωνίες (Ενσωμάτωση στο Ελληνικό Δίκαιο της Οδηγίας (ΕΕ) 2018/1972) και ’λλες Διατάξεις» (Α\' 184)',
			'ΤΕ 61-4/2022/ΓΕΣ/ΔΟΙ'
		));
?>
1.\tab Στο πλαίσιο των διαδικασιών σύναψης συμβάσεων προμηθειών και υπηρεσιών, καθώς και εκτέλεσης έργων και έχοντας υπόψη τα ανωτέρω σχετικά:\par
\qc{\b ΑΠΟΦΑΣΙΖΕΤΑΙ}\par\qj
\tab α.\tab\b Επιτροπή Παρακολούθησης και Παραλαβής Προμηθειών\b0, όπως παρακάτω:\par
\tab\tab (1)\tab <?=personi($data['Πρόεδρος Παραλαβής Προμηθειών'], 2)?> ως πρόεδρο\par
\tab\tab (2)\tab <?=personi($data['Α Μέλος Παραλαβής Προμηθειών'], 2)?> και\par
\tab\tab (3)\tab <?=personi($data['Β Μέλος Παραλαβής Προμηθειών'], 2)?> ως μέλη.\par
\tab β.\tab\b Επιτροπή Παραλαβής Υπηρεσιών\b0, όπως παρακάτω:\par
\tab\tab (1)\tab <?=personi($data['Πρόεδρος Παραλαβής Υπηρεσιών'], 2)?> ως πρόεδρο\par
\tab\tab (2)\tab <?=personi($data['Α Μέλος Παραλαβής Υπηρεσιών'], 2)?> και\par
\tab\tab (3)\tab <?=personi($data['Β Μέλος Παραλαβής Υπηρεσιών'], 2)?> ως μέλη.\par
\tab γ.\tab\b Επιτροπή Διενέργειας Διαγωνισμού και Αξιολόγησης Προσφορών\b0, όπως παρακάτω:\par
\tab\tab (1)\tab <?=personi($data['Πρόεδρος Διαγωνισμών'], 2)?> ως πρόεδρο\par
\tab\tab (2)\tab <?=personi($data['Α Μέλος Διαγωνισμών'], 2)?> και\par
\tab\tab (3)\tab <?=personi($data['Β Μέλος Διαγωνισμών'], 2)?> ως μέλη.\par
<?php if (is_expenditure() && $data['Έργο']) { ?>
\tab δ.\tab\b Αξιωματικό Έργου\b0, <?=article(gender($data['Αξκος Έργου']['Ονοματεπώνυμο']), 2)?> <?=personi($data['Αξκος Έργου'], 2)?>.\par
\tab ε.\tab\b Επιτροπή Αφανών Εργασιών\b0, όπως παρακάτω:\par
\tab\tab (1)\tab <?=personi($data['Πρόεδρος Αφανών Εργασιών'], 2)?> ως πρόεδρο και\par
\tab\tab (2)\tab <?=personi($data['Μέλος Αφανών Εργασιών'], 2)?> ως μέλος.\par
\tab στ.\tab\b Επιτροπή Προσωρινής και Οριστικής Παραλαβής\b0, όπως παρακάτω:\par
\tab\tab (1)\tab <?=personi($data['Πρόεδρος Προσωρινής και Οριστικής Παραλαβής'], 2)?> ως πρόεδρο\par
\tab\tab (2)\tab <?=personi($data['Α Μέλος Προσωρινής και Οριστικής Παραλαβής'], 2)?> και\par
\tab\tab (3)\tab <?=personi($data['Β Μέλος Προσωρινής και Οριστικής Παραλαβής'], 2)?> ως μέλη.\par
<?php } ?>
2.\tab Τα παραπάνω όργανα διενέργειας διαδικασιών σύναψης δημοσίων συμβάσεων θα επιλαμβάνονται του συνόλου των αρμοδιοτήτων του άρθρου 221 του (γ) σχετικού. Ειδικότερα:\par
\tab α.\tab\ul Επιτροπή Παρακολούθησης και Παραλαβής Προμηθειών και Επιτροπή Παραλαβής Υπηρεσιών\ul0:\par
\tab\tab (1)\tab Εισηγείται για όλα τα θέματα παραλαβής του φυσικού αντικειμένου της σύμβασης, προβαίνοντας, σε μακροσκοπικούς, λειτουργικούς ή και επιχειρησιακούς ελέγχους του προς παραλαβή αντικειμένου της σύμβασης, εφόσον προβλέπεται από τη σύμβαση ή κρίνεται αναγκαίο.\par
\tab\tab (2)\tab Συντάσσει τα σχετικά πρωτόκολλα.\par
\tab\tab (3)\tab Παρακολουθεί και ελέγχει την προσήκουσα εκτέλεση όλων των όρων της σύμβασης και την εκπλήρωση των υποχρεώσεων του αναδόχου και εισηγείται τη λήψη των επιβεβλημένων μέτρων λόγω μη τήρησης των ως άνω όρων.\par
\tab\tab (4)\tab Εισηγείται για ζητήματα τροποποίησης των συμβάσεων προμηθειών, σύμφωνα με το άρθρο 132 με την επιφύλαξη του άρθρου 41 του (γ) σχετικού.\par
\tab β.\tab\ul Επιτροπή Διενέργειας Διαγωνισμού και Αξιολόγησης Προσφορών\ul0:\par
\tab\tab (1)\tab Αξιολογεί τις προσφορές ή αιτήσεις συμμετοχής των προσφερόντων ή υποψηφίων.\par
\tab\tab (2)\tab Ελέγχει την καταλληλότητα των προσφερόντων ή υποψηφίων για τη συμμετοχή τους στη διαδικασία σύναψης δημόσιας σύμβασης.\par
\tab\tab (3)\tab Ελέγχει και αξιολογεί τις προσφορές.\par
\tab\tab (4)\tab Διαπραγματεύεται με τους προσφέροντες ή υποψηφίους, στο πλαίσιο ανταγωνιστική διαδικασίας με διαπραγμάτευση, ανταγωνιστικού διαλόγου ή σύμπραξης καινοτομίας.\par
\tab\tab (5)\tab Εισηγείται τον αποκλεισμό των προσφερόντων ή υποψηφίων από τη διαδικασία, την απόρριψη των προσφορών, την κατακύρωση των αποτελεσμάτων, την αποδέσμευση των εγγυήσεων, τη ματαίωση της διαδικασίας.\par
\tab\tab (6)\tab Γνωμοδοτεί για κάθε άλλο θέμα που ανακύπτει κατά τη διαδικασία ανάθεσης.\par
\tab\tab (7)\tab Γνωμοδοτεί για κάθε θέμα, που ανακύπτει από τη σύμβαση στο στάδιο της εκτέλεσης, και ιδίως επί της παράτασης του συμβατικού χρόνου, κάθε άλλης τροποποίησης της σύμβασης και της έκπτωσης του αναδόχου.\par
3.\tab Η θητεία των γνωμοδοτικών οργάνων είναι 2 έτη και τα υπόψη όργανα δεν απαλλάσσονται από τα έως τώρα ορισμένα καθήκοντά τους.\par
4.\tab Λαμβάνοντας υπόψη ότι <?=rtf(article(gender($data['Μονάδα Πλήρες']), 0) . ' ' . $data['Μονάδα'])?> δεν θα συνάψει σύμβαση με ιδιώτη, πάνω από 150.000,00 ή 300.000,00 για κατασκευή έργου, επισημαίνεται ότι, σύμφωνα με το (β) σχετικό, \ul δεν\ul0  υφίσταται υποχρέωση υποβολής αρχικής δήλωσης περιουσιακής κατάστασης εντός 90 ημερών από εκδόσεως της παρούσας διαταγής, για το σύνολο των στελεχών των επιτροπών.\par
5.\tab Το παρόν θα αναρτηθεί στο διαδικτυακό τόπο του «ΚΗΜΔΗΣ» από <?=rtf(article(gender($data['Μονάδα Πλήρες']), 2) . ' ' . inflectPhrase($data['Μονάδα Πλήρες'], 2))?>.\par
6.\tab Παρακαλούμε για τις ενέργειές σας.\par
7.\tab Χειριστής θέματος: <?=personi($data['Αξκος Γραφείου'], 0)?>, τηλ. <?=rtf($data['Τηλέφωνο'])?>.\par

<?php order_footer($output); ?>

\sect

<?php

rtf_close(__FILE__);