<?php
require_once('init.php');
require_once('order.php');
require_once('contract.php');
require_once('statement.php');
require_once('header.php');

foreach($data['Συμβάσεις'] as $contract) {
	if ($contract['Τύπος Διαγωνισμού'] == 'Απευθείας Ανάθεση') continue;

	$registerTS = $contract['Timestamp Διαγωνισμού'];
	if (isset($contract['Τόπος Διαγωνισμού'])) {
		$place = $contract['Τόπος Διαγωνισμού'];
		// Διαγωνισμός εκτός Μονάδας: κατάθεση δικαιολογητικών 24 ώρες πριν.
		$registerTS -= 3600 * 24;
	} else {
		$place = 'στην έδρα της Μονάδας (' . $data['Έδρα']
				. (isset($data['Διεύθυνση']) ? ', ' . $data['Διεύθυνση'] : null) . ')';
		// Διαγωνισμός στη Μονάδα: κατάθεση δικαιολογητικών 15 λεπτά πριν.
		$registerTS -= 60 * 15;
	}
	// Ποιός φορέας πληρώνει
	$payer = null;
	order($data['Απόφαση Ανάληψης Υποχρέωσης'], $payer);
	$payer = $payer[5];
	// Καταλογιστέο και ποσοστό κρατήσεων του διαγωνισμού
	foreach($data['Τιμολόγια ανά Δικαιούχο'] as $per_contractor)
		if (isset($per_contractor['Σύμβαση']) && $per_contractor['Σύμβαση'] == $contract) {
			foreach($per_contractor['Τιμολόγια'] as $invoice) {
				$total = $invoice['Κρατήσεις']['Σύνολο'];
				if (!isset($deduction)) $deduction = $total;
				else if ($total != $deduction) { $deduction = null; break; }
			}
			$total = $per_contractor['Τιμές']['Καταλογιστέο'];
			break;
		}

	start_35_20();
	order_publish('ΑΔΑ Διακήρυξης Διαγωνισμού', $draft);
	order_header_recipients(ifexist2(!$draft, $contract, 'Διακήρυξη Διαγωνισμού'), $draft, null, 'Διακήρυξη Διαγωνισμού',
			array(
				'Ν.4412/2016 (ΦΕΚ Α\' 147) «Δημόσιες Συμβάσεις Έργων, Προμηθειών και Υπηρεσιών (προσαρμογή στις Οδηγίες 2014/24/ΕΕ και 2014/25/ΕΕ)»',
				'Ν.4314/2014 (ΦΕΚ Α\' 265) «Α) Για τη διαχείριση, τον έλεγχο και την εφαρμογή αναπτυξιακών παρεμβάσεων για την προγραμματική περίοδο 2014-2020, Β) Ενσωμάτωση της Οδηγίας 2012/17 του Ευρωπαϊκού Κοινοβουλίου και του Συμβουλίου της 13ης Ιουνίου 2012 (EE L 156/16.6.2012) στο ελληνικό δίκαιο, τροποποίηση του ν. 3419/2005 (Α1297) και άλλες διατάξεις» και του Ν.3614/2007 (ΦΕΚ Α\' 267) «Διαχείριση, έλεγχος και εφαρμογή αναπτυξιακών παρεμβάσεων για την προγραμματική περίοδο 2007-2013»',
				'Ν.4270/2014 (ΦΕΚ Α\' 143) «Αρχές δημοσιονομικής διαχείρισης και εποπτείας (ενσωμάτωση της οδηγίας 2011/85/ΕΕ) - Δημόσιο λογιστικό και άλλες διατάξεις»',
				'Ν.4250/2014 (ΦΕΚ Α\' 74) «Διοικητικές Απλουστεύσεις - Καταργήσεις, Συγχωνεύσεις Νομικών Προσώπων και Υπηρεσιών του Δημοσίου Τομέα-Τροποποίηση Διατάξεων του Π.Δ. 318/1992 (ΦΕΚ Α\' 161) και λοιπές ρυθμίσεις» και ειδικότερα τις διατάξεις του άρθρου 1',
				'Παρ. Ζ του Ν.4152/2013 (ΦΕΚ Α\' 107) «Προσαρμογή της ελληνικής νομοθεσίας στην Οδηγία 2011/7 της 16.2.2011 για την καταπολέμηση των καθυστερήσεων πληρωμών στις εμπορικές συναλλαγές»',
				'Ν. 4129/2013 (ΦΕΚ Α\' 52) «Κύρωση του Κώδικα Νόμων για το Ελεγκτικό Συνέδριο»',
				'’ρθρο 26 του ν.4024/2011 (ΦΕΚ Α\' 226) «Συγκρότηση συλλογικών οργάνων της διοίκησης και ορισμός των μελών τους με κλήρωση»',
				'Ν.4013/2011 (ΦΕΚ Α\' 204) «Σύσταση ενιαίας Ανεξάρτητης Αρχής Δημοσίων Συμβάσεων και Κεντρικού Ηλεκτρονικού Μητρώου Δημοσίων Συμβάσεων»',
				'Ν.3861/2010 (ΦΕΚ Α\' 112) «Ενίσχυση της διαφάνειας με την υποχρεωτική ανάρτηση νόμων και πράξεων των κυβερνητικών, διοικητικών και αυτοδιοικητικών οργάνων στο διαδίκτυο "Πρόγραμμα Διαύγεια" και άλλες διατάξεις»',
				'’ρθρο 4 του Π.Δ.118/07 (ΦΕΚ Α\' 150)',
				'’ρθρο 5 της απόφασης με αριθμ. 11389/1993 (ΦΕΚ Β\' 185) του Υπουργού Εσωτερικών',
				'Ν.3548/2007 (ΦΕΚ Α\' 68) «Καταχώριση δημοσιεύσεων των φορέων του Δημοσίου στο νομαρχιακό και τοπικό Τύπο και άλλες διατάξεις»',
				'Ν.2859/2000 (ΦΕΚ Α\' 248) «Κύρωση Κώδικα Φόρου Προστιθέμενης Αξίας»',
				'Ν.2690/1999 (ΦΕΚ Α\' 45) «Κύρωση του Κώδικα Διοικητικής Διαδικασίας και άλλες διατάξεις» και ιδίως των άρθρων 7 και 13 έως 15',
				'Ν.2121/1993 (ΦΕΚ Α\' 25) «Πνευματική Ιδιοκτησία, Συγγενικά Δικαιώματα και Πολιτιστικά Θέματα»',
				'Π.Δ 28/2015 (ΦΕΚ Α\' 34) «Κωδικοποίηση διατάξεων για την πρόσβαση σε δημόσια έγγραφα και στοιχεία»',
				'Π.Δ. 80/2016 (ΦΕΚ Α\' 145) «Ανάληψη υποχρεώσεων από τους Διατάκτες»',
				'Της με αρ. 57654 (ΦΕΚ Β\' 1781/23.5.2017) Απόφασης του Υπουργού Οικονομίας και Ανάπτυξης «Ρύθμιση ειδικότερων θεμάτων λειτουργίας και διαχείρισης του Κεντρικού Ηλεκτρονικού Μητρώου Δημοσίων Συμβάσεων (ΚΗΜΔΗΣ) του Υπουργείου Οικονομίας και Ανάπτυξης»',
				'Της με αρ. 56902/215 (ΦΕΚ Β\' 1924/2.6.2017) Απόφασης του Υπουργού Οικονομίας και Ανάπτυξης «Τεχνικές λεπτομέρειες και διαδικασίες λειτουργίας του Εθνικού Συστήματος Ηλεκτρονικών Δημοσίων Συμβάσεων (Ε.Σ.Η.ΔΗ.Σ.)»',
				'ΝΔ.721/1970 (ΦΕΚ Α\' 251) περί «Οικονομικής Μερίμνης και Λογιστικού των Ενόπλων Δυνάμεων»',
				'N.2292/1995 (ΦΕΚ Α\' 35) «Οργάνωση και Λειτουργία Υπουργείου Εθνικής ’μυνας, διοίκηση και έλεγχος Ενόπλων Δυνάμεων και άλλες διατάξεις»',
				'Φ.032/8/66625/Σ.15516/05 Οκτ 17/Απόφαση ΑΝΥΕΘΑ (ΦΕΚ Β\' 3495)',
				$data['Απόφαση Ανάληψης Υποχρέωσης']
			));
?>
1.\tab Σε εκτέλεση του (κγ) σχετικού\par
\qc Π ρ ο κ η ρ ύ σ σ ο υ μ ε\par
\qj διαγωνισμό για «<?=rtf($contract['Τίτλος'])?>».\par
2.\tab Το είδος του διαγωνισμού είναι <?=$contract['Τύπος Διαγωνισμού']?>, σύμφωνα με τις διατάξεις των σχετικών.\par
3.\tab Η μέγιστη αξία της σύμβασης, μαζί με το ΦΠΑ, ανέρχεται στο ποσό των <?=euro($total)?>, ενώ υπόκειται και σε κρατήσεις <?=percent($deduction)?> επί της καθαρής αξίας. Οικονομικές προσφορές πάνω από το μέγιστο όριο θα απορριφθούν.\par
4.\tab Οι ενδιαφερόμενοι να καταθέσουν τις προσφορές τους, προσωπικά ή με εκπρόσωπο ή ταχυδρομικώς, <?=article(gender($data['Μονάδα Πλήρες']), 2, true)?> <?=rtf(inflectPhrase($data['Μονάδα Πλήρες'], 2))?>, <?=rtf(get_unit_address(false))?>. Η κατάθεση των προσφορών να ολοκληρωθεί μέχρι και <?=strftime('%A, %d %b %y, ώρα %H:%M', $registerTS)?>, χρονική στιγμή πέραν της οποίας δεν θα γίνονται δεκτές προσφορές.\par
5.\tab Τα υποχρεωτικά δικαιολογητικά που πρέπει να προσκομίσουν οι ενδιαφερόμενοι, είναι τα παρακάτω:\par
<?php
	$documents = $contract['Δικαιολογητικά'];
	$total = count($documents);
	for($z = 0; $z < $total; ++$z) {
		$document = $documents[$z]['Δικαιολογητικό'];
		echo '\tab ' . greeknum($z + 1) . '\tab ' . $document;
		while(substr($document, -2) == ' ή' && $z < $total) {
			$document = $documents[++$z]['Δικαιολογητικό'];
			echo ' ' . $document;
		}
		echo '\par' . PHP_EOL;
	}
	if ($contract['Τύπος Διαγωνισμού'] == 'Συνοπτικός Διαγωνισμός') {
?>6.\tab Τα δικαιολογητικά συμμετοχής να βρίσκονται εντός σφραγισμένου φακέλου, στον οποίο να αναγράφονται η επωνυμία της επιχείρησης του ενδιαφερόμενου και το ΑΦΜ της.\par
<?php } else {
?>6.\tab Η τεχνική προσφορά, να βρίσκεται εντός σφραγισμένου φακέλου στον οποίο να αναγράφεται «Τεχνική Προσφορά». Τόσο ο σφραγισμένος φάκελος τεχνικής προσφοράς, όσο και τα υπόλοιπα δικαιολογητικά συμμετοχής, να βρίσκονται εντός έταιρου σφραγισμένου φακέλου, στον οποίο να αναγράφονται η επωνυμία της επιχείρησης του ενδιαφερόμενου και το ΑΦΜ της.\par
<?php } ?>
7.\tab Οι προσφορές έχουν διάρκεια ισχύος τουλάχιστον 60 ημερών από την καταληκτική ημερομηνία υποβολής τους. Αν στην προσφορά αναγράφεται μικρότερη διάρκεια ισχύος, η προσφορά απορρίπτεται.\par
8.\tab Η αποσφράγιση των προσφορών θα πραγματοποιηθεί με δημόσια συνεδρία, <?=rtf($place)?>, <?=strftime('%A, %d %b %y και ώρα %H:%M', $contract['Timestamp Διαγωνισμού'])?>.\par
9.\tab Νικητής του διαγωνισμού θα αναδειχθεί ο ενδιαφερόμενος με την οικονομικότερη προσφορά, μόνο με βάση την τιμή.\par
10.\tab Ο φάκελος του διαγωνισμού με τα πρακτικά, την εισηγητική έκθεση και τα λοιπά δικαιολογητικά να υποβληθούν, από την επιτροπή, εντός διημέρου, από τη διενέργεια του διαγωνισμού, στην Υπηρεσία.\par
11.\tab Η κατακύρωση του διαγωνισμού τελεί υπό την έγκριση του Διοικητή της Αναθέτουσας Αρχής.\par
12.\tab Συνημμένα κοινοποιούνται τα παρακάτω έντυπα:\par
\tab α.\tab Τυποποιημένο Έντυπο Υπεύθυνης Δήλωσης.\par
\tab β.\tab Έντυπο Οικονομικής Προσφοράς.\par
\tab γ.\tab Υπεύθυνη Δήλωση, μη χρησιμοποίησης αντιπροσώπου, Αξκου των ΕΔ.\par
13.\tab Το αντικείμενο της σύμβασης κατατάσσεται στους ακόλουθους κωδικούς του κοινού λεξιλογίου δημόσιων συμβάσεων (CPV): <?=rtf($contract['CPV'])?><?php if (isset($contract['Συμπληρωματικό CPV'])) { ?> και συμπληρωματικού CPV: <?=rtf($contract['Συμπληρωματικό CPV'])?><?php } ?>.\par
14.\tab Η δαπάνη έχει εγκριθεί με τα παρακάτω στοιχεία:\par
\tab α.\tab Φορέας χρηματοδότησης: <?=rtf($payer)?>.\par
\tab β.\tab Ειδικός Φορέας (ΕΦ): <?=rtf($data['ΕΦ'])?>.\par
\tab γ.\tab Αναλυτικός Λογαριασμός Εσόδων/Εξόδων (ΑΛΕ): <?=rtf($data['ΑΛΕ'])?>.\par
\tab δ.\tab Οικονομικό Έτος: <?=date('Y', $contract['Timestamp Διαγωνισμού'])?>.\par
\tab ε.\tab Εις βάρος: <?=$data['Τύπος Χρηματοδότησης']?>.\par
15.\tab Χειριστής θέματος και αρμόδιος για πληροφορίες: <?=person($data['Αξκος Γραφείου'])?>, <?=rtf($data['Ιδιότητα Αξκου'])?>, τηλ.: <?=rtf($data['Τηλέφωνο'])?>.\par
<?php if ($data['Αναρτητέα στο διαδίκτυο']) { ?>
16.\tab Η παρούσα διακήρυξη διαγωνισμού αναρτάται στο ΚΗΜΔΗΣ και στο ΔΙΑΥΓΕΙΑ.\par

<?php }
	order_footer($draft);

	// Πίνακας αποδεκτών
	$to = array();
	foreach($contract['Διαγωνιζόμενοι'] as $contractor)
		$to[] = get_contractor_recipient($contractor);
	order_recipient_table($to, array($data['Μονάδα']));

	// Πίνακας παραρτημάτων
	$appendices = array('Σχέδιο Σύμβασης', 'Τεχνική Περιγραφή');
	if ($data['Έργο']) {
		$appendices[] = 'Τιμολόγιο Δημοπράτησης';
		$appendices[] = 'Ειδική Συγγραφή Υποχρεώσεων';
		$appendices[] = 'Τεχνική Συγγραφή Υποχρεώσεων';
		$appendices[] = 'Συμπληρωματικές Τεχνικές Προδιαγραφές';
		$appendices[] = 'Προϋπολογισμός Δημοπράτησης';
		$appendices[] = 'Τεχνική Μελέτη';
	}
	order_appendices($appendices);
?>

\sect


<?php
	if (get_first_script() == __FILE__) {
		// Εξαγωγή παραρτήματος "Α": Σχέδιο Σύμβασης
		start_35_20();
		appendix_header(ifexist2(!$draft, $contract, 'Διακήρυξη Διαγωνισμού'), 'Α', 'ΣΧΕΔΙΟ ΣΥΜΒΑΣΗΣ');
		echo '\pard\plain\brdrb\brdrdash\par' . PHP_EOL;
		export_contract($per_contractor, true);
		echo '\pard\plain\brdrt\brdrdash\par' . PHP_EOL;
		appendix_footer($draft);
		echo '\sect' . PHP_EOL . PHP_EOL;

		require('ΤΕΥΔ.php');
		require('Οικονομική Προσφορά.php');
		// Εξαγωγή κενής υπεύθυνης δήλωσης
		statement_representative(array(
			'Επωνυμία' => 'επωνυμία εταιρίας', 'Ονοματεπώνυμο' => '', 'Ονοματεπώνυμο Πατέρα' => '',
			'Ονοματεπώνυμο Μητέρας' => '', 'Ημερομηνία Γέννησης' => '', 'Τόπος Γέννησης' => '',
			'Αριθμός Ταυτότητας' => '', 'Διεύθυνση Κατοικίας' => '', 'Τηλέφωνο' => '',
			'Ημερομηνία Έκδοσης' => ''));
	}

}	// foreach

// Αν δεν έχει οριστεί η μεταβλητή, δεν υπάρχει διακήρυξη και πρέπει να εμφανιστεί σφάλμα
if (!isset($registerTS)) trigger_error('Δεν υπάρχει διαγωνισμός', E_USER_ERROR);

unset($appendices, $contract, $contractor, $deduction, $document, $documents, $invoice, $payer, $per_contractor, $place, $registerTS, $to, $total, $z);

rtf_close(__FILE__);