<?php
require_once('functions.php');
require_once('order.php');
require_once('contract.php');
require_once('statement.php');
require_once('tender.php');
init(8);

foreach($data['Διαγωνισμοί'] as $per_tender) {
	$tender = $per_tender['Διαγωνισμός'];
	// Ποσοστό κρατήσεων του διαγωνισμού (πρέπει όλα τα τιμολόγια να έχουν τις ίδιες κρατήσεις)
	foreach($per_tender['Τιμολόγια'] as $invoice) {
		$total = $invoice['Κρατήσεις']['Σύνολο'];
		if (!isset($deduction)) $deduction = $total;
		else if ($total != $deduction) { unset($deduction); break; }
	}

	start_35_20();
	order_publish(ifexist($tender, 'Διακήρυξη Διαγωνισμού'));
	order_header_recipients(ifexist2($output, $tender, 'Διακήρυξη Διαγωνισμού'), $output, null, 'Διακήρυξη Διαγωνισμού',
			array(
				'Ν.4412/2016 (ΦΕΚ Α\' 147) «Δημόσιες Συμβάσεις Έργων, Προμηθειών και Υπηρεσιών (προσαρμογή στις Οδηγίες 2014/24/ΕΕ και 2014/25/ΕΕ)»',
				'Ν.4314/2014 (ΦΕΚ Α\' 265) «Α) Για τη διαχείριση, τον έλεγχο και την εφαρμογή αναπτυξιακών παρεμβάσεων για την προγραμματική περίοδο 2014-2020, Β) Ενσωμάτωση της Οδηγίας 2012/17 του Ευρωπαϊκού Κοινοβουλίου και του Συμβουλίου της 13ης Ιουνίου 2012 (EE L 156/16.6.2012) στο ελληνικό δίκαιο, τροποποίηση του ν. 3419/2005 (Α1297) και άλλες διατάξεις» και του Ν.3614/2007 (ΦΕΚ Α\' 267) «Διαχείριση, έλεγχος και εφαρμογή αναπτυξιακών παρεμβάσεων για την προγραμματική περίοδο 2007-2013»',
				'Ν.4270/2014 (ΦΕΚ Α\' 143) «Αρχές δημοσιονομικής διαχείρισης και εποπτείας (ενσωμάτωση της οδηγίας 2011/85/ΕΕ) - Δημόσιο λογιστικό και άλλες διατάξεις»',
				'Ν.4250/2014 (ΦΕΚ Α\' 74) «Διοικητικές Απλουστεύσεις - Καταργήσεις, Συγχωνεύσεις Νομικών Προσώπων και Υπηρεσιών του Δημοσίου Τομέα-Τροποποίηση Διατάξεων του Π.Δ. 318/1992 (ΦΕΚ Α\' 161) και λοιπές ρυθμίσεις» και ειδικότερα τις διατάξεις του άρθρου 1',
				'Παρ. Ζ του Ν.4152/2013 (ΦΕΚ Α\' 107) «Προσαρμογή της ελληνικής νομοθεσίας στην Οδηγία 2011/7 της 16.2.2011 για την καταπολέμηση των καθυστερήσεων πληρωμών στις εμπορικές συναλλαγές»',
				'Ν.4129/2013 (ΦΕΚ Α\' 52) «Κύρωση του Κώδικα Νόμων για το Ελεγκτικό Συνέδριο»',
				'’ρθρο 26 του ν.4024/2011 (ΦΕΚ Α\' 226) «Συγκρότηση συλλογικών οργάνων της διοίκησης και ορισμός των μελών τους με κλήρωση»',
				'Ν.4013/2011 (ΦΕΚ Α\' 204) «Σύσταση ενιαίας Ανεξάρτητης Αρχής Δημοσίων Συμβάσεων και Κεντρικού Ηλεκτρονικού Μητρώου Δημοσίων Συμβάσεων»',
				'Ν.3861/2010 (ΦΕΚ Α\' 112) «Ενίσχυση της διαφάνειας με την υποχρεωτική ανάρτηση νόμων και πράξεων των κυβερνητικών, διοικητικών και αυτοδιοικητικών οργάνων στο διαδίκτυο "Πρόγραμμα Διαύγεια" και άλλες διατάξεις»',
				'’ρθρο 4 του Π.Δ.118/07 (ΦΕΚ Α\' 150)',
				'’ρθρο 5 της απόφασης με αριθμ. 11389/1993 (ΦΕΚ Β\' 185) του Υπουργού Εσωτερικών',
				'Ν.3548/2007 (ΦΕΚ Α\' 68) «Καταχώριση δημοσιεύσεων των φορέων του Δημοσίου στο νομαρχιακό και τοπικό Τύπο και άλλες διατάξεις»',
				'Ν.2859/2000 (ΦΕΚ Α\' 248) «Κύρωση Κώδικα Φόρου Προστιθέμενης Αξίας»',
				'Ν.2690/1999 (ΦΕΚ Α\' 45) «Κύρωση του Κώδικα Διοικητικής Διαδικασίας και άλλες διατάξεις» και ιδίως των άρθρων 7 και 13 έως 15',
				'Ν.2121/1993 (ΦΕΚ Α\' 25) «Πνευματική Ιδιοκτησία, Συγγενικά Δικαιώματα και Πολιτιστικά Θέματα»',
				'Π.Δ. 28/2015 (ΦΕΚ Α\' 34) «Κωδικοποίηση διατάξεων για την πρόσβαση σε δημόσια έγγραφα και στοιχεία»',
				'Π.Δ. 80/2016 (ΦΕΚ Α\' 145) «Ανάληψη υποχρεώσεων από τους Διατάκτες»',
				'Υπ\' αριθμ. 57654 (ΦΕΚ Β\' 1781/23.5.2017) Απόφαση του Υπουργού Οικονομίας και Ανάπτυξης «Ρύθμιση ειδικότερων θεμάτων λειτουργίας και διαχείρισης του Κεντρικού Ηλεκτρονικού Μητρώου Δημοσίων Συμβάσεων (ΚΗΜΔΗΣ) του Υπουργείου Οικονομίας και Ανάπτυξης»',
				'Υπ\' αριθμ. 56902/215 (ΦΕΚ Β\' 1924/2.6.2017) Απόφαση του Υπουργού Οικονομίας και Ανάπτυξης «Τεχνικές λεπτομέρειες και διαδικασίες λειτουργίας του Εθνικού Συστήματος Ηλεκτρονικών Δημοσίων Συμβάσεων (Ε.Σ.Η.ΔΗ.Σ.)»',
				'ΝΔ.721/1970 (ΦΕΚ Α\' 251) περί «Οικονομικής Μερίμνης και Λογιστικού των Ενόπλων Δυνάμεων»',
				'N.2292/1995 (ΦΕΚ Α\' 35) «Οργάνωση και Λειτουργία Υπουργείου Εθνικής ’μυνας, διοίκηση και έλεγχος Ενόπλων Δυνάμεων και άλλες διατάξεις»',
				'Φ.032/8/66625/Σ.15516/05 Οκτ 17/Απόφαση ΑΝΥΕΘΑ (ΦΕΚ Β\' 3495)',
				$data['Απόφαση Ανάληψης Υποχρέωσης']['Ταυτότητα'] . ' Απόφαση Ανάληψης Υποχρέωσης',
			));
?>
1.\tab Σε εκτέλεση του (κγ) σχετικού\par
\qc{\b Π ρ ο κ η ρ ύ σ σ ο υ μ ε}\par
\qj διαγωνισμό για «<?=rtf($tender['Τίτλος'])?>».\par
2.\tab Το είδος του διαγωνισμού είναι ανοικτή διαδικασία, σύμφωνα με τις διατάξεις των σχετικών.\par
3.\tab Η μέγιστη αξία της σύμβασης, μαζί με το ΦΠΑ, ανέρχεται στο ποσό των <?=euro($tender['Καταλογιστέο'])?>, ενώ υπόκειται και σε κρατήσεις <?=isset($deduction) ? percent($deduction) . ' ' : null?>επί της καθαρής αξίας. Οικονομικές προσφορές πάνω από το μέγιστο όριο θα απορριφθούν.\par
<?php if ($tender['Προσφορά κατά είδος']) { ?>
4.\tab Παρέχεται η δυνατότητα στους ενδιαφερόμενους να υποβάλουν προσφορά για αριθμό ειδών του διαγωνισμού. Πρέπει όμως απαρέγκλιτα να προσφέρεται το σύνολο της ποσότητας ανά είδος και όχι λιγότερη από αυτή. Συνέπεια του παραπάνω, είναι ότι ο διαγωνισμός δύναται να κατακυρωθεί σε περισσότερους του ενός αναδόχους.\par
<?php } else { ?>
4.\tab Οι προσφορές που θα υποβληθούν, πρέπει να αφορούν το συνολικό αντικείμενο του διαγωνισμού και όχι αριθμό ειδών αυτού. Συνέπεια του παραπάνω, είναι ότι ο διαγωνισμός θα κατακυρωθεί σε έναν μόνο ανάδοχο.\par
<?php } ?>
5.\tab Οι ενδιαφερόμενοι να καταθέσουν τις προσφορές τους, προσωπικά ή με εκπρόσωπο ή ταχυδρομικώς, <?=rtf(at_unit_address())?>. Η κατάθεση των προσφορών να ολοκληρωθεί μέχρι και <?=strftime('%A, %d %b %y, ώρα %H:%M', $tender['Χρόνος Αποσφράγισης Προσφορών'])?>, χρονική στιγμή πέραν της οποίας δεν θα γίνονται δεκτές προσφορές. Εξαίρεση αποτελεί η περίπτωση όπου, η παραλαβή προσφορών έχει αρχίσει εμπρόθεσμα και συνεχίζεται χωρίς διακοπή, λόγω του πλήθους των προσελθόντων ενδιαφερομένων οικονομικών φορέων.\par
6.\tab Τα δικαιολογητικά συμμετοχής που πρέπει να προσκομίσουν οι ενδιαφερόμενοι, είναι τα παρακάτω:\par
<?php
	foreach($tender['Δικαιολογητικά Συμμετοχής'] as $par => $document)
		echo '\tab ' . greeknum($par + 1) . '.\tab ' . $document . '.\par' . PHP_EOL;

	if (has_2_unseals($tender)) {
?>7.\tab Η οικονομική προσφορά να βρίσκεται εντός σφραγισμένου φακέλου στον οποίο να αναγράφονται κατ' ελάχιστον «ΟΙΚΟΝΟΜΙΚΗ ΠΡΟΣΦΟΡΑ», η επωνυμία της ενδιαφερόμενης επιχείρησης και το ΑΦΜ της. Τόσο ο φάκελος της οικονομικής προσφοράς, όσο και τα Δικαιολογητικά και η τεχνική προσφορά
<?php } else {
?>7.\tab Τα Δικαιολογητικά, η τεχνική προσφορά και η οικονομική προσφορά
<?php } ?>, να βρίσκονται εντός σφραγισμένου φακέλου, στον οποίο να αναγράφονται κατ' ελάχιστο η λέξη «ΠΡΟΣΦΟΡΑ», η ταυτότητα της διακήρυξης του διαγωνισμού<?=isset($tender['Διακήρυξη Διαγωνισμού']) ? ' «' . $tender['Διακήρυξη Διαγωνισμού']['Ταυτότητα'] . '»' : null?>, η επωνυμία της ενδιαφερόμενης επιχείρησης και το ΑΦΜ της. Δέον να αναγράφονται και λοιπά στοιχεία επικοινωνίας (Διεύθυνση, τηλέφωνο, διεύθυνση ηλεκτρονικού ταχυδρομείου κτλ).\par
8.\tab Οι προσφορές έχουν διάρκεια ισχύος τουλάχιστον 60 ημερών από την καταληκτική ημερομηνία υποβολής τους. Αν στην προσφορά αναγράφεται μικρότερη διάρκεια ισχύος, η προσφορά απορρίπτεται. Αν δεν αναγράφεται, λαμβάνεται ότι η διάρκεια είναι για 60 ημέρες.\par
9.\tab Η αποσφράγιση των προσφορών θα πραγματοποιηθεί με δημόσια συνεδρία, <?=rtf(at_unit_address())?>, <?=strftime('%A, %d %b %y και ώρα %H:%M', $tender['Χρόνος Αποσφράγισης Προσφορών'])?>.\par
10.\tab Ανάδοχος του διαγωνισμού θα αναδειχθεί ο ενδιαφερόμενος με την οικονομικότερη προσφορά, μόνο με βάση την τιμή.\par
11.\tab Μετά την ανάδειξη του Αναδόχου, αυτός θα πρέπει να προσκομίσει σε χρόνο που θα του οριστεί, τα παρακάτω δικαιολογητικά νομιμοποίησης:\par
<?php contractor_legal_documents($tender); ?>
12.\tab Ο φάκελος του διαγωνισμού με τα πρακτικά, την εισηγητική έκθεση και τα λοιπά δικαιολογητικά να υποβληθούν, από την επιτροπή, εντός διημέρου, από τη διενέργεια του διαγωνισμού, στην Υπηρεσία.\par
13.\tab Η κατακύρωση του διαγωνισμού τελεί υπό την έγκριση του Διοικητή της Αναθέτουσας Αρχής.\par
14.\tab Συνημμένα κοινοποιούνται τα παρακάτω έντυπα:\par
\tab α.\tab Ευρωπαϊκό Ενιαίο Έγγραφο Σύμβασης.\par
\tab β.\tab Έντυπο Οικονομικής Προσφοράς.\par
\tab γ.\tab Υπεύθυνη Δήλωση, μη χρησιμοποίησης αντιπροσώπου, Αξκου των ΕΔ.\par
15.\tab Το αντικείμενο της σύμβασης κατατάσσεται στους ακόλουθους κωδικούς του κοινού λεξιλογίου δημόσιων συμβάσεων (CPV): <?=rtf($tender['CPV'])?><?php if (isset($tender['Συμπληρωματικό CPV'])) { ?> και συμπληρωματικού CPV: <?=rtf($tender['Συμπληρωματικό CPV'])?><?php } ?>.\par
16.\tab Η δαπάνη έχει εγκριθεί με τα παρακάτω στοιχεία:\par
\tab α.\tab Φορέας χρηματοδότησης: <?=$data['Απόφαση Ανάληψης Υποχρέωσης']['Εκδότης']?>.\par
\tab β.\tab Ειδικός Φορέας (ΕΦ): <?=rtf($data['ΕΦ'])?>.\par
\tab γ.\tab Αναλυτικός Λογαριασμός Εσόδων/Εξόδων (ΑΛΕ): <?=rtf($data['ΑΛΕ'])?>.\par
\tab δ.\tab Οικονομικό Έτος: <?=date('Y', $tender['Χρόνος Αποσφράγισης Προσφορών'])?>.\par
\tab ε.\tab Εις βάρος: <?=$data['Τύπος Χρηματοδότησης']?>.\par
17.\tab Χειριστής θέματος και αρμόδιος για πληροφορίες: <?=person($data['Αξκος Γραφείου'])?>, <?=rtf($data['Ιδιότητα Αξκου'])?>, τηλ.: <?=rtf($data['Τηλέφωνο'])?>.\par
<?php
	order_footer($output);

	// Πίνακας αποδεκτών
	$to = array();
	if (published()) $to[] = '-';
	else
		foreach($tender['Ενδιαφερόμενοι'] as $competitor)
			$to[] = get_contractor_recipient($competitor['Ενδιαφερόμενος']);
	order_recipient_table($to, array($data['Μονάδα']));

	// Πίνακας παραρτημάτων
	$appendices = array('Σχέδιο Σύμβασης', 'Τεχνική Περιγραφή');
	if ($data['Έργο']) {
		$appendices[] = 'Τιμολόγιο Δημοπράτησης';
		$appendices[] = 'Ειδική Συγγραφή Υποχρεώσεων';
		$appendices[] = 'Τεχνική Συγγραφή Υποχρεώσεων';
		$appendices[] = 'Συμπληρωματικές Τεχνικές Προδιαγραφές';
		$appendices[] = 'Προϋπολογισμός Δημοπράτησης';
		$appendices[] = 'Τεχνική Μελέτη';
	}
	order_appendices($appendices);
?>

\sect


<?php
	// Οι διαγωνιζόμενοι τουλάχιστον 3
	if (!published() && count($tender['Ενδιαφερόμενοι']) < 3)
		trigger_error('Οι κληθέντες διαγωνιζόμενοι πρέπει να είναι τουλάχιστον 3');

	// Παραρτήματα και συνημμένα μόνο αν η διακήρυξη είναι αυτόνομη και όχι εντός δαπάνης
	if (!is_expenditure()) {
		// Εξαγωγή παραρτήματος "Α": Σχέδιο Σύμβασης
		start_35_20();
		appendix_header(ifexist2($output, $tender, 'Διακήρυξη Διαγωνισμού'), 'Α', 'ΣΧΕΔΙΟ ΣΥΜΒΑΣΗΣ');
		echo '\pard\plain\brdrb\brdrdash\par' . PHP_EOL;
		export_contract($per_tender, false);
		echo '\pard\plain\brdrt\brdrdash\par' . PHP_EOL;
		appendix_footer($output);
		echo '\sect' . PHP_EOL . PHP_EOL;

		require('Οικονομική Προσφορά.php');
		// Εξαγωγή κενής υπεύθυνης δήλωσης
		statement_representative(array(
			'Επωνυμία' => 'επωνυμία εταιρίας', 'Ονοματεπώνυμο' => '', 'Ονοματεπώνυμο Πατέρα' => '',
			'Ονοματεπώνυμο Μητέρας' => '', 'Ημερομηνία Γέννησης' => '', 'Τόπος Γέννησης' => '',
			'Αριθμός Ταυτότητας' => '', 'Διεύθυνση Κατοικίας' => '', 'Τηλέφωνο' => '',
			'Ημερομηνία Έκδοσης' => ''));
	}

}	// foreach

unset($appendices, $competitor, $deduction, $document, $invoice, $per_tender, $tender, $to, $total);

rtf_close(__FILE__);