<?php
require_once('init.php');
require_once('order.php');
require_once('tender.php');
require_once('header.php');

foreach($data['Διαγωνισμοί'] as $per_tender) {
	$tender = $per_tender['Διαγωνισμός'];
	// Οι συμβάσεις με όλα τα στοιχεία τους, που ανήκουν στο διαγωνισμό
	$contracts = array_values(array_filter($data['Συμβάσεις'], function($i) use($tender) {
		return isset($i['Διαγωνισμός']) && $i['Διαγωνισμός'] == $tender;
	}));
	$many = count($contracts) > 1;

	// Κατηγορία του είδους του διαγωνισμού
	//$category = tender_category($per_tender['Τιμολόγια']);

	start_35_20();
	order_header_recipients(ifexist2($output, $tender, 'Κατακύρωση Διαγωνισμού'), $output, 'Το (κβ) σχετικό', 'Κατακύρωση Διαγωνισμού',
			array(
				'ΝΔ.721/1970 (ΦΕΚ Α\' 251) περί «Οικονομικής Μερίμνης και Λογιστικού των Ενόπλων Δυνάμεων»',
				'Ν.2690/1999 (ΦΕΚ Α\' 45) «Κύρωση του Κώδικα Διοικητικής Διαδικασίας και άλλες διατάξεις» και ιδίως των άρθρων 7 και 13 έως 15',
				'Ν.3861/2010 (ΦΕΚ Α\' 112) «Ενίσχυση της διαφάνειας με την υποχρεωτική ανάρτηση νόμων και πράξεων των κυβερνητικών, διοικητικών και αυτοδιοικητικών οργάνων στο διαδίκτυο "Πρόγραμμα Διαύγεια" και άλλες διατάξεις»',
				'Ν.3871/2010 (ΦΕΚ Α\' 141/17-8-2010) «Δημοσιονομική Διαχείριση και Ευθύνη»',
				'Ν.4013/2011 (ΦΕΚ Α\' 204) «Σύσταση ενιαίας Ανεξάρτητης Αρχής Δημοσίων Συμβάσεων και Κεντρικού Ηλεκτρονικού Μητρώου Δημοσίων Συμβάσεων»',
				'Παρ. Ζ του Ν.4152/2013 (ΦΕΚ Α\' 107) «Προσαρμογή της ελληνικής νομοθεσίας στην Οδηγία 2011/7 της 16.2.2011 για την καταπολέμηση των καθυστερήσεων πληρωμών στις εμπορικές συναλλαγές»',
				'Ν.4172/2013 (ΦΕΚ Α\' 167/23-7-13) «Φορολογία εισοδήματος, επείγοντα μέτρα εφαρμογής του Ν.4046/2012, του Ν.4093/2012 και του Ν.4127/2013 και άλλες διατάξεις»',
				'Ν.4270/2014 (ΦΕΚ Α\' 143) «Αρχές δημοσιονομικής διαχείρισης και εποπτείας (ενσωμάτωση της οδηγίας 2011/85/ΕΕ) - Δημόσιο λογιστικό και άλλες διατάξεις»',
				'Ν.4412/2016 (ΦΕΚ Α\' 147) «Δημόσιες Συμβάσεις Έργων, Προμηθειών και Υπηρεσιών (προσαρμογή στις Οδηγίες 2014/24/ΕΕ και 2014/25/ΕΕ)»',
				'’ρθρο 47 του Ν.4472/17 (ΦΕΚ Α\' 74) «Συνταξιοδοτικές διατάξεις Δημοσίου και τροποποίηση διατάξεων του Ν.4387/16, μέτρα εφαρμογής των δημοσιονομικών στόχων και μεταρρυθμίσεων, μέτρα κοινωνικής στήριξης και εργασιακές ρυθμίσεις, Μεσοπρόθεσμο Πλαίσιο Δημοσιονομικής Στρατηγικής 2018-21 και λοιπές διατάξεις»',
				'Π.Δ. 80/2016 (ΦΕΚ Α\' 145) «Ανάληψη υποχρεώσεων από τους Διατάκτες» καθώς και τις οδηγίες ορθής εφαρμογής του, βάσει του υπ\' αριθμόν πρωτοκόλλου 2/1000018/0026/30-12-2016 εγγράφου του Υπουργείου Οικονομικών',
				'Φ.800/133/134893/19-11-2007 Απόφαση ΥΕΘΑ (ΦΕΚ Β\' 2300/03-12-2007) «Περί Μεταβίβασης Οικονομικής Εξουσίας σε Κεντρικά και Περιφερειακά Όργανα της Διοίκησης των Ενόπλων Δυνάμεων και σε Προϊσταμένους των Υπηρεσιών που εξαρτώνται από αυτές»',
				'Υπ\' αριθμ. Π1/2380/18 Δεκ 2012 Απόφαση για τη «Ρύθμιση των ειδικότερων θεμάτων λειτουργίας και διαχείρισης του Κεντρικού Ηλεκτρονικού Μητρώου Δημοσίων Συμβάσεων του Υπουργείου Ανάπτυξης, Ανταγωνιστικότητας, Υποδομών, μεταφορών και Δικτύων»',
				'Υπ\' αριθμ. 15143 Απόφαση του Υπουργείου Οικονομικών (ΦΕΚ Β\' 3335/11-12-14) «Καθορισμός του τρόπου υπολογισμού, της διαδικασίας παρακράτησης και απόδοσης της κράτησης υπέρ ΕΑΑΔΗΣΥ, καθώς και των λοιπών λεπτομερειών εφαρμογής της παραγράφου 3, άρθρου 4 του Ν.4013/11 (ΦΕΚ Α\' 204)',
				'Υπ\' αριθμ. 158/2016/25-10-16 (ΦΕΚ Β\' 3698/16-11-16) Απόφασης της ΕΑΑΔΗΣΥ «Έγκριση Τυποποιημένου Εντύπου Υπεύθυνης Δήλωσης (ΤΕΥΔ)του άρθρου 79 παρ.4 του Ν.4412/16 (ΦΕΚ Α\' 147), για διαδικασίες σύναψης δημοσίας σύμβασης κάτω των ορίων των οδηγιών», όσον αφορά παρ. 4 άρθρου 79 Ν.4412/16 (ΦΕΚ Α\' 147)',
				'Υπ\' αριθμ. 1191/14-03-17 Απόφασης των Υπουργών Δικαιοσύνης, Διαφάνειας και Ανθρωπίνων Δικαιωμάτων και του Αναπληρωτή Υπουργού Οικονομικών περί «Καθορισμού του χρόνου, τρόπου υπολογισμού της διαδικασίας παρακράτησης και απόδοσης της κράτησης 0,06% υπέρ της Αρχής Εξέτασης 384627 Προδικαστικών Προσφυγών (Α.Ε.Π.Π.), καθώς και των λοιπών λεπτομερειών εφαρμογής της παρ. 3 άρθρου 350 του Ν.4412/16 (ΦΕΚ Α\' 147)',
				'Υπ\' αριθμ. 57654/22-05-17 (ΦΕΚ Β\' 1781/23-05-17) Απόφασης του Υπουργού Οικονομίας και περί «Ρύθμιση ειδικότερων θεμάτων λειτουργίας και διαχείρισης του Κεντρικού Ηλεκτρονικού Μητρώου Δημοσίων Συμβάσεων (ΚΗΜΔΗΣ) του Υπουργείου Οικονομίας και Ανάπτυξης',
				//TODO: 'Υπ\' αριθμ. ___Αφορά στον αριθμό που δίδεται στην εντολή αγοράς που αναρτάται στο ΚΗΜΔΗΣ από τον αρμόδιο φορέα (π.χ. εφοδιασμός) πριν από την υπογραφή της από το ΕΟΕ___ Πρωτογενές Αίτημα μέσω της πλατφόρμας του Κεντρικού Ηλεκτρονικού Μητρώου Δημοσίων Συμβάσεων (ΚΗΜΔΗΣ) για ' . $category,
				$data['Απόφαση Ανάληψης Υποχρέωσης'] . ' Απόφαση Ανάληψης Υποχρέωσης' . (published() ? " (ΑΔΑ: {$data['ΑΔΑ Απόφασης Ανάληψης Υποχρέωσης']})" : null),
				//TODO: 'Υπ\' αριθμ. ___Αναγράφεται Αριθμός Διαδικτυακής Ανάρτησης Μητρώου (ΑΔΑΜ) του εγκεκριμένου αιτήματος, που αποτυπώνεται στην ΑΑΥ που αφορά στη συγκεκριμένη προμήθεια___ Εγκεκριμένο Αίτημα μέσω της πλατφόρμας του Κεντρικού Ηλεκτρονικού Μητρώου Δημοσίων Συμβάσεων (ΚΗΜΔΗΣ) για ' . $category,
				$data['Δγη Συγκρότησης Επιτροπών'] . ' με την οποία συγκροτήθηκε η Επιτροπή Διενέργειας Διαγωνισμού και Αξιολόγησης Προσφορών' . (published() || isset($data['ΑΔΑ Δγης Συγκρότησης Επιτροπών']) ? " (ΑΔΑ: {$data['ΑΔΑ Δγης Συγκρότησης Επιτροπών']})" : null),
				$tender['Διακήρυξη Διαγωνισμού'] . ' διακήρυξη ' . rtf(inflectPhrase($tender['Τύπος'], 1)) . (isset($tender['ΑΔΑ Διακήρυξης']) ? " (ΑΔΑ: {$tender['ΑΔΑ Διακήρυξης']})" : null),
				$tender['Απόφαση Ανάδειξης Προσωρινού Αναδόχου'] . ' απόφαση ανάδειξης προσωρινού αναδόχου',
				'Εισήγηση της Επιτροπής Διενέργειας Διαγωνισμού και Αξιολόγησης Προσφορών που αφορά τον έλεγχο των δικαιολογητικών κατακύρωσης του προσωρινού ανάδοχου'
			));
?>

\pard\plain\sb120\sa120\fi567\tx1134\tx1701\tx2268\qj 1.\tab Λαμβάνοντας υπόψη τα σχετικά\par
\qc{\b Α π ο φ α σ ί ζ ου μ ε}\par\qj
την αποδοχή της εισήγησης της Επιτροπής Διενέργειας Διαγωνισμού και Αξιολόγησης Προσφορών, όπως αποτυπώθηκε στο (κβ) σχετικό, και κατακυρώνουμε το διαγωνισμό<?php
	if ($many) {
		echo ', όπως παρακάτω:\par' . PHP_EOL;
		foreach($contracts as $par => $per_contract) {
			$contractor = $per_contract['Δικαιούχος'];
			echo '\tab ' . greekNum($par + 1) . '.\tab Στην επιχείρηση ' . rtf($contractor['Επωνυμία'])
				. ' (ΑΦΜ: ' . rtf($contractor['ΑΦΜ']) . '), για τα είδη:\par' . PHP_EOL;
			report($per_contract['Τιμολόγια'], $per_contract['Τιμές']);
			echo '\pard\plain\sb120\sa120\fi567\tx1134\tx1701\tx2268\qj' . PHP_EOL;
		}
	} else {
		$per_contract = $contracts[0];
		$contractor = $per_contract['Δικαιούχος'];
		echo ' στην επιχείρηση ' . rtf($contractor['Επωνυμία']) . ' (ΑΦΜ: '
				. rtf($contractor['ΑΦΜ']) . '), όπως παρακάτω:\par' . PHP_EOL;
		report($per_contract['Τιμολόγια'], $per_contract['Τιμές']);
		echo '\pard\plain\sb120\sa120\fi567\tx1134\tx1701\tx2268\qj' . PHP_EOL;
	}
?>

2.\tab Το αντικείμενο του διαγωνισμού θα πραγματοποιηθεί με βάση τους όρους της διακήρυξης του διαγωνισμού, της προσφοράς του αναδόχου, η οποία είναι σύμφωνη με τη διακήρυξη και το σχέδιο σύμβασης που έχει επισυναφθεί στη διακήρυξη.\par
3.\tab Ο ανάδοχος, στον οποίο κοινοποιείται η παρούσα, οφείλει να προσέλθει μέχρι <?=strftime('%A, %d %b %y και ώρα %H:%M', $per_tender['Χρόνος Υπογραφής Συμβάσεων'])?> <?=at_unit_address()?>, προκειμένου να υπογράψει τη σύμβαση.\par
<?php
	$par = 4;
	if ($tender['Εγγυητική Επιστολή Καλής Εκτέλεσης']) {
		++$par;
?>

4.\tab Για την υπογραφή της σύμβασης είναι απαραίτητη η προσκόμιση εγγυητικής επιστολής καλής εκτέλεσης, ποσοστού 5% της καθαρής αξίας της σύμβασης.\par
<?php
	}
?>

<?=$par?>.\tab Χειριστής θέματος: <?=personi($data['Αξκος Γραφείου'], 0)?>, τηλ. <?=rtf($data['Τηλέφωνο'])?>.\par
<?php
	order_footer($output);

	// Πίνακας αποδεκτών
	$to = array_map(function($contract) { return get_contractor_recipient($contract['Ανάδοχος']); },
			$per_tender['Συμβάσεις']);
	order_recipient_table($to, array($data['Μονάδα']));
?>


\sect

<?php
	// Αποδεικτικό κοινοποίησης στον ανάδοχο
	if ($output)
		foreach($per_tender['Συμβάσεις'] as $contract)
			sharing_proof($contract['Ανάδοχος'], 'Απόφαση Κατακύρωσης Διαγωνισμού για το αντικείμενο '
					. $tender['Τίτλος'], $tender['Κατακύρωση Διαγωνισμού']);

}	// foreach

unset(/*$category,*/ $contract, $contractor, $contracts, $many, $output, $par, $per_contract, $per_tender, $tender, $to);

rtf_close(__FILE__);