<?php
require_once('init.php');
require_once('header.php');

// Η οικονομική προσφορά εκτελείται, έχοντας ενεργές τις μεταβλητές της Διακήρυξης Διαγωνισμού

// Η σύμβαση αφορά έργο ή υπηρεσία (To $category ορίστηκε στο ΤΕΥΔ)
$conditions = $category == 'Κατασκευή Έργου' || $category == 'Παροχή Υπηρεσιών';
?>

\sectd\sbkodd\pgwsxn11906\pghsxn16838\marglsxn1984\margrsxn1134\margtsxn1134\margbsxn1134\facingp\margmirror

\pard\plain\sa226\qc{\b ΕΝΤΥΠΟ ΟΙΚΟΝΟΜΙΚΗΣ ΠΡΟΣΦΟΡΑΣ}\line
(άρθρου 124-126 ν. 4412/2016)\par

\qj Του οικονομικού φορέα ή της ένωσης οικονομικών φορέων \u8230>\u8230>\u8230> με έδρα \u8230>\u8230> , οδός \u8230>\u8230> , Τ.Κ. \u8230>\u8230> , τηλέφωνο \u8230>\u8230> , email \u8230>\u8230>\par
{\b Προς:} Την επιτροπή διεξαγωγής του διαγωνισμού για την ανάδειξη μειοδότη του αντικειμένου του διαγωνισμού.\par
{\b Αντικείμενο:} «<?=$tender['Τίτλος']?>».\par
Αφού έλαβα γνώση της διακήρυξης και των λοιπών στοιχείων δημοπράτησης του αντικειμένου<?php if ($conditions) echo ', καθώς και των συνθηκών εκτέλεσης του έργου αυτού'; ?>, υποβάλλω την παρούσα προσφορά και δηλώνω ότι αποδέχομαι πλήρως και χωρίς επιφύλαξη όλα αυτά και αναλαμβάνω την εκτέλεση του αντικειμένου της διακήρυξης <?php
if ($tender['Προσφορά κατά είδος']) {
	echo 'προσφέροντας καταλογιστέες τιμές για τα παρακάτω είδη:\par' . PHP_EOL;
	report_no_prices_no_sums($per_tender['Τιμολόγια']);
} else echo 'με καταλογιστέο κόστος \u8230_\u8230_ €.'; ?>

\par
\pard\plain\sa226\qc \u8230>\u8230> , \u8230>\u8230>\line{\fs20 (Τόπος και Ημερομηνία)}\par
{\b Ο ΠΡΟΣΦΕΡΩΝ}\line{\fs20 (Ονοματεπώνυμο υπογραφόντων και σφραγίδα επιχειρήσεων)}.\par

\sect

<?php

unset($category, $conditions);

rtf_close(__FILE__);