<?php
require_once('init.php');
require_once('order.php');
require_once('tender.php');
require_once('header.php');

foreach($data['Διαγωνισμοί'] as $per_tender) {
	$tender = $per_tender['Διαγωνισμός'];
	$contractors = get_names(array_values(array_map(
			function($contract) { return $contract['Ανάδοχος']['Επωνυμία']; },
			$per_tender['Συμβάσεις'])));

	start_35_20();
?>

\pard\plain\sa120\qc{\b\ul ΠΡΑΚΤΙΚΟ ΕΛΕΓΧΟΥ ΔΙΚΑΙΟΛΟΓΗΤΙΚΩΝ ΚΑΤΑΚΥΡΩΣΗΣ}\par

<?php unseal_intro_committee(); ?>
προέβη στον έλεγχο των δικαιολογητικών που κατατέθηκαν στο πλαίσιο διενέργειας του διαγωνισμού που προκηρύχθηκε με την <?=order($tender['Διακήρυξη Διαγωνισμού'])?>.\par
2.\tab Η επιτροπή ξεκίνησε τον έλεγχο των δικαιολογητικών την <?=strftime('%d %b %y και ώρα %H:%M', $tender['Χρόνος Κατάθεσης Δικαιολογητικών Κατακύρωσης'])?> τον έλεγχο των δικαιολογητικών κατακύρωσης, αφού σύμφωνα με το άρθρο 103 του Ν.4412/2016, κατατέθηκαν εμπρόθεσμα από τον προσωρινό ανάδοχο, μετά την έγγραφη πρόσκληση του.\par
3.\tab Τα απαιτούμενα δικαιολογητικά κοινοποιήθηκαν στον προσωρινό ανάδοχο με το έγγραφο <?=order($tender['Απόφαση Ανάδειξης Προσωρινού Αναδόχου'])?>.\par
4.\tab Από τον έλεγχο των δικαιολογητικών, διαπιστώθηκε η πληρότητα και η αρτιότητά τους.\par
5.\tab Κατόπιν των ανωτέρω, η Επιτροπή Διενέργειας Διαγωνισμού και Αξιολόγησης Προσφορών, λαμβάνοντας υπόψη:\par
\tab α.\tab Τη διακήρυξη <?=order($tender['Διακήρυξη Διαγωνισμού'])?>.\par
\tab β.\tab Τα υποβληθέντα δικαιολογητικά.\par
\tab γ.\tab Τις διατάξεις του Ν.4412/2016.\par
\tab δ.\tab Την απόφαση ανάληψης υποχρέωσης <?=order($data['Απόφαση Ανάληψης Υποχρέωσης'])?>.\par
\tab ε.\tab Τη βεβαίωση του Προϊσταμένου της Οικονομικής Υπηρεσίας, επί της ανωτέρω απόφασης ανάληψης υποχρέωσης, για την ύπαρξη διαθεσίμου ποσού, τη συνδρομή των προϋποθέσεων της παρ 1.α. του άρθρου 4 του ΠΔ 80/2016 και τη δέσμευση στο οικείο Μητρώο Δεσμεύσεων της αντίστοιχης πίστωσης.\par
\qc{\b ε ι σ η γ ε ί τ α ι}\par
\qj την κατακύρωση του προσωρινού αναδόχου του διαγωνισμού, με επωνυμία <?=rtf($contractors)?>, που αφορά <?=rtf($tender['Τίτλος'])?>.\par
6.\tab Για διαπίστωση των παραπάνω, συντάχθηκε το παρόν πρακτικό, το οποίο αφού αναγνώσθηκε και βεβαιώθηκε, υπογράφεται και κοινοποιείται στους συμμετέχοντες οικονομικούς φορείς που υπέβαλαν παραδεκτές προσφορές, κατά τα οριζόμενα στο άρθρο 103 του Ν.4412/2016.\par
<?php
	tender_committee_signs();
}	// foreach

unset($contractors, $per_tender, $tender);

rtf_close(__FILE__);