<?php
require_once('functions.php');
require_once('order.php');
require_once('report.php');
require_once('statement.php');

init(7);

$contracts = isset($data['Συμβάσεις'])
	? array_filter($data['Συμβάσεις'], function($per_contract) { return !isset($per_contract['Διαγωνισμός']); })
	: array();
foreach ($contracts as $per_contract) {
	$contract = $per_contract['Σύμβαση'];

	// Πίνακας αποδεκτών
	$to = null;
	if (!published()) {
		$to = array(get_contractor_recipient($per_contract['Δικαιούχος']));
		if (isset($contract['Προσκεκλημένος 1']))
			$to[] = get_contractor_recipient($contract['Προσκεκλημένος 1']);
		if (isset($contract['Προσκεκλημένος 2']))
			$to[] = get_contractor_recipient($contract['Προσκεκλημένος 2']);
	}

	start_35_20();
	order_publish(ifexist($contract, 'Πρόσκληση Υποβολής Προσφορών'));
	order_header(ifexist2($output, $contract, 'Πρόσκληση Υποβολής Προσφορών'), $to, $data['Μονάδα'],
			$output, 'Υπεύθυνη δήλωση', '’λλα Θέματα Συμβάσεων (Πρόσκληση Υποβολής Προσφορών)',
			array(
				'Ν.Δ.721/1970 «Περί Οικονομικής Μέριμνας και Λογιστικού των Ενόπλων Δυνάμεων» (Α\' 251)',
				'Ν.4270/2014 «Αρχές Δημοσιονομικής Διαχείρισης και Εποπτείας (Ενσωμάτωση της Οδηγίας 2011/85/ΕΕ) - Δημόσιο Λογιστικό και ’λλες Διατάξεις» (Α\' 143)',
				'Ν.4412/2016 «Δημόσιες Συμβάσεις Έργων, Προμηθειών και Υπηρεσιών (Α\' 147)',
				'Ν.4727/2020 «Ψηφιακή Διακυβέρνηση (Ενσωμάτωση στην Ελληνική Νομοθεσία της Οδηγίας (ΕΕ) 2016/2102 και της Οδηγίας (ΕΕ) 2019/1024) Ηλεκτρονικές Επικοινωνίες (Ενσωμάτωση στο Ελληνικό Δίκαιο της Οδηγίας (ΕΕ) 2018/1972) και ’λλες Διατάξεις» (Α\' 184)',
				$data['Απόφαση Ανάληψης Υποχρέωσης']['Ταυτότητα']
			));
?>
Έχοντας υπόψη:\par
α.\tab Τις διατάξεις των (α) έως (δ) σχετικών.\par
β.\tab Το (ε) σχετικό με το οποίο εγκρίθηκε η ανάληψη υποχρέωσης, σε βάρος πιστώσεων <?=$data['Τύπος Χρηματοδότησης']?> και Ειδικού Φορέα (ΕΦ) <?=$data['ΕΦ']?><?php
if ($data['Τύπος Χρηματοδότησης'] != 'Ιδίων Πόρων')
	echo ", οικονομικού έτους " . date('Y', orelse($data, 'Ημερομηνία Τελευταίου Τιμολογίου', time()));
?>, επί ΑΛΕ <?=$data['ΑΛΕ']?>.\par
\qc{\b ΑΠΟΦΑΣΙΖΕΤΑΙ}\par\qj
1.\tab Η <?=published() ? 'δημοσίευση' : 'αποστολή'?> πρόσκλησης υποβολής προσφορών για τη σύναψη σύμβασης, για «<?=rtf($contract['Τίτλος'])?>» με κριτήριο ανάθεσης την πλέον συμφέρουσα από οικονομική άποψη προσφορά, βάσει βέλτιστης σχέσης ποιότητας - τιμής.\par
2.\tab Στοιχεία Αναθέτουσας Αρχής:\par
\tab α.\tab Επωνυμία: <?=rtf($data['Μονάδα Πλήρες'])?> (<?=rtf($data['Αναθέτουσα Αρχή'])?>).\par
\tab β.\tab ΑΦΜ: <?=$data['ΑΦΜ']?>.\par
\tab γ.\tab Κωδικός Ηλεκτρονικής Τιμολόγησης: <?=rtf($data['Κωδικός ΑΑΗΤ'])?>.\par
\tab δ.\tab Διεύθυνση ηλεκτρονικού ταχυδρομείου: <?=rtf($data['email'])?>.\par
\tab ε.\tab Ταχυδρομική διεύθυνση: <?=rtf($data['Διεύθυνση'])?>.\par
\tab στ.\tab Δήμος: <?=rtf($data['Έδρα'])?>.\par
\tab ζ.\tab Ταχυδρομικός κωδικός: <?=rtf($data['Τ.Κ.'])?>.\par
\tab η.\tab Αρμόδιος για πληροφορίες: <?=person($data['Αξκος Γραφείου'])?>, τηλ. <?=rtf($data['Τηλέφωνο'])?>.\par
3.\tab Ο φάκελος της προσφοράς θα περιλαμβάνει τεχνική και οικονομική προσφορά και υπεύθυνη δήλωση του Ν.1599/1986 σύμφωνα με το υπόδειγμα της Προσθήκης 1 του Παραρτήματος «Α» του παρόντος.\par
4.\tab Επισημαίνεται ότι, καθίσταται υποχρεωτική από τους οικονομικούς φορείς, σε εφαρμογή της υπ' αριθμ. 52445/12-04-2023 ΚΥΑ «Υποχρέωση Υποβολής Ηλεκτρονικών Τιμολογίων από τους Οικονομικούς Φορείς» (Β΄ 2385), η έκδοση ηλεκτρονικού τιμολογίου, το οποίο αποτελεί στοιχείο κανονικότητας της δαπάνης, σύμφωνα με το υπό στοιχεία έγγραφο Α.Π.: οικ. 177326 ΕΞ 2024/ΥΠΕΘΟΟ/27-11-2024.\par
5.\tab Για την εσωτερική δρομολόγηση του ηλεκτρονικού τιμολογίου, ο ανάδοχος, κατά την έκδοση του ηλεκτρονικού τιμολογίου, συμπληρώνει υποχρεωτικά τα παρακάτω πεδία:\par
\tab α.\tab ΒΤ-10: <?=rtf($data['Μονάδα Πλήρες'])?>.\par
\tab β.\tab ΒΤ-11: <?=rtf($data['Απόφαση Ανάληψης Υποχρέωσης']['ΑΔΑ'])?>.\par
\tab γ.\tab ΒΤ-44: <?=rtf($data['Αναθέτουσα Αρχή'])?>.\par
\tab δ.\tab ΒΤ-46: <?=rtf($data['Κωδικός ΑΑΗΤ'])?>.\par
\tab ε.\tab ΒΤ-70: <?=rtf($data['Μονάδα Πλήρες'])?>.\par
\tab στ.\tab ΒΤ-71: <?=rtf($data['Κωδικός ΟΠΣ'])?>.\par
6.\tab Οι ελάχιστες απαιτήσεις - κριτήρια ποιοτικής επιλογής καθώς και τα απαιτούμενα είδη και ποσότητες τα οποία αφορούν στην υπόψη σύμβαση έχουν όπως στα Παραρτήματα «Α» και «Β» του παρόντος αντίστοιχα.\par
7.\tab Η συνολική προϋπολογισθείσα δαπάνη της σύμβασης ανέρχεται στο ποσό των <?=euro($data['Τιμές']['Καταλογιστέο'])?> (<?=euro2str($data['Τιμές']['Καταλογιστέο'])?>) συμπεριλαμβανομένου του ΦΠΑ.\par
8.\tab Συναφώς αναφέρεται ότι η δαπάνη υπόκειται στις νόμιμες κρατήσεις υπέρ δημοσίου, συνολικού ποσοστού <?=percent($per_contract['Τιμολόγια'][0]['Κρατήσεις']['Σύνολο'])?> επί της καθαρής αξίας της σύμβασης, οι οποίες βαρύνουν τον ανάδοχο και σε παρακράτηση Φόρου Εισοδήματος (ΦΕ) σύμφωνα με τα προβλεπόμενα στις διατάξεις του άρθρου 64 του ν.4172/2013.\par
<?php if (published()) { ?>
9.\tab Η καταληκτική ημερομηνία παραλαβής των προσφορών είναι 5 εργάσιμες ημέρες από την ανάρτηση στο ΚΗΜΔΗΣ της παρούσας.\par
<?php } else { ?>
9.\tab Η καταληκτική ημερομηνία παραλαβής των προσφορών είναι 5 εργάσιμες ημέρες από την παραλαβή της παρούσας με ενυπόγραφη απόδειξη.\par
<?php } ?>
10.\tab Οι προσφορές των προσκληθέντων οικονομικών φορέων θα υποβληθούν είτε μέσω ηλεκτρονικού ταχυδρομείου, είτε στο πρωτόκολλο της αναθέτουσας αρχής.\par
11.\tab Η διάρκεια ισχύος της προσφοράς καθορίζεται σε ένα μήνα από την υποβολή της.\par
12.\tab Η διάρκεια της σύμβασης ορίζεται σε ένα μήνα (ως διάρκεια σύμβασης προμήθειας, νοείται ο χρόνος μέχρι και την οριστική παραλαβή του συνόλου των ποσοτήτων των αγαθών).\par
<?php
$count = 13;
if (published()) echo $count++ . '.\tab Το παρόν θα αναρτηθεί στο διαδικτυακό τόπο του «ΚΗΜΔΗΣ» από ' . rtf(article(gender($data['Μονάδα Πλήρες']), 2) . ' ' . inflectPhrase($data['Μονάδα Πλήρες'], 2)) . '.\par' . PHP_EOL; ?>
<?=$count++?>.\tab Παρακαλούμε για τις ενέργειές σας.\par
<?=$count++?>.\tab Χειριστής θέματος: <?=person($data['Αξκος Γραφείου'])?>, <?=rtf($data['Ιδιότητα Αξκου'])?>, τηλ. <?=rtf($data['Τηλέφωνο'])?>, διεύθυνση ηλεκτρονικού ταχυδρομείου <?=rtf($data['email'])?>.\par

<?php
order_footer($output);
order_recipient_table($to, $data['Μονάδα']);
order_appendices(array('Ελάχιστες Απαιτήσεις - Κριτήρια Ποιοτικής Επιλογής', 'Απαιτούμενα Είδη και Ποσότητες'));
?>

\sect


<?php
	// Εξαγωγή παραρτήματος
	start_35_20();
	appendix_header(ifexist2($output, $contract, 'Πρόσκληση Υποβολής Προσφορών'), 'Α', 'ΕΛΑΧΙΣΤΕΣ ΑΠΑΙΤΗΣΕΙΣ - ΚΡΙΤΗΡΙΑ ΠΟΙΟΤΙΚΗΣ ΕΠΙΛΟΓΗΣ'); ?>

\pard\plain\sb120\sa120\fi567\tx1134\tx1701\tx2268\tx2835\qj
1.\tab Ελάχιστες Απαιτήσεις:\par
<?php if ($per_contract['Κατηγορία'] == 'Προμήθεια') { ?>
\tab α.\tab Οι ενδιαφερόμενοι θα υποβάλλουν τις προσφορές τους για το σύνολο των προαναφερόμενων ειδών.\par
\tab β.\tab Η παράδοση των ειδών θα λάβει χώρα από τον ανάδοχο στην έδρα <?=rtf(article(gender($data['Μονάδα Πλήρες']), 1) . ' ' . inflectPhrase($data['Μονάδα Πλήρες'], 1))?>\par
\tab γ.\tab Η συσκευασία και η μεταφορά του συνόλου των υλικών θα πραγματοποιηθεί με ευθύνη του αναδόχου. Κατά την παράδοση των ειδών θα παρευρίσκεται το αρμόδιο όργανο της Στρατιωτικής Υπηρεσίας και θα ελεγχθούν τα είδη και οι ποσότητες που θα παραδοθούν από τον ανάδοχο.
<?php } else { ?>
\tab Οι ενδιαφερόμενοι θα υποβάλλουν τις προσφορές τους για το σύνολο των προαναφερόμενων ειδών.\par
<?php } ?>
2.\tab Υποχρεωτικοί λόγοι αποκλεισμού (παράγραφος 1 του άρθρου 73 του ν. 4412/2016):\par
\tab α.\tab Υπάρχει εις βάρος του οικονομικού φορέα αμετάκλητη, καταδικαστική απόφαση για ένα από τα ακόλουθα εγκλήματα:\par
\tab\tab (1)\tab Συμμετοχή σε εγκληματική οργάνωση, όπως αυτή ορίζεται στο άρθρο 2 της απόφασης πλαίσιο 2008/841/ΔΕΥ του Συμβουλίου της 24ης Οκτωβρίου 2008, για την καταπολέμηση του οργανωμένου εγκλήματος (ΕΕ L 300 της 11.11.2008 σ. 42), και τα εγκλήματα του άρθρου 187 του Ποινικού Κώδικα (εγκληματική οργάνωση).\par
\tab\tab (2)\tab Ενεργητική δωροδοκία, όπως ορίζεται στο άρθρο 3 της σύμβασης περί της καταπολέμησης της δωροδοκίας στην οποία ενέχονται υπάλληλοι των Ευρωπαϊκών Κοινοτήτων ή των κρατών μελών της Ένωσης (ΕΕ C 195 της 25.6.1997, σ. 1) και στην παρ. 1 του άρθρου 2 της απόφασης πλαίσιο 2003/568/ΔΕΥ του Συμβουλίου της 22ας Ιουλίου 2003, για την καταπολέμηση της δωροδοκίας στον ιδιωτικό τομέα (ΕΕ L 192 της 31.7.2003, σ. 54), καθώς και, όπως ορίζεται στο εθνικό δίκαιο του οικονομικού φορέα, και τα εγκλήματα των άρθρων 159Α (δωροδοκία πολιτικών προσώπων), 236 (δωροδοκία υπαλλήλου), 237 παρ. 2-4 (δωροδοκία δικαστικών λειτουργών), 237Α παρ. 2 (εμπορία επιρροής μεσάζοντες), 396 παρ. 2 (δωροδοκία στον ιδιωτικό τομέα) του Ποινικού Κώδικα.\par
\tab\tab (3)\tab Απάτη εις βάρος των οικονομικών συμφερόντων της Ένωσης, κατά την έννοια των άρθρων 3 και 4 της Οδηγίας (ΕΕ) 2017/1371 του Ευρωπαϊκού Κοινοβουλίου και του Συμβουλίου της 5ης Ιουλίου 2017 σχετικά με την καταπολέμηση, μέσω του ποινικού δικαίου, της απάτης εις βάρος των οικονομικών συμφερόντων της Ένωσης (L 198/28.07.2017) και τα εγκλήματα των άρθρων 159Α (δωροδοκία πολιτικών προσώπων), 216 (πλαστογραφία), 236 (δωροδοκία υπαλλήλου), 237 παρ. 2-4 (δωροδοκία δικαστικών λειτουργών), 242 (ψευδής βεβαίωση, νόθευση κ.λπ.), 374 (διακεκριμένη κλοπή), 375 (υπεξαίρεση), 386 (απάτη), 386Α (απάτη με υπολογιστή), 386Β (απάτη σχετική με τις επιχορηγήσεις), 390 (απιστία) του Ποινικού Κώδικα και των άρθρων 155 επ. του Εθνικού Τελωνειακού Κώδικα (ν. 2960/2001, Α 265), όταν αυτά στρέφονται κατά των οικονομικών συμφερόντων της Ευρωπαϊκής Ένωσης ή συνδέονται με την προσβολή αυτών των συμφερόντων, καθώς και τα εγκλήματα των άρθρων 23 (διασυνοριακή απάτη σχετικά με τον ΦΠΑ) και 24 (επικουρικές διατάξεις για την ποινική προστασία των οικονομικών συμφερόντων της Ευρωπαϊκής Ένωσης) του ν. 4689/2020 (Α 103).\par
\tab\tab (4)\tab Τρομοκρατικά εγκλήματα ή εγκλήματα συνδεόμενα με τρομοκρατικές δραστηριότητες, όπως ορίζονται, αντιστοίχως στα άρθρα 3-4 και 5-12 της Οδηγίας (ΕΕ) 2017/541 του Ευρωπαϊκού Κοινοβουλίου και του Συμβουλίου της 15ης Μαρτίου 2017 για την καταπολέμηση της τρομοκρατίας και την αντικατάσταση της απόφασης πλαισίου 2002/475/ΔΕΥ του Συμβουλίου και για την τροποποίηση της απόφασης 2005/671/ΔΕΥ του Συμβουλίου (EE L 88/31.03.2017) ή ηθική αυτουργία ή συνέργεια ή απόπειρα διάπραξης εγκλήματος, όπως ορίζονται στο άρθρο 14 αυτής, και τα εγκλήματα των άρθρων 187Α και 187Β του Ποινικού Κώδικα, καθώς και τα εγκλήματα των άρθρων 32-35 του ν. 4689/2020 (Α 103).\par
\tab\tab (5)\tab Νομιμοποίηση εσόδων από παράνομες δραστηριότητες ή χρηματοδότηση της τρομοκρατίας, όπως αυτές ορίζονται στο άρθρο 1 της Οδηγίας (ΕΕ) 2015/849 του Ευρωπαϊκού Κοινοβουλίου και του Συμβουλίου, της 20ης Μαΐου 2015, σχετικά με την πρόληψη της χρησιμοποίησης του χρηματοπιστωτικού συστήματος για τη νομιμοποίηση εσόδων από παράνομες δραστηριότητες ή για τη χρηματοδότηση της τρομοκρατίας, την τροποποίηση του κανονισμού (ΕΕ) αριθμ. 648/2012 του Ευρωπαϊκού Κοινοβουλίου και του Συμβουλίου, και την κατάργηση της οδηγίας 2005/60/ΕΚ του Ευρωπαϊκού Κοινοβουλίου και του Συμβουλίου και της οδηγίας 2006/70/ΕΚ της Επιτροπής (EE L 141/05.06.2015) και τα εγκλήματα των άρθρων 2 και 39 του ν. 4557/2018 (Α 139).\par
\tab\tab (6)\tab Παιδική εργασία και άλλες μορφές εμπορίας ανθρώπων, όπως ορίζονται στο άρθρο 2 της Οδηγίας 2011/36/ ΕΕ του Ευρωπαϊκού Κοινοβουλίου και του Συμβουλίου της 5ης Απριλίου 2011, για την πρόληψη και την καταπολέμηση της εμπορίας ανθρώπων και για την προστασία των θυμάτων της, καθώς και για την αντικατάσταση της απόφασης πλαίσιο 2002/629/ΔΕΥ του Συμβουλίου (ΕΕ L 101 της 15.4.2011, σ. 1) και τα εγκλήματα του άρθρου 323Α του Ποινικού κώδικα (εμπορία ανθρώπων).\par
\tab β.\tab Η υποχρέωση αποκλεισμού οικονομικού φορέα εφαρμόζεται επίσης όταν το πρόσωπο εις βάρος του οποίου εκδόθηκε αμετάκλητη καταδικαστική απόφαση είναι μέλος του διοικητικού, διευθυντικού ή εποπτικού οργάνου του εν λόγω οικονομικού φορέα ή έχει εξουσία εκπροσώπησης, λήψης αποφάσεων ή ελέγχου σε αυτό. Η υποχρέωση του προηγούμενου εδαφίου αφορά:\par
\tab\tab (1)\tab Στις περιπτώσεις εταιρειών περιορισμένης ευθύνης (Ε.Π.Ε.), ιδιωτικών κεφαλαιουχικών εταιρειών (Ι.Κ.Ε.) και προσωπικών εταιρειών (Ο.Ε. και Ε.Ε.), τους διαχειριστές.\par
\tab\tab (2)\tab Στις περιπτώσεις ανωνύμων εταιρειών (Α.Ε.), τον διευθύνοντα σύμβουλο, τα μέλη του Διοικητικού Συμβουλίου, καθώς και τα πρόσωπα στα οποία με απόφαση του Διοικητικού Συμβουλίου έχει ανατεθεί το σύνολο της διαχείρισης και εκπροσώπησης της εταιρείας.\par
\tab\tab (3)\tab Στις περιπτώσεις των συνεταιρισμών, τα μέλη του Διοικητικού Συμβουλίου.\par
\tab\tab (4)\tab Στις υπόλοιπες περιπτώσεις νομικών προσώπων, τον κατά περίπτωση νόμιμο εκπρόσωπο.\par
\tab γ.\tab Αποδεικτικά έγγραφα του οικονομικού φορέα στον οποίο ανατίθεται η σύμβαση με τα οποία προκύπτει ότι πληρούνται οι προϋποθέσεις του άρθρου 73 και του άρθρου 74 του ν.4412/16 (υποχρεωτικοί λόγοι αποκλεισμού), σύμφωνα με το άρθρο 80 του ν.4412/16, (Κατ εξαίρεση, δύναται να προβλεφθεί στα έγγραφα της σύμβασης παρέκκλιση από τον υποχρεωτικό αποκλεισμό των οικονομικών φορέων, ο οποίος προβλέπεται στις παρ. 1 και 2 του άρθρου 73 του ν.4412/16 αποκλειστικά για τις απαριθμούμενες περιπτώσεις της παρ.3 του υπόψη άρθρου):\par
\tab\tab (1)\tab Απόσπασμα του σχετικού μητρώου, όπως του ποινικού μητρώου ή, ελλείψει αυτού, ισοδύναμο έγγραφο που εκδίδεται από αρμόδια δικαστική ή διοικητική αρχή του κράτους - μέλους ή της χώρας καταγωγής ή της χώρας όπου είναι εγκατεστημένος ο οικονομικός φορέας, για την απόδειξη μη συνδρομής του φορέα σε κάποια κατάσταση της παραγράφου 1 του άρθρου 73 του ν.4412/16. Σε συμβάσεις έως του χρηματικού ορίου της απευθείας ανάθεσης, δύναται να προσκομίζεται Υπεύθυνη Δήλωση του υπόχρεου (οικονομικού φορέα ή νόμιμου εκπροσώπου κατά περίπτωση), αντί αποσπάσματος ποινικού μητρώου.\par
\tab\tab (2)\tab Πιστοποιητικό, το οποίο εκδίδεται από την αρμόδια αρχή του οικείου κράτους - μέλους ή χώρας για την απόδειξη μη συνδρομής του φορέα σε κάποια κατάσταση της παρ. 2 του άρθρου 73 του ν.4412/16. Αν το κράτος - μέλος ή η εν λόγω χώρα δεν εκδίδει τέτοιου είδους έγγραφο ή πιστοποιητικό ή όπου αυτό δεν καλύπτει όλες τις περιπτώσεις της παρ.2 του άρθρου 73 του ν.4412/16, απαιτούνται:\par
\tab\tab\tab (α)\tab Επίσημη δήλωση αρμόδιας δημόσιας αρχής ότι δεν εκδίδεται ή ότι δεν καλύπτει όλες τις περιπτώσεις [μόνο εάν δεν καθίσταται διαθέσιμη μέσω του επιγραμμικού αποθετηρίου πιστοποιητικών (e-Certis)].\par
\tab\tab\tab (β)\tab Ένορκη βεβαίωση ή, στα κράτη - μέλη ή στις χώρες όπου δεν προβλέπεται ένορκη βεβαίωση, υπεύθυνη δήλωση του ενδιαφερομένου ενώπιον αρμόδιας δικαστικής ή διοικητικής αρχής, συμβολαιογράφου ή αρμόδιου επαγγελματικού ή εμπορικού οργανισμού του κράτους - μέλους ή της χώρας καταγωγής ή της χώρας όπου είναι εγκατεστημένος ο οικονομικός φορέας. Ειδικότερα, για τους ημεδαπούς οικονομικούς φορείς απαιτούνται πιστοποιητικά φορολογικής ενημερότητας άλλως, στην περίπτωση οφειλής, βεβαίωση οφειλής (εκδιδόμενο από την ΑΑΔΕ) και ασφαλιστικής ενημερότητας (εκδιδόμενο από τον e-ΕΦΚΑ), τα οποία αποδεικνύουν ότι έχουν εκπληρωθεί οι υποχρεώσεις του οικονομικού φορέα, όσον αφορά στην καταβολή φόρων και στην καταβολή των εισφορών κοινωνικής (κύριας και επικουρικής) ασφάλισης αντίστοιχα. Σε περίπτωση κατά την οποία ο προσωρινός ανάδοχος έχει την εγκατάστασή του στην Ελλάδα και δεν υπάγεται αποκλειστικά στον e-ΕΦΚΑ, απαιτείται επιπλέον υπεύθυνη δήλωση αναφορικά με τους Οργανισμούς κύριας και επικουρικής ασφάλισης στους οποίους οφείλει να καταβάλει εισφορές.\par
\tab\tab (3)\tab Υπεύθυνη δήλωση ότι δεν έχει εκδοθεί δικαστική ή διοικητική απόφαση με τελεσίδικη και δεσμευτική ισχύ για την αθέτηση των υποχρεώσεων του οικονομικού φορέα όσον αφορά στην καταβολή φόρων ή εισφορών κοινωνικής ασφάλισης.\par
\tab\tab (4)\tab Υπεύθυνη δήλωση (για συμβάσεις έως του χρηματικού ορίου της απευθείας ανάθεσης) ή ένορκη βεβαίωση (για συμβάσεις άνω και κάτω των ορίων), του ανά περίπτωση, νόμιμου εκπροσώπου του νομικού προσώπου/οντότητας περί μη συνδρομής αδικημάτων δωροδοκίας της παρ.1 του άρθρου 73 του ν.4412/1619.\par
\tab δ.\tab Αποδεικτικά έγγραφα για την πλήρωση των κριτηρίων ποιοτικής επιλογής του άρθρου 75 του ν.4412/1620 (καταλληλότητα για άσκηση επαγγελματικής δραστηριότητας, οικονομική και χρηματοοικονομική επάρκεια, ελάχιστα επίπεδα τεχνικής και επαγγελματικής ικανότητας), εφόσον συμπεριληφθούν στα έγγραφα της σύμβασης. Αν η σύμβαση είναι ποσού άνω των τριάντα χιλιάδων (30.000) ευρώ απαιτούνται πρόσθετα και αποδεικτικά έγγραφα για τη μη ύπαρξη δυνητικών (προαιρετικών) λόγων αποκλεισμού (π.χ. Ενιαίο Πιστοποιητικό Δικαστικής Φερεγγυότητας, Πιστοποιητικό του ΓΕΜΗ, υπεύθυνες δηλώσεις κ.λπ.22), εφόσον συμπεριληφθούν σχετικοί όροι στα έγγραφα της σύμβασης.\par
\tab ε.\tab Για τη διαπίστωση της επάρκειας ή μη των επανορθωτικών μέτρων (αυτοκάθαρσης):\par
\tab\tab (1)\tab Αποδεικτικά έγγραφα του οικονομικού φορέα.\par
\tab\tab (2)\tab Σύμφωνη γνώμη της αρμόδιας τριμελούς γνωμοδοτικής Επιτροπής της παρ.9 του άρθρου 73 του ν.4412/1623, αναλόγως του είδους της σύμβασης.\par
\tab\tab (3)\tab Απόφαση της αναθέτουσας αρχής.\par
\tab στ.\tab Αποδεικτικά έγγραφα για τη συμμόρφωση με πρότυπα διασφάλισης ποιότητας και πρότυπα περιβαλλοντικής διαχείρισης. Τα υπόψη πρότυπα είναι προαιρετικά, ήτοι τίθενται στην πρόσκληση, κατά την κρίση και τη διακριτική ευχέρεια της αναθέτουσας αρχής και πρέπει να σχετίζονται και να είναι ανάλογα με το αντικείμενο της σύμβασης.\par
\tab ζ.\tab Αποδεικτικά έγγραφα για την απόδειξη νόμιμης εκπροσώπησης του οικονομικού φορέα (π.χ. σχετικό πιστοποιητικό ισχύουσας εκπροσώπησης) στις περιπτώσεις που ο οικονομικός φορέας είναι νομικό πρόσωπο εγγράφεται υποχρεωτικά ή προαιρετικά, κατά την κείμενη νομοθεσία και δηλώνει την εκπροσώπηση και τις μεταβολές της σε αρμόδια αρχή (πχ ΓΕΜΗ25). Συναφώς και κατά περίπτωση προσκομίζονται καταστατικά, πρακτικά εκπροσώπησης, πιστοποιητικά μεταβολών, αντίστοιχα ΦΕΚ, αποφάσεις συγκρότησης οργάνων διοίκησης σε σώμα, κλπ., ανάλογα με τη νομική μορφή του οικονομικού φορέα, συνο-δευόμενα από υπεύθυνη δήλωση του νόμιμου εκπροσώπου ότι εξακολουθούν να ισχύουν κατά την υποβολή τους.\par
\tab η.\tab Αποφάσεις του Διοικητικού Εφετείου επί αιτήσεων των οικονομικών φορέων αναστολής εκτέλεσης/ακύρωσης διοικητικής πράξης της αναθέτουσας αρχής (εφόσον υφίστανται).\par
\tab θ.\tab Φορολογική και ασφαλιστική ενημερότητα, αν απαιτούνται (για οικονομικούς φορείς εσωτερικού) ή πιστοποιητικό από την αρμόδια αρχή του οικείου κράτους - μέλους ή χώρας (για οικονομικούς φορείς εξωτερικού).\par
3.\tab Κριτήρια ποιοτικής επιλογής (άρθρο 75 του ν.4412/16):\par
\tab α.\tab Καταλληλότητα για άσκηση επαγγελματικής δραστηριότητας.\par
\tab β.\tab Οικονομική και χρηματοοικονομική επάρκεια.\par
\tab γ.\tab Επαρκές επίπεδο τεχνικής και επαγγελματικής ικανότητας.\par

<?php
	appendix_footer($output);
	echo '\pard\plain\par' . PHP_EOL . PHP_EOL . '\sect' . PHP_EOL . PHP_EOL;

	// Εξαγωγή παραρτήματος
	start_35_20();
	appendix_header(ifexist2($output, $contract, 'Πρόσκληση Υποβολής Προσφορών'), 'Β', 'ΠΙΝΑΚΑΣ ΕΙΔΩΝ ΚΑΙ ΠΟΣΟΤΗΤΩΝ');
	report_list_items($per_contract['Τιμολόγια']);
	appendix_footer($output);
	echo '\pard\plain\par' . PHP_EOL . PHP_EOL . '\sect' . PHP_EOL . PHP_EOL;


// Εξαγωγή κενής υπεύθυνης δήλωσης
statement_disqualification(array(
	'Επωνυμία' => '. . . . . . . . . . . . . . . . . . . . . . . . .',
	'Διεύθυνση' => '. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .',
	'ΑΦΜ' => '. . . . . . . . . . .', 'ΔΟΥ' => '. . . . . . . . . . . . .',
	'Ονοματεπώνυμο Πατέρα' => '', 'Ονοματεπώνυμο' => '', 'Ονοματεπώνυμο Πατέρα' => '',
	'Ονοματεπώνυμο Μητέρας' => '', 'Ημερομηνία Γέννησης' => '', 'Τόπος Γέννησης' => '',
	'Αριθμός Ταυτότητας' => '', 'Διεύθυνση Κατοικίας' => '', 'Τηλέφωνο' => '',
	'Ημερομηνία Έκδοσης' => ''), $contract);
}

if (!is_expenditure() && !isset($per_contract)) trigger_error('Δεν έχουμε απευθείας ανάθεση', E_USER_ERROR);

unset($contract, $contracts, $per_contract, $count, $to);

rtf_close(__FILE__);