<?php
require_once('functions.php');
require_once('order.php');
require_once('report.php');
require_once('statement.php');

init(7);

$contracts = isset($data['Συμβάσεις'])
	? array_filter($data['Συμβάσεις'], function($per_contract) { return !isset($per_contract['Διαγωνισμός']); })
	: array();
foreach ($contracts as $per_contract) {
	start_35_20();
	order_publish(ifexist($per_contract['Σύμβαση'], 'Πρόσκληση Υποβολής Προσφορών'));
	order_header_recipients(ifexist2($output, $per_contract['Σύμβαση'], 'Πρόσκληση Υποβολής Προσφορών'), $output, 'Υπεύθυνη δήλωση',
			'Πρόσκληση Υποβολής Προσφορών για ' . rtf(ucwords($data['Τίτλος'])),
			array(
				'Ν.Δ.721/1970 «Περί Οικονομικής Μέριμνας και Λογιστικού των Ενόπλων Δυνάμεων» (Α\' 251)',
				'Ν.4270/2014 «Αρχές Δημοσιονομικής Διαχείρισης και Εποπτείας (Ενσωμάτωση της Οδηγίας 2011/85/ΕΕ) - Δημόσιο Λογιστικό και ’λλες Διατάξεις» (Α\' 143)',
				'Ν.4412/2016 «Δημόσιες Συμβάσεις Έργων, Προμηθειών και Υπηρεσιών (Α\' 147)',
				'Ν.4727/2020 «Ψηφιακή Διακυβέρνηση (Ενσωμάτωση στην Ελληνική Νομοθεσία της Οδηγίας (ΕΕ) 2016/2102 και της Οδηγίας (ΕΕ) 2019/1024) Ηλεκτρονικές Επικοινωνίες (Ενσωμάτωση στο Ελληνικό Δίκαιο της Οδηγίας (ΕΕ) 2018/1972) και ’λλες Διατάξεις» (Α\' 184)',
				$data['Απόφαση Ανάληψης Υποχρέωσης']['Ταυτότητα']
			));
?>
Έχοντας υπόψη:\par
α.\tab Τις διατάξεις των (α) έως (δ) σχετικών.\par
β.\tab Το (ε) σχετικό με το οποίο εγκρίθηκε η ανάληψη υποχρέωσης, σε βάρος πιστώσεων <?=$data['Τύπος Χρηματοδότησης']?> και Ειδικού Φορέα (ΕΦ) <?=$data['ΕΦ']?><?php
if ($data['Τύπος Χρηματοδότησης'] != 'Ιδίων Πόρων')
	echo ", οικονομικού έτους " . date('Y', orelse($data, 'Ημερομηνία Τελευταίου Τιμολογίου', time()));
?>, επί ΑΛΕ <?=$data['ΑΛΕ']?>.\par
\qc{\b ΑΠΟΦΑΣΙΖΕΤΑΙ}\par\qj
1.\tab Η δημοσίευση πρόσκλησης υποβολής προσφορών για τη σύναψη σύμβασης, για «<?=rtf($per_contract['Σύμβαση']['Τίτλος'])?>» με κριτήριο ανάθεσης την πλέον συμφέρουσα από οικονομική άποψη προσφορά, βάσει βέλτιστης σχέσης ποιότητας - τιμής.\par
2.\tab Τα απαιτούμενα είδη και ποσότητες τα οποία αφορούν τη σύμβαση, έχουν όπως στο Παράρτημα «Α».\par
3.\tab Η συνολική προϋπολογισθείσα δαπάνη της σύμβασης ανέρχεται στο καταλογιστέο ποσό (περιλαμβάνει ΦΠΑ) των <?=euro($per_contract['Τιμές']['Καταλογιστέο'])?> (<?=euro2str($per_contract['Τιμές']['Καταλογιστέο'])?>)\par
4.\tab Ο φάκελος της προσφοράς θα περιλαμβάνει τεχνική και οικονομική προσφορά και υπεύθυνη δήλωση του Ν.1599/1986 σύμφωνα με το υπόδειγμα της συνημμένης υπεύθυνης δήλωσης.\par
5.\tab Ισχύουν οι υποχρεωτικοί λόγοι αποκλεισμού των οικονομικών φορέων, σύμφωνα με το (γ) σχετικό, με τις προσθήκες του Ν4488/2017 (Α' 137). Δεν συντρέχουν λοιποί δυνητικοί λόγοι αποκλεισμού.\par
6.\tab Η δαπάνη υπόκειται στις νόμιμες κρατήσεις υπέρ Δημοσίου, οι οποίες βαρύνουν τον ανάδοχο και σε παρακράτηση φόρου εισοδήματος (ΦΕ), σύμφωνα με τα προβλεπόμενα στις διατάξεις του άρθρου 64 του Ν.4172/2013.\par
<?php
$count = 7;
if (published()) echo $count++ . '.\tab Το παρόν θα αναρτηθεί στο διαδικτυακό τόπο του «ΚΗΜΔΗΣ» από ' . rtf(article(gender($data['Μονάδα Πλήρες']), 2) . ' ' . inflectPhrase($data['Μονάδα Πλήρες'], 2)) . '.\par'; ?>
<?=$count++?>.\tab Παρακαλούμε για τις ενέργειές σας.\par
<?=$count++?>.\tab Χειριστής θέματος: <?=personi($data['Αξκος Γραφείου'], 0)?>, τηλ. <?=rtf($data['Τηλέφωνο'])?>.\par
<?php
order_footer($output);
order_recipient_table(array('-'), array($data['Μονάδα']));
order_appendices(array('Απαιτούμενα Είδη και Ποσότητες'));
?>

\sect


<?php
	// Εξαγωγή παραρτήματος 
	start_35_20();
	appendix_header(ifexist2($output, $per_contract['Σύμβαση'], 'Πρόσκληση Υποβολής Προσφορών'), 'Α', 'ΑΠΑΙΤΟΥΜΕΝΑ ΕΙΔΗ ΚΑΙ ΠΟΣΟΤΗΤΕΣ');
	report_no_prices_no_sums2($per_contract['Τιμολόγια']);
	appendix_footer($output);
	echo '\sect' . PHP_EOL . PHP_EOL;

	
// Εξαγωγή κενής υπεύθυνης δήλωσης
statement_disqualification(array(
	'Επωνυμία' => '. . . . . . . . . . . . . . . . . . . . . . . . .',
	'Διεύθυνση' => '. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .',
	'ΑΦΜ' => '. . . . . . . . . . .', 'ΔΟΥ' => '. . . . . . . . . . . . .',
	'Ονοματεπώνυμο Πατέρα' => '', 'Ονοματεπώνυμο' => '', 'Ονοματεπώνυμο Πατέρα' => '',
	'Ονοματεπώνυμο Μητέρας' => '', 'Ημερομηνία Γέννησης' => '', 'Τόπος Γέννησης' => '',
	'Αριθμός Ταυτότητας' => '', 'Διεύθυνση Κατοικίας' => '', 'Τηλέφωνο' => '',
	'Ημερομηνία Έκδοσης' => ''), $per_contract['Σύμβαση']);
}

if (!is_expenditure() && !isset($per_contract)) trigger_error('Δεν έχουμε απευθείας ανάθεση', E_USER_ERROR);

unset($contracts, $per_contract, $count);

rtf_close(__FILE__);