<?php
require_once('init.php');
require_once('header.php');

// Το ΤΕΥΔ εκτελείται, έχοντας ενεργές τις μεταβλητές της Διακήρυξης Διαγωνισμού

// Η κατηγορία της σύμβασης (Έργο, Προμήθεια, Υπηρεσία)
if ($data['Έργο']) $category = 'Κατασκευή Έργου';
else {
	// Το $per_tender είναι ορισμένο από τη Διακήρυξη του Διαγωνισμού
	foreach($per_tender['Τιμολόγια'] as $invoice) {
		$category = get_invoice_category($invoice);
		if ($category == 'Παροχή Υπηρεσιών') break;
	}
}

// Συντομεύσεις για τους ορισμούς πινάκων και κελιών
// 0: Πίνακας ενός κελιού, γκρίζου, 1: Πίνακας 2 κελιών 50%
// 2: Πίνακας 2 κελιών 50%, χωρίς κάτω περίγραμμα,
// 3: Πίνακας 2 κελιών 50%, χωρίς πάνω και κάτω περίγραμμα
// 4: Πίνακας 2 κελιών 50%, χωρίς πάνω περίγραμμα
$tbl = array(
	<<<'EOD'
\trowd\trpaddft3\trpaddt57\trpaddfb3\trpaddb57\trpaddfl3\trpaddl113\trpaddfr3\trpaddr113
\clbrdrt\brdrs\brdrw1\clbrdrl\brdrs\brdrw1\clbrdrb\brdrs\brdrw1\clbrdrr\brdrs\brdrw1\clcbpat1\cellx8788

EOD
, <<<'EOD'
\trowd\trpaddft3\trpaddt28\trpaddfb3\trpaddb28\trpaddfl3\trpaddl57\trpaddfr3\trpaddr57
\clbrdrt\brdrs\brdrw1\clbrdrl\brdrs\brdrw1\clbrdrb\brdrs\brdrw1\cellx4394
\clbrdrt\brdrs\brdrw1\clbrdrl\brdrs\brdrw1\clbrdrb\brdrs\brdrw1\clbrdrr\brdrs\brdrw1\cellx8788

EOD
, <<<'EOD'
\trowd\trpaddft3\trpaddt28\trpaddfb3\trpaddb28\trpaddfl3\trpaddl57\trpaddfr3\trpaddr57
\clbrdrt\brdrs\brdrw1\clbrdrl\brdrs\brdrw1\cellx4394
\clbrdrt\brdrs\brdrw1\clbrdrl\brdrs\brdrw1\clbrdrr\brdrs\brdrw1\cellx8788

EOD
, <<<'EOD'
\trowd\trpaddft3\trpaddt28\trpaddfb3\trpaddb28\trpaddfl3\trpaddl57\trpaddfr3\trpaddr57
\clbrdrl\brdrs\brdrw1\cellx4394
\clbrdrl\brdrs\brdrw1\clbrdrr\brdrs\brdrw1\cellx8788

EOD
, <<<'EOD'
\trowd\trpaddft3\trpaddt28\trpaddfb3\trpaddb28\trpaddfl3\trpaddl57\trpaddfr3\trpaddr57
\clbrdrb\brdrs\brdrw1\clbrdrl\brdrs\brdrw1\cellx4394
\clbrdrb\brdrs\brdrw1\clbrdrl\brdrs\brdrw1\clbrdrr\brdrs\brdrw1\cellx8788

EOD
);
// Επαναλαμβανόμενη φράση
$ny = '{\fs30\u9744_} Ναι {\fs30\u9744_} Όχι';
$years = 'Αριθμός ετών {\fs18\i (η περίοδος αυτή προσδιορίζεται στη σχετική διακήρυξη ή στην πρόσκληση ή στα έγγραφα της σύμβασης που αναφέρονται στην διακήρυξη)}:';
$ask0 = '{\fs18\i (διαδικτυακή διεύθυνση, αρχή ή φορέας έκδοσης, επακριβή στοιχεία αναφοράς των εγγράφων):}\par\u8230>';
$nestrow = <<<'EOD'
{\nesttableprops
\trowd\trpaddft3\trpaddt28\trpaddfb3\trpaddb28\trpaddfl3\trpaddl28\trpaddfr3\trpaddr28\trkeep
\clbrdrt\brdrs\brdrw1\clbrdrl\brdrs\brdrw1\clbrdrb\brdrs\brdrw1\cellx1099
\clbrdrt\brdrs\brdrw1\clbrdrl\brdrs\brdrw1\clbrdrb\brdrs\brdrw1\cellx2083
\clbrdrt\brdrs\brdrw1\clbrdrl\brdrs\brdrw1\clbrdrb\brdrs\brdrw1\cellx3181
\clbrdrt\brdrs\brdrw1\clbrdrl\brdrs\brdrw1\clbrdrb\brdrs\brdrw1\clbrdrr\brdrs\brdrw1\cellx4276
\nestrow}

EOD;
// Έναρξη υποσέλιδου. Ακολουθεί το κείμενο και κλείνει με }
$fns = '\chftn{\footnote\pard\plain\qj\fs18{\super\chftn} ';
?>

\sectd\sbkodd\pgwsxn11906\pghsxn16838\marglsxn1984\margrsxn1134\margtsxn1134\margbsxn1134\facingp\margmirror

\pard\plain\sa226\qc\b ΤΥΠΟΠΟΙΗΜΕΝΟ ΕΝΤΥΠΟ ΥΠΕΥΘΥΝΗΣ ΔΗΛΩΣΗΣ (TEΥΔ)\line
[άρθρου 79 παρ. 4 ν. 4412/2016 (Α 147)]\line
\ul για διαδικασίες σύναψης δημόσιας σύμβασης κάτω των ορίων των οδηγιών\par

\qj\fs22 Μέρος Ι: Πληροφορίες σχετικά με την αναθέτουσα αρχή/αναθέτοντα φορέα<?=$fns?>Σε περίπτωση που η αναθέτουσα αρχή/αναθέτων φορέας είναι περισσότερες (οι) της (του) μίας (ενός) θα αναφέρεται το σύνολο αυτών.} και τη διαδικασία ανάθεσης\ul0\b0\par

\sa0<?=$tbl[0]?>
Παροχή πληροφοριών δημοσίευσης σε εθνικό επίπεδο, με τις οποίες είναι δυνατή η αδιαμφισβήτητη ταυτοποίηση της διαδικασίας σύναψης δημόσιας σύμβασης:\cell\row
\pard\qj\par
<?=$tbl[0]?>
\intbl\b Α: Ονομασία, διεύθυνση και στοιχεία επικοινωνίας της αναθέτουσας αρχής (αα)/αναθέτοντα φορέα (αφ)\b0\par
\emdash  Ονομασία: {\b\i <?=rtf($data['Μονάδα Πλήρες'])?>}\par
\emdash  Κωδικός Αναθέτουσας Αρχής / Αναθέτοντα Φορέα ΚΗΜΔΗΣ : {\b\i \emdash}\par
\emdash  Ταχυδρομική διεύθυνση / Πόλη / Ταχ. Κωδικός: {\b\i <?php
if (isset($data['Διεύθυνση'])) echo rtf($data['Διεύθυνση']) .' / ';
echo rtf($data['Έδρα']);
if (isset($data['Τ.Κ.'])) echo ' / ' . rtf($data['Τ.Κ.']);
?>}\par
\emdash  Αρμόδιος για πληροφορίες: {\b\i <?=person($data['Αξκος Γραφείου'])?>}\par
\emdash  Τηλέφωνο: {\b\i <?=rtf($data['Τηλέφωνο'])?>}\par
\emdash  Ηλ. ταχυδρομείο: {\b\i \emdash}\par
\emdash  Διεύθυνση στο Διαδίκτυο (διεύθυνση δικτυακού τόπου) (εάν υπάρχει): {\b\i \emdash}\cell\row
\b Β: Πληροφορίες σχετικά με τη διαδικασία σύναψης σύμβασης\b0\par
\emdash  Τίτλος ή σύντομη περιγραφή της δημόσιας σύμβασης (συμπεριλαμβανομένου του σχετικού CPV): {\b\i <?=rtf($tender['Τίτλος'])?> (CPV: <?=rtf($tender['CPV'])?>)}\par
\emdash  Κωδικός στο ΚΗΜΔΗΣ: {\b\i \emdash}\par
\emdash  Η σύμβαση αναφέρεται σε έργα, προμήθειες, ή υπηρεσίες: {\b\i <?=$category?>}\par
\emdash  Εφόσον υφίστανται, ένδειξη ύπαρξης σχετικών τμημάτων: {\b\i \emdash}\par
\emdash  Αριθμός αναφοράς που αποδίδεται στον φάκελο από την αναθέτουσα αρχή (εάν υπάρχει): {\b\i \emdash}\cell\row
\pard\qj\par
<?=$tbl[0]?>
ΟΛΕΣ ΟΙ ΥΠΟΛΟΙΠΕΣ ΠΛΗΡΟΦΟΡΙΕΣ ΣΕ ΚΑΘΕ ΕΝΟΤΗΤΑ ΤΟΥ ΤΕΥΔ ΘΑ ΠΡΕΠΕΙ ΝΑ ΣΥΜΠΛΗΡΩΘΟΥΝ ΑΠΟ ΤΟΝ ΟΙΚΟΝΟΜΙΚΟ ΦΟΡΕΑ\cell\row

\pard\sb454\sa226\qj\b{\ul Μέρος II: Πληροφορίες σχετικά με τον οικονομικό φορέα}\par
\sb0 Α: Πληροφορίες σχετικά με τον οικονομικό φορέα\par

\sa0<?=$tbl[1]?>
Στοιχεία αναγνώρισης:\cell Απάντηση:\b0\cell\row
Πλήρης Επωνυμία:\cell\u8230>\cell\row
\intbl Αριθμός φορολογικού μητρώου (ΑΦΜ):\par
Εάν δεν υπάρχει ΑΦΜ στη χώρα εγκατάστασης του οικονομικού φορέα, αναφέρετε άλλον εθνικό αριθμό ταυτοποίησης, εφόσον απαιτείται και υπάρχει.\cell\u8230>\cell\row
Ταχυδρομική διεύθυνση:\cell\u8230>\cell\row
<?=$tbl[2]?>
Αρμόδιος ή αρμόδιοι<?=$fns?>Επαναλάβετε τα στοιχεία των αρμοδίων, όνομα και επώνυμο, όσες φορές χρειάζεται.}:\cell\u8230>\cell\row
<?=$tbl[3]?>
Τηλέφωνο:\cell\u8230>\cell\row
Ηλ. ταχυδρομείο:\cell\u8230>\cell\row
<?=$tbl[4]?>
Διεύθυνση στο Διαδίκτυο (διεύθυνση δικτυακού τόπου) (εάν υπάρχει):\cell\u8230>\cell\row
<?=$tbl[1]?>
\b Γενικές πληροφορίες:\cell Απάντηση:\b0\cell\row
Ο οικονομικός φορέας είναι πολύ μικρή, μικρή ή μεσαία επιχείρηση<?=$fns?>Βλέπε σύσταση της Επιτροπής, της 6ης Μαΐου 2003, σχετικά με τον ορισμό των πολύ μικρών, των μικρών και των μεσαίων επιχειρήσεων (ΕΕ L 124 της 20.5.2003, σ. 36). Οι πληροφορίες αυτές απαιτούνται μόνο για στατιστικούς σκοπούς.\par
{\b Πολύ μικρή επιχείρηση:} επιχείρηση η οποία απασχολεί λιγότερους από 10 εργαζομένους και της οποίας ο ετήσιος κύκλος εργασιών και/ή το σύνολο του ετήσιου ισολογισμού δεν υπερβαίνει τα 2 εκατομμύρια ευρώ.\par
{\b Μικρή επιχείρηση:} επιχείρηση η οποία απασχολεί λιγότερους από 50 εργαζομένους και της οποίας ο ετήσιος κύκλος εργασιών και/ή το σύνολο του ετήσιου ισολογισμού δεν υπερβαίνει τα 10 εκατομμύρια ευρώ.\par
{\b Μεσαίες επιχειρήσεις:} επιχειρήσεις που δεν είναι ούτε πολύ μικρές ούτε μικρές και οι οποίες απασχολούν λιγότερους από 250 εργαζομένους και των οποίων ο ετήσιος κύκλος εργασιών δεν υπερβαίνει τα 50 εκατομμύρια ευρώ και/ή το σύνολο του ετήσιου ισολογισμού δεν υπερβαίνει τα 43 εκατομμύρια ευρώ.};\cell
{\fs30\u9744_} Πολύ μικρή επιχείρηση\par{\fs30\u9744_} Μικρή επιχείρηση\par{\fs30\u9744_} Μεσαία επιχείρηση\cell\row
<?=$tbl[2]?>
{\b\ul Μόνο σε περίπτωση προμήθειας κατ' αποκλειστικότητα, του άρθρου 20:} ο οικονομικός φορέας είναι προστατευόμενο εργαστήριο, «κοινωνική επιχείρηση»<?=$fns?>Έχει δηλαδή ως κύριο σκοπό την κοινωνική και επαγγελματική ένταξη ατόμων με αναπηρία ή μειονεκτούντων ατόμων.} ή προβλέπει την εκτέλεση συμβάσεων στο πλαίσιο προγραμμάτων προστατευόμενης απασχόλησης;\cell<?=$ny?>\cell\row
<?=$tbl[3]?>
{\b Εάν ναι}, ποιο είναι το αντίστοιχο ποσοστό των εργαζομένων με αναπηρία ή μειονεκτούντων εργαζομένων;\cell\u8230>\cell\row
<?=$tbl[4]?>
Εφόσον απαιτείται, προσδιορίστε σε ποια κατηγορία ή κατηγορίες εργαζομένων με αναπηρία ή μειονεκτούντων εργαζομένων ανήκουν οι απασχολούμενοι.\cell\u8230>\cell\row
<?=$tbl[1]?>
Κατά περίπτωση, ο οικονομικός φορέας είναι εγγεγραμμένος σε επίσημο κατάλογο/Μητρώο εγκεκριμένων οικονομικών φορέων ή διαθέτει ισοδύναμο πιστοποιητικό (π.χ. βάσει εθνικού συστήματος (προ)επιλογής);\cell
<?=$ny?> {\fs30\u9744_} ’νευ αντικειμένου\cell\row
<?=$tbl[2]?>
{\b Εάν ναι:}\par
Απαντήστε στα υπόλοιπα τμήματα της παρούσας ενότητας, στην ενότητα Β και, όπου απαιτείται, στην ενότητα Γ του παρόντος μέρους, συμπληρώστε το μέρος V κατά περίπτωση, και σε κάθε περίπτωση συμπληρώστε και υπογράψτε το μέρος VI.\cell\cell\row
<?=$tbl[3]?>
α) Αναφέρετε την ονομασία του καταλόγου ή του πιστοποιητικού και τον σχετικό αριθμό εγγραφής ή πιστοποίησης, κατά περίπτωση:\cell\u8230>\cell\row
β) Εάν το πιστοποιητικό εγγραφής ή η πιστοποίηση διατίθεται ηλεκτρονικά, αναφέρετε:\cell<?=$ask0?>\cell\row
γ) Αναφέρετε τα δικαιολογητικά στα οποία βασίζεται η εγγραφή ή η πιστοποίηση και, κατά περίπτωση, την κατάταξη στον επίσημο κατάλογο<?=$fns?>Τα δικαιολογητικά και η κατάταξη, εάν υπάρχουν, αναφέρονται στην πιστοποίηση.}:\cell \u8230>\cell\row
δ) Η εγγραφή ή η πιστοποίηση καλύπτει όλα τα απαιτούμενα κριτήρια επιλογής;\cell<?=$ny?>\cell\row
\b Εάν όχι:\par
\ul Επιπροσθέτως, συμπληρώστε τις πληροφορίες που λείπουν στο μέρος IV, ενότητες Α, Β, Γ, ή Δ κατά περίπτωση\ul0 ΜΟΝΟ εφόσον αυτό απαιτείται στη σχετική διακήρυξη ή στα έγγραφα της σύμβασης:\b0\cell\cell\row
ε) Ο οικονομικός φορέας θα είναι σε θέση να προσκομίσει {\b βεβαίωση} πληρωμής εισφορών κοινωνικής ασφάλισης και φόρων ή να παράσχει πληροφορίες που θα δίνουν τη δυνατότητα στην αναθέτουσα αρχή ή στον αναθέτοντα φορέα να τη λάβει απευθείας μέσω πρόσβασης σε εθνική βάση δεδομένων σε οποιοδήποτε κράτος μέλος αυτή διατίθεται δωρεάν;\cell<?=$ny?>\cell\row
<?=$tbl[4]?>
Εάν η σχετική τεκμηρίωση διατίθεται ηλεκτρονικά, αναφέρετε:\cell<?=$ask0?>\cell\row
<?=$tbl[1]?>
\b Τρόπος συμμετοχής:\cell Απάντηση:\b0\cell\row
Ο οικονομικός φορέας συμμετέχει στη διαδικασία σύναψης δημόσιας σύμβασης από κοινού με άλλους<?=$fns?>Ειδικότερα ως μέλος ένωσης ή κοινοπραξίας ή άλλου παρόμοιου καθεστώτος.};\cell<?=$ny?>\cell\row
<?=$tbl[0]?>
{\b Εάν ναι}, μεριμνήστε για την υποβολή χωριστού εντύπου ΤΕΥΔ από τους άλλους εμπλεκόμενους οικονομικούς φορείς.\cell\row
<?=$tbl[2]?>
{\b Εάν ναι:}\cell\cell\row
<?=$tbl[3]?>
α) Αναφέρετε τον ρόλο του οικονομικού φορέα στην ένωση ή κοινοπραξία (επικεφαλής, υπεύθυνος για συγκεκριμένα καθήκοντα, ...):\cell\u8230>\cell\row
β) Προσδιορίστε τους άλλους οικονομικούς φορείς που συμμετέχουν από κοινού στη διαδικασία σύναψης δημόσιας σύμβασης:\cell\u8230>\cell\row
<?=$tbl[4]?>
γ) Κατά περίπτωση, επωνυμία της συμμετέχουσας ένωσης ή κοινοπραξίας.\cell\u8230>\cell\row
<?=$tbl[1]?>
\b Τμήματα\cell Απάντηση:\b0\cell\row
Κατά περίπτωση, αναφορά του τμήματος ή των τμημάτων για τα οποία ο οικονομικός φορέας επιθυμεί να υποβάλει προσφορά.\cell\u8230>\cell\row

\pard\sb454\sa226\qj{\b Β: Πληροφορίες σχετικά με τους νόμιμους εκπροσώπους του οικονομικού φορέα}\par

\sb0\sa0<?=$tbl[0]?>
Κατά περίπτωση, αναφέρετε το όνομα και τη διεύθυνση του προσώπου ή των προσώπων που είναι αρμόδια/εξουσιοδοτημένα να εκπροσωπούν τον οικονομικό φορέα για τους σκοπούς της παρούσας διαδικασίας ανάθεσης δημόσιας σύμβασης:\cell\row
\pard\qj\par
<?=$tbl[1]?>
\b Εκπροσώπηση, εάν υπάρχει:\cell Απάντηση:\b0\cell\row
Ονοματεπώνυμο, συνοδευόμενο από την ημερομηνία και τον τόπο γέννησης εφόσον απαιτείται:\cell\u8230>\cell\row
Θέση/Ενεργών υπό την ιδιότητα\cell\u8230>\cell\row
Ταχυδρομική διεύθυνση:\cell\u8230>\cell\row
Τηλέφωνο:\cell\u8230>\cell\row
Ηλ. ταχυδρομείο:\cell\u8230>\cell\row
Εάν χρειάζεται, δώστε λεπτομερή στοιχεία σχετικά με την εκπροσώπηση (τις μορφές της, την έκταση, τον σκοπό, ...):\cell\u8230>\cell\row

\pard\sb454\sa226\qj{\b Γ: Πληροφορίες σχετικά με τη στήριξη στις ικανότητες άλλων ΦΟΡΕΩΝ<?=$fns?>Επισημαίνεται ότι σύμφωνα με το δεύτερο εδάφιο του άρθρου 78 «Όσον αφορά τα κριτήρια που σχετίζονται με τους τίτλους σπουδών και τα επαγγελματικά προσόντα που ορίζονται στην περίπτωση στ' του Μέρους ΙΙ του Παραρτήματος ΧΙΙ του Προσαρτήματος Α' ή με την σχετική επαγγελματική εμπειρία, οι οικονομικοί φορείς, μπορούν ωστόσο να βασίζονται στις ικανότητες άλλων φορέων μόνο εάν οι τελευταίοι θα εκτελέσουν τις εργασίες ή τις υπηρεσίες για τις οποίες απαιτούνται οι συγκεκριμένες ικανότητες.»}}\par

\sb0\sa0<?=$tbl[1]?>
\b Στήριξη:\cell Απάντηση:\b0\cell\row
Ο οικονομικός φορέας στηρίζεται στις ικανότητες άλλων οικονομικών φορέων προκειμένου να ανταποκριθεί στα κριτήρια επιλογής που καθορίζονται στο μέρος IV και στα (τυχόν) κριτήρια και κανόνες που καθορίζονται στο μέρος V κατωτέρω;\cell<?=$ny?>\cell\row
<?=$tbl[0]?>
\intbl{\b Εάν ναι}, επισυνάψτε χωριστό έντυπο ΤΕΥΔ με τις πληροφορίες που απαιτούνται σύμφωνα με τις {\b ενότητες Α και Β του παρόντος μέρους και σύμφωνα με το μέρος ΙΙΙ, για κάθε ένα} από τους σχετικούς φορείς, δεόντως συμπληρωμένο και υπογεγραμμένο από τους νομίμους εκπροσώπους αυτών.\par
Επισημαίνεται ότι θα πρέπει να περιλαμβάνονται επίσης το τεχνικό προσωπικό ή οι τεχνικές υπηρεσίες, είτε ανήκουν απευθείας στην επιχείρηση του οικονομικού φορέα είτε όχι, ιδίως οι υπεύθυνοι για τον έλεγχο της ποιότητας και, όταν πρόκειται για δημόσιες συμβάσεις έργων, το τεχνικό προσωπικό ή οι τεχνικές υπηρεσίες που θα έχει στη διάθεσή του ο οικονομικός φορέας για την εκτέλεση της σύμβασης.\par
Εφόσον είναι σχετικές για την ειδική ικανότητα ή ικανότητες στις οποίες στηρίζεται ο οικονομικός φορέας, παρακαλείσθε να συμπεριλάβετε τις πληροφορίες που απαιτούνται σύμφωνα με τα μέρη IV και V για κάθε ένα από τους οικονομικούς φορείς.\cell\row

\pard\sb454\sa226\qj{\b Δ: Πληροφορίες σχετικά με υπεργολάβους στην ικανότητα των οποίων {\ul δεν στηρίζεται} ο οικονομικός φορέας}\par

\sb0\sa0<?=$tbl[0]?>
(Η παρούσα ενότητα συμπληρώνεται μόνον εφόσον οι σχετικές πληροφορίες απαιτούνται ρητώς από την αναθέτουσα αρχή ή τον αναθέτοντα φορέα)\cell\row
\pard\qj\par
<?=$tbl[1]?>
\b Υπεργολαβική ανάθεση:\cell Απάντηση:\b0\cell\row
Ο οικονομικός φορέας προτίθεται να αναθέσει οποιοδήποτε μέρος της σύμβασης σε τρίτους υπό μορφή υπεργολαβίας;\cell
<?=$ny?>\par
Εάν {\b ναι} παραθέστε κατάλογο των προτεινόμενων υπεργολάβων και το ποσοστό της σύμβασης που θα αναλάβουν:\par
\u8230>\cell\row
<?=$tbl[0]?>
Εάν η αναθέτουσα αρχή ή ο αναθέτων φορέας ζητούν ρητώς αυτές τις πληροφορίες (κατ' εφαρμογή του άρθρου 131 παρ. 5 ή εφόσον ο προσφέρων / υποψήφιος οικονομικός φορέας προτίθεται να αναθέσει σε τρίτους υπό μορφή υπεργολαβίας τμήμα της σύμβασης που υπερβαίνει το ποσοστό του 30% της συνολικής αξίας της σύμβασης σύμφωνα με το άρθρο 131 παρ. 6 και 7, επιπλέον των πληροφοριών που προβλέπονται στην παρούσα ενότητα, παρακαλείσθε να παράσχετε τις πληροφορίες που απαιτούνται σύμφωνα με τις ενότητες Α και Β του παρόντος μέρους και σύμφωνα με το μέρος ΙΙΙ για κάθε υπεργολάβο (ή κατηγορία υπεργολάβων).\cell\row

\pard\sb454\sa226\qj\b{\ul Μέρος III: Λόγοι αποκλεισμού}\par
\sb0 Λόγοι αποκλεισμού που σχετίζονται με ποινικές καταδίκες<?=$fns?>Σύμφωνα με τις διατάξεις του άρθρου 73 παρ. 3 α, {\ul εφόσον προβλέπεται στα έγγραφα της σύμβασης} είναι δυνατή η κατ' εξαίρεση παρέκκλιση από τον υποχρεωτικό αποκλεισμό για επιτακτικούς λόγους δημόσιου συμφέροντος, όπως δημόσιας υγείας ή προστασίας του περιβάλλοντος.}\b0\par

\sa0<?=$tbl[0]?>
\intbl Στο άρθρο 73 παρ. 1 ορίζονται οι ακόλουθοι λόγοι αποκλεισμού:\par
1. συμμετοχή σε {\b εγκληματική οργάνωση}<?=$fns?>Όπως ορίζεται στο άρθρο 2 της απόφασης-πλαίσιο 2008/841/ΔΕΥ του Συμβουλίου, της 24ης Οκτωβρίου 2008, για την καταπολέμηση του οργανωμένου εγκλήματος (ΕΕ L 300 της 11.11.2008, σ. 42).}.\par
2. {\b δωροδοκία}<?=$fns?>Σύμφωνα με άρθρο 73 παρ. 1 (β). Στον Κανονισμό ΕΕΕΣ (Κανονισμός ΕΕ 2016/7) αναφέρεται ως «διαφθορά».} <?=$fns?>Όπως ορίζεται στο άρθρο 3 της Σύμβασης περί της καταπολέμησης της δωροδοκίας στην οποία ενέχονται υπάλληλοι των Ευρωπαϊκών Κοινοτήτων ή των κρατών μελών της Ευρωπαϊκής Ένωσης (ΕΕ C 195 της 25.6.1997, σ. 1) και στην παράγραφο 1 του άρθρου 2 της απόφασης-πλαίσιο 2003/568/ΔΕΥ του Συμβουλίου, της 22ας Ιουλίου 2003 για την καταπολέμηση της δωροδοκίας στον ιδιωτικό τομέα (ΕΕ L 192 της 31.7.2003, σ. 54). Περιλαμβάνει επίσης τη διαφθορά όπως ορίζεται στο {\b ν. 3560/2007 (ΦΕΚ 103/Α)}, «Κύρωση και εφαρμογή της Σύμβασης ποινικού δικαίου για τη διαφθορά και του Πρόσθετου σ΄ αυτήν Πρωτοκόλλου» (αφορά σε προσθήκη καθόσον στο ν. ’ρθρο 73 παρ. 1 β αναφέρεται η κείμενη νομοθεσία).}.\par
3. {\b απάτη}<?=$fns?>Κατά την έννοια του άρθρου 1 της σύμβασης σχετικά με τη προστασία των οικονομικών συμφερόντων των Ευρωπαϊκών Κοινοτήτων (ΕΕ C 316 της 27.11.1995, σ. 48) όπως κυρώθηκε με το ν. 2803/2000 (ΦΕΚ 48/Α) «Κύρωση της Σύμβασης σχετικά με την προστασία των οικονομικών συμφερόντων των Ευρωπαϊκών Κοινοτήτων και των συναφών με αυτήν Πρωτοκόλλων».}.\par
4. {\b τρομοκρατικά εγκλήματα ή εγκλήματα συνδεόμενα με τρομοκρατικές δραστηριότητες}<?=$fns?>Όπως ορίζονται στα άρθρα 1 και 3 της απόφασης-πλαίσιο του Συμβουλίου, της 13ης Ιουνίου 2002 για την καταπολέμηση της τρομοκρατίας (ΕΕ L 164 της 22.6.2002, σ. 3). Αυτός ο λόγος αποκλεισμού περιλαμβάνει επίσης την ηθική αυτουργία ή την απόπειρα εγκλήματος, όπως αναφέρονται στο άρθρο 4 της εν λόγω απόφασης-πλαίσιο.}.\par
5. {\b νομιμοποίηση εσόδων από παράνομες δραστηριότητες ή χρηματοδότηση της τρομοκρατίας}<?=$fns?>Όπως ορίζεται στο άρθρο 1 της οδηγίας 2005/60/ΕΚ του Ευρωπαϊκού Κοινοβουλίου και του Συμβουλίου, της 26ης Οκτωβρίου 2005, σχετικά με την πρόληψη της χρησιμοποίησης του χρηματοπιστωτικού συστήματος για τη νομιμοποίηση εσόδων από παράνομες δραστηριότητες και τη χρηματοδότηση της τρομοκρατίας (ΕΕ L 309 της 25.11.2005, σ.15) που ενσωματώθηκε με το ν. 3691/2008 (ΦΕΚ 166/Α) «Πρόληψη και καταστολή της νομιμοποίησης εσόδων από εγκληματικές δραστηριότητες και της χρηματοδότησης της τρομοκρατίας και άλλες διατάξεις».}.\par
6. {\b παιδική εργασία και άλλες μορφές εμπορίας ανθρώπων}<?=$fns?>Όπως ορίζεται στο άρθρο 2 της οδηγίας 2011/36/ΕΕ του Ευρωπαϊκού Κοινοβουλίου και του Συμβουλίου, της 5ης Απριλίου 2011, για την πρόληψη και την καταπολέμηση της εμπορίας ανθρώπων και για την προστασία των θυμάτων της, καθώς και για την αντικατάσταση της απόφασης-πλαίσιο 2002/629/ΔΕΥ του Συμβουλίου (ΕΕ L 101 της 15.4.2011, σ. 1) η οποία ενσωματώθηκε στην εθνική νομοθεσία με το ν. 4198/2013 (ΦΕΚ 215/Α) «Πρόληψη και καταπολέμηση της εμπορίας ανθρώπων και προστασία των θυμάτων αυτής και άλλες διατάξεις».}.\cell\row
\pard\qj\par
<?=$tbl[1]?>
\b Λόγοι που σχετίζονται με ποινικές καταδίκες:\cell Απάντηση:\b0\cell\row
Υπάρχει αμετάκλητη καταδικαστική {\b απόφαση εις βάρος του οικονομικού φορέα} ή {\b οποιουδήποτε} προσώπου<?=$fns?>Η εν λόγω υποχρέωση αφορά ιδίως: α) στις περιπτώσεις εταιρειών περιορισμένης ευθύνης (Ε.Π.Ε) και προσωπικών εταιρειών (Ο.Ε και Ε.Ε), τους διαχειριστές, β) στις περιπτώσεις ανωνύμων εταιρειών (Α.Ε), τον Διευθύνοντα Σύμβουλο καθώς και όλα τα μέλη του Διοικητικού Συμβουλίου (βλ. τελευταίο εδάφιο της παρ. 1 του άρθρου 73).} το οποίο είναι μέλος του διοικητικού, διευθυντικού ή εποπτικού του οργάνου ή έχει εξουσία εκπροσώπησης, λήψης αποφάσεων ή ελέγχου σε αυτό για έναν από τους λόγους που παρατίθενται ανωτέρω (σημεία 1-6), ή καταδικαστική απόφαση η οποία έχει εκδοθεί πριν από πέντε έτη κατά το μέγιστο ή στην οποία έχει οριστεί απευθείας περίοδος αποκλεισμού που εξακολουθεί να ισχύει;\cell
<?=$ny?>\par
Εάν η σχετική τεκμηρίωση διατίθεται ηλεκτρονικά, αναφέρετε<?=$fns?>Επαναλάβετε όσες φορές χρειάζεται.}: <?=$ask0?>\cell\row
<?=$tbl[2]?>
{\b Εάν ναι}, αναφέρετε<?=$fns?>Επαναλάβετε όσες φορές χρειάζεται.}:\cell\cell\row
<?=$tbl[3]?>
α) Ημερομηνία της καταδικαστικής απόφασης προσδιορίζοντας ποιο από τα σημεία 1 έως 6 αφορά και τον λόγο ή τους λόγους της καταδίκης,\cell
Ημερομηνία: \u8230>\par
σημείο(-α): \u8230>\par
λόγος(-οι): \u8230>\cell\row
β) Προσδιορίστε ποιος έχει καταδικαστεί\cell\u8230>\cell\row
<?=$tbl[4]?>
{\b γ) Εάν ορίζεται απευθείας στην καταδικαστική απόφαση:}\cell
Διάρκεια της περιόδου αποκλεισμού\par\u8230>\par και σχετικό(-ά) σημείο(-α)\par\u8230>\par
Εάν η σχετική τεκμηρίωση διατίθεται ηλεκτρονικά, αναφέρετε<?=$fns?>Επαναλάβετε όσες φορές χρειάζεται.}: <?=$ask0?>\cell\row
<?=$tbl[1]?>
Σε περίπτωση καταδικαστικής απόφασης, ο οικονομικός φορέας έχει λάβει μέτρα που να αποδεικνύουν την αξιοπιστία του παρά την ύπαρξη σχετικού λόγου αποκλεισμού («αυτοκάθαρση»)<?=$fns?>Οικονομικός φορέας που έχει αποκλειστεί με τελεσίδικη απόφαση από τη συμμετοχή σε διαδικασία σύναψης σύμβασης ή ανάθεσης παραχώρησης δε μπορεί να κάνει χρήση αυτής της δυνατότητας κατά την περίοδο αποκλεισμού που ορίζεται στην εν λόγω απόφαση (άρθρο 73 παρ. 7 τελευταίο εδάφιο).};\cell<?=$ny?>\cell\row
{\b Εάν ναι}, περιγράψτε τα μέτρα που λήφθηκαν<?=$fns?>Λαμβανομένου υπόψη του χαρακτήρα των εγκλημάτων που έχουν διαπραχθεί (μεμονωμένα, κατ' εξακολούθηση, συστηματικά ...), η επεξήγηση πρέπει να καταδεικνύει την επάρκεια των μέτρων που λήφθηκαν.}\cell\u8230>\cell\row

\pard\sb454\sa226\qj{\b Β: Λόγοι που σχετίζονται με την καταβολή φόρων ή εισφορών κοινωνικής ασφάλισης}\par

\sb0\sa0<?=$tbl[1]?>
\b Πληρωμή φόρων ή εισφορών κοινωνικής ασφάλισης:\cell Απάντηση:\b0\cell\row
1) Ο οικονομικός φορέας έχει εκπληρώσει όλες {\b τις υποχρεώσεις του όσον αφορά την πληρωμή φόρων ή εισφορών κοινωνικής ασφάλισης}<?=$fns?>Στην περίπτωση που ο οικονομικός φορέας είναι Έλληνας πολίτης ή έχει την εγκατάστασή του στην Ελλάδα, οι υποχρεώσεις του που αφορούν τις εισφορές κοινωνικής ασφάλισης καλύπτουν τόσο την κύρια όσο και την επικουρική ασφάλιση (άρθρο 73 παρ. 2 δεύτερο εδάφιο).}, στην Ελλάδα και στη χώρα στην οποία είναι τυχόν εγκατεστημένος;\cell<?=$ny?>\cell\row
\trowd\trpaddft3\trpaddt28\trpaddfb3\trpaddb28\trpaddfl3\trpaddl57\trpaddfr3\trpaddr57\trkeep
\clbrdrl\brdrs\brdrw1\cellx4394
\clbrdrt\brdrs\brdrw1\clbrdrl\brdrs\brdrw1\clbrdrb\brdrs\brdrw1\cellx6591
\clbrdrt\brdrs\brdrw1\clbrdrl\brdrs\brdrw1\clbrdrb\brdrs\brdrw1\clbrdrr\brdrs\brdrw1\cellx8788
Εάν όχι αναφέρετε:\cell\b ΦΟΡΟΙ\cell ΕΙΣΦΟΡΕΣ ΚΟΙΝΩΝΙΚΗΣ ΑΣΦΑΛΙΣΗΣ\b0\cell\row
\trowd\trpaddft3\trpaddt28\trpaddfb3\trpaddb28\trpaddfl3\trpaddl57\trpaddfr3\trpaddr57\trkeep
\clbrdrl\brdrs\brdrw1\cellx4394
\clbrdrl\brdrs\brdrw1\cellx6591
\clbrdrl\brdrs\brdrw1\clbrdrr\brdrs\brdrw1\cellx8788
α) Χώρα ή κράτος μέλος για το οποίο πρόκειται:\cell\u8230>\cell\u8230>\cell\row
β) Ποιο είναι το σχετικό ποσό;\cell\u8230>\cell\u8230>\cell\row
γ) Πως διαπιστώθηκε η αθέτηση των υποχρεώσεων;\cell\cell\cell\row
1) Μέσω δικαστικής ή διοικητικής απόφασης;\cell<?=$ny?>\cell<?=$ny?>\cell\row
- Η εν λόγω απόφαση είναι τελεσίδικη και δεσμευτική;\cell<?=$ny?>\cell<?=$ny?>\cell\row
- Αναφέρατε την ημερομηνία καταδίκης ή έκδοσης απόφασης\cell\u8230>\cell\u8230>\cell\row
- Σε περίπτωση καταδικαστικής απόφασης, εφόσον ορίζεται απευθείας σε αυτήν, τη διάρκεια της περιόδου αποκλεισμού:\cell\u8230>\cell\u8230>\cell\row
2) Με άλλα μέσα; Διευκρινήστε:\cell\u8230>\cell\u8230>\cell\row
δ) Ο οικονομικός φορέας έχει εκπληρώσει τις υποχρεώσεις του είτε καταβάλλοντας τους φόρους ή τις εισφορές κοινωνικής ασφάλισης που οφείλει συμπεριλαμβανόμενων κατά περίπτωση, των δεδουλευμένων τόκων ή των προστίμων, είτε υπαγόμενος σε δεσμευτικό διακανονισμό για την καταβολή τους<?=$fns?>Σημειώνεται ότι, σύμφωνα με το άρθρο 73 παρ. 3 περ. α και β, {\ul εφόσον προβλέπεται στα έγγραφα της σύμβασης} είναι δυνατή η παρέκκλιση από τον υποχρεωτικό αποκλεισμό λόγω αθέτησης υποχρεώσεων καταβολής φόρων ή ασφαλιστικών εισφορών κατ' εξαίρεση, για επιτακτικούς λόγους δημόσιου συμφέροντος, όπως δημόσιας υγείας ή προστασίας του περιβάλλοντος ή/και όταν ο αποκλεισμός θα ήταν σαφώς δυσανάλογος, ιδίως όταν μόνο μικρά ποσά των φόρων ή των εισφορών κοινωνικής ασφάλισης δεν έχουν καταβληθεί, ή όταν ο οικονομικός φορέας ενημερώθηκε σχετικά με το ακριβές ποσό που οφείλεται λόγω αθέτησης των υποχρεώσεών του όσον αφορά στην καταβολή φόρων ή εισφορών κοινωνικής ασφάλισης σε χρόνο κατά τον οποίο δεν είχε τη δυνατότητα να λάβει μέτρα, σύμφωνα με το τελευταίο εδάφιο της παραγράφου 2 του άρθρου 73, πριν από την εκπνοή της προθεσμίας αίτησης συμμετοχής ή σε ανοικτές διαδικασίες της προθεσμίας υποβολής προσφοράς.};\cell<?=$ny?>\par Εάν ναι, να αναφερθούν λεπτομερείς πληροφορίες\par\u8230>\cell<?=$ny?>\par Εάν ναι, να αναφερθούν λεπτομερείς πληροφορίες\par\u8230>\cell\row
<?=$tbl[1]?>
Εάν η σχετική τεκμηρίωση όσον αφορά την καταβολή των φόρων ή εισφορών κοινωνικής ασφάλισης διατίθεται ηλεκτρονικά, αναφέρετε<?=$fns?>Επαναλάβετε όσες φορές χρειάζεται.}:\cell
<?=$ask0?>\cell\row

\pard\sb454\sa226\qj{\b Γ: Λόγοι που σχετίζονται με αφερεγγυότητα, σύγκρουση συμφερόντων ή επαγγελματικό παράπτωμα}\par

\sb0\sa0<?=$tbl[1]?>
\b Πληροφορίες σχετικά με πιθανή αφερεγγυότητα, σύγκρουση συμφερόντων ή επαγγελματικό παράπτωμα\cell Απάντηση:\b0\cell\row
Ο οικονομικός φορέας έχει, {\b εν γνώσει του}, αθετήσει {\b τις υποχρεώσεις του} στους τομείς του {\b περιβαλλοντικού, κοινωνικού και εργατικού δικαίου}<?=$fns?>Όπως αναφέρονται για τους σκοπούς της παρούσας διαδικασίας σύναψης δημόσιας σύμβασης στις κείμενες διατάξεις, στα έγγραφα της σύμβασης ή στο άρθρο 18 παρ. 2.};\cell
<?=$ny?>\par
{\b Εάν ναι}, ο οικονομικός φορέας έχει λάβει μέτρα που να αποδεικνύουν την αξιοπιστία του παρά την ύπαρξη αυτού του λόγου αποκλεισμού («αυτοκάθαρση»);\par
<?=$ny?>\par
Εάν το έχει πράξει, περιγράψτε τα μέτρα που λήφθηκαν:\par\u8230>\cell\row
<?=$tbl[2]?>
\intbl Βρίσκεται ο οικονομικός φορέας σε οποιαδήποτε από τις ακόλουθες καταστάσεις<?=$fns?>Η απόδοση όρων είναι σύμφωνη με την παρ. 4 του άρθρου 73 που διαφοροποιείται από τον Κανονισμό ΕΕΕΣ (Κανονισμός ΕΕ 2016/7).}:\par
α) πτώχευση, ή\par
β) διαδικασία εξυγίανσης, ή\par
γ) ειδική εκκαθάριση, ή\par
δ) αναγκαστική διαχείριση από εκκαθαριστή ή από το δικαστήριο, ή\par
ε) έχει υπαχθεί σε διαδικασία πτωχευτικού συμβιβασμού, ή\par
στ) αναστολή επιχειρηματικών δραστηριοτήτων, ή\par
ζ) σε οποιαδήποτε ανάλογη κατάσταση προκύπτουσα από παρόμοια διαδικασία προβλεπόμενη σε εθνικές διατάξεις νόμου\par
Εάν ναι:\cell<?=$ny?>\cell\row
<?=$tbl[3]?>
- Παραθέστε λεπτομερή στοιχεία:\cell\u8230>\cell\row
- Διευκρινίστε τους λόγους για τους οποίους ωστόσο ο οικονομικός φορέας, θα δύναται να εκτελέσει τη σύμβαση, λαμβανόμενης υπόψη της εφαρμοστέας εθνικής νομοθεσίας και των μέτρων σχετικά με τη συνέχε συνέχιση της επιχειρηματικής του λειτουργίας υπό αυτές αυτές τις περιστάσεις<?=$fns?>’ρθρο 73 παρ. 5.}\cell\u8230>\cell\row
<?=$tbl[4]?>
Εάν η σχετική τεκμηρίωση διατίθεται ηλεκτρονικά, αναφέρετε:\cell<?=$ask0?>\cell\row
<?=$tbl[2]?>
Έχει διαπράξει ο οικονομικός φορέας {\b σοβαρό επαγγελματικό παράπτωμα}<?=$fns?>Εφόσον στα έγγραφα της σύμβασης γίνεται αναφορά σε συγκεκριμένη διάταξη, να συμπληρωθεί ανάλογα το ΤΕΥΔ πχ άρθρο 68 παρ. 2 ν. 3863/2010.};\cell<?=$ny?>\cell\row
<?=$tbl[3]?>
{\b Εάν ναι}, να αναφερθούν λεπτομερείς πληροφορίες:\cell\u8230>\cell\row
<?=$tbl[4]?>
\cell{\b Εάν ναι}, έχει λάβει ο οικονομικός φορέας μέτρα αυτοκάθαρσης;\par<?=$ny?>\par
{\b Εάν το έχει πράξει}, περιγράψτε τα μέτρα που λήφθηκαν:\par\u8230>\cell\row
<?=$tbl[2]?>
Έχει συνάψει ο οικονομικός φορέας {\b συμφωνίες} με άλλους οικονομικούς φορείς {\b με σκοπό τη στρέβλωση του ανταγωνισμού};\cell<?=$ny?>\cell\row
<?=$tbl[3]?>
{\b Εάν ναι}, να αναφερθούν λεπτομερείς πληροφορίες:\cell\u8230>\cell\row
<?=$tbl[4]?>
\cell{\b Εάν ναι}, έχει λάβει ο οικονομικός φορέας μέτρα αυτοκάθαρσης;\par<?=$ny?>\par
{\b Εάν το έχει πράξει}, περιγράψτε τα μέτρα που λήφθηκαν:\par\u8230>\cell\row
<?=$tbl[2]?>
Γνωρίζει ο οικονομικός φορέας την ύπαρξη τυχόν {\b σύγκρουσης συμφερόντων}<?=$fns?>Όπως προσδιορίζεται στο άρθρο 24 ή στα έγγραφα της σύμβασης.}, λόγω της συμμετοχής του στη διαδικασία ανάθεσης της σύμβασης;\cell<?=$ny?>\cell\row
<?=$tbl[4]?>
{\b Εάν ναι}, να αναφερθούν λεπτομερείς πληροφορίες:\cell\u8230>\cell\row
<?=$tbl[2]?>
Έχει παράσχει ο οικονομικός φορέας ή επιχείρηση συνδεδεμένη με αυτόν {\b συμβουλές} στην αναθέτουσα αρχή ή στον αναθέτοντα φορέα ή έχει με άλλο τρόπο {\b αναμειχθεί στην προετοιμασία} της διαδικασίας σύναψης της σύμβασης<?=$fns?>Πρβλ άρθρο 48.};\cell<?=$ny?>\cell\row
<?=$tbl[4]?>
{\b Εάν ναι}, να αναφερθούν λεπτομερείς πληροφορίες:\cell\u8230>\cell\row
<?=$tbl[2]?>
Έχει επιδείξει ο οικονομικός φορέας σοβαρή ή επαναλαμβανόμενη πλημμέλεια<?=$fns?>Η απόδοση όρων είναι σύμφωνη με την περιπτ. στ παρ. 4 του άρθρου 73 που διαφοροποιείται από τον Κανονισμό ΕΕΕΣ (Κανονισμός ΕΕ 2016/7)} κατά την εκτέλεση ουσιώδους απαίτησης στο πλαίσιο προηγούμενης δημόσιας σύμβασης, προηγούμενης σύμβασης με αναθέτοντα φορέα ή προηγούμενης σύμβασης παραχώρησης που είχε ως αποτέλεσμα την πρόωρη καταγγελία της προηγούμενης σύμβασης, αποζημιώσεις ή άλλες παρόμοιες κυρώσεις;\cell<?=$ny?>\cell\row
<?=$tbl[3]?>
{\b Εάν ναι}, να αναφερθούν λεπτομερείς πληροφορίες:\cell\u8230>\cell\row
<?=$tbl[4]?>
\cell{\b Εάν ναι}, έχει λάβει ο οικονομικός φορέας μέτρα αυτοκάθαρσης;\par<?=$ny?>\par
{\b Εάν το έχει πράξει}, περιγράψτε τα μέτρα που λήφθηκαν:\par\u8230>\cell\row
<?=$tbl[1]?>
Μπορεί ο οικονομικός φορέας να επιβεβαιώσει ότι:\par
α) δεν έχει κριθεί ένοχος σοβαρών ψευδών δηλώσεων κατά την παροχή των πληροφοριών που απαιτούνται για την εξακρίβωση της απουσίας των λόγων αποκλεισμού ή την πλήρωση των κριτηρίων επιλογής,\par
β) δεν έχει αποκρύψει τις πληροφορίες αυτές,\par
γ) ήταν σε θέση να υποβάλλει χωρίς καθυστέρηση τα δικαιολογητικά που απαιτούνται από την αναθέτουσα αρχή/αναθέτοντα φορέα,\par
δ) δεν έχει επιχειρήσει να επηρεάσει με αθέμιτο τρόπο τη διαδικασία λήψης αποφάσεων της αναθέτουσας αρχής ή του αναθέτοντα φορέα, να αποκτήσει εμπιστευτικές πληροφορίες που ενδέχεται να του αποφέρουν αθέμιτο πλεονέκτημα στη διαδικασία ανάθεσης ή να παράσχει εξ αμελείας παραπλανητικές πληροφορίες που ενδέχεται να επηρεάσουν ουσιωδώς τις αποφάσεις που αφορούν τον αποκλεισμό, την επιλογή ή την ανάθεση;\cell<?=$ny?>\cell\row

\pard\sb454\sa226\qj{\b Δ. ’λλοι λόγοι αποκλεισμού}\par

\sb0\sa0<?=$tbl[1]?>
\b Ονομαστικοποίηση μετοχών εταιρειών που συνάπτουν δημόσιες συμβάσεις ’ρθρο 8 παρ. 4 ν. 3310/2005<?=$fns?>Για συμβάσεις έργου, η εκτιμώμενη αξία της οποίας υπερβαίνει το ένα εκατομμύριο (1.000.000) ευρώ εκτός ΦΠΑ (άρθρο 79 παρ. 2). Πρβλ και άρθρο 375 παρ. 10.}:\cell Απάντηση:\b0\cell\row
Συντρέχουν οι προϋποθέσεις εφαρμογής της παρ. 4 του άρθρου 8 του ν. 3310/2005;\cell
<?=$ny?>\par
<?=$ask0?>\par
{\b Εάν ναι}, έχει λάβει ο οικονομικός φορέας μέτρα αυτοκάθαρσης;\par
<?=$ny?>\par
{\b Εάν το έχει πράξει}, περιγράψτε τα μέτρα που λήφθηκαν:\par\u8230>\cell\row

\pard\sb454\sa226\qj{\b\ul Μέρος IV: Κριτήρια επιλογής}\par
\sb0\sa0 Όσον αφορά τα κριτήρια επιλογής (ενότητα α ή ενότητες Α έως Δ του παρόντος μέρους), ο οικονομικός φορέας δηλώνει ότι:\par
\sb454\sa226{\b α: Γενική ένδειξη για όλα τα κριτήρια επιλογής}\par

\sb0\sa0<?=$tbl[0]?>
Ο οικονομικός φορέας πρέπει να συμπληρώσει αυτό το πεδίο {\ul μόνο} στην περίπτωση που η αναθέτουσα αρχή ή ο αναθέτων φορέας έχει δηλώσει στη σχετική διακήρυξη ή στην πρόσκληση ή στα έγγραφα της σύμβασης που αναφέρονται στην διακήρυξη, ότι ο οικονομικός φορέας μπορεί να συμπληρώσει μόνο την Ενότητα α του Μέρους ΙV χωρίς να υποχρεούται να συμπληρώσει οποιαδήποτε άλλη ενότητα του Μέρους ΙV:\cell\row
\pard\qj\par
<?=$tbl[1]?>
\b Εκπλήρωση όλων των απαιτούμενων κριτηρίων επιλογής\cell Απάντηση:\b0\cell\row
Πληροί όλα τα απαιτούμενα κριτήρια επιλογής;\cell<?=$ny?>\cell\row

\pard\sb454\sa226\qj{\b Α: Καταλληλότητα}\par

\sb0\sa0<?=$tbl[0]?>
Ο οικονομικός φορέας πρέπει να παράσχει πληροφορίες μόνον όταν τα σχετικά κριτήρια επιλογής έχουν προσδιοριστεί από την αναθέτουσα αρχή ή τον αναθέτοντα φορέα στη σχετική διακήρυξη ή στην πρόσκληση ή στα έγγραφα της σύμβασης που αναφέρονται στην διακήρυξη.\cell\row
\pard\qj\par
<?=$tbl[1]?>
\b Καταλληλότητα\cell Απάντηση:\b0\cell\row
<?=$tbl[2]?>
{\b 1) Ο οικονομικός φορέας είναι εγγεγραμμένος στα σχετικά επαγγελματικά ή εμπορικά μητρώα} που τηρούνται στην Ελλάδα ή στο κράτος μέλος εγκατάστασής<?=$fns?>Όπως περιγράφεται στο Παράρτημα XI του Προσαρτήματος Α, {\b οι οικονομικοί φορείς από ορισμένα κράτη μέλη οφείλουν να συμμορφώνονται με άλλες απαιτήσεις που καθορίζονται στο Παράρτημα αυτό.}} του:\cell\u8230>\cell\row
<?=$tbl[4]?>
Εάν η σχετική τεκμηρίωση διατίθεται ηλεκτρονικά, αναφέρετε:\cell
<?=$ask0?>\cell\row
<?=$tbl[2]?>
{\b 2) Για συμβάσεις υπηρεσιών:}\cell\cell\row
<?=$tbl[3]?>
Χρειάζεται ειδική {\b έγκριση ή να είναι ο οικονομικός φορέας μέλος} συγκεκριμένου οργανισμού για να έχει τη δυνατότητα να παράσχει τις σχετικές υπηρεσίες στη χώρα εγκατάστασής του\cell
<?=$ny?>\par
Εάν ναι, διευκρινίστε για ποια πρόκειται και δηλώστε αν τη διαθέτει ο οικονομικός φορέας:\par
<?=$ny?>\cell\row
<?=$tbl[4]?>
Εάν η σχετική τεκμηρίωση διατίθεται ηλεκτρονικά, αναφέρετε:\cell
<?=$ask0?>\cell\row

\pard\sb454\sa226\qj{\b Β: Οικονομική και χρηματοοικονομική επάρκεια}\par

\sb0\sa0<?=$tbl[0]?>
Ο οικονομικός φορέας πρέπει να παράσχει πληροφορίες {\ul μόνον} όταν τα σχετικά κριτήρια επιλογής έχουν προσδιοριστεί από την αναθέτουσα αρχή ή τον αναθέτοντα φορέα στη σχετική διακήρυξη ή στην πρόσκληση ή στα έγγραφα της σύμβασης που αναφέρονται στην διακήρυξη.\cell\row
\pard\qj\par
<?=$tbl[1]?>
\b Οικονομική και χρηματοοικονομική επάρκεια\cell Απάντηση:\b0\cell\row
<?=$tbl[2]?>
\intbl 1α) Ο («γενικός») {\b ετήσιος κύκλος εργασιών} του οικονομικού φορέα για τον αριθμό οικονομικών ετών που απαιτούνται στη σχετική διακήρυξη ή στην πρόσκληση ή στα έγγραφα της σύμβασης:\par{\b και/ή,}\cell
έτος: \u8230> κύκλος εργασιών: \u8230> \u8230> νόμισμα\par
έτος: \u8230> κύκλος εργασιών: \u8230> \u8230> νόμισμα\par
έτος: \u8230> κύκλος εργασιών: \u8230> \u8230> νόμισμα\cell\row
<?=$tbl[3]?>
1β) Ο {\b μέσος} ετήσιος {\b κύκλος εργασιών του οικονομικού φορέα για τον αριθμό ετών που απαιτούνται στη σχετική διακήρυξη ή στην πρόσκληση ή στα έγγραφα της σύμβασης είναι ο εξής<?=$fns?>Μόνον εφόσον επιτρέπεται {\b στη σχετική διακήρυξη ή στην πρόσκληση ή στα έγγραφα της σύμβασης που αναφέρονται στην διακήρυξη.}}}:\cell
{\fs18\i (αριθμός ετών, μέσος κύκλος έργασιών):}\par
\u8230> , \u8230> \u8230> νόμισμα\cell\row
<?=$tbl[4]?>
Εάν η σχετική τεκμηρίωση διατίθεται ηλεκτρονικά, αναφέρετε:\cell
<?=$ask0?>\cell\row
<?=$tbl[2]?>
2α) Ο ετήσιος («ειδικός») {\b κύκλος εργασιών του οικονομικού φορέα στον επιχειρηματικό τομέα που καλύπτεται από τη σύμβαση} και προσδιορίζεται στη σχετική διακήρυξη ή στην πρόσκληση ή στα έγγραφα της σύμβασης για τον αριθμό οικονομικών ετών που απαιτούνται είναι ο εξής:\par{\b και/ή,}\cell
έτος: \u8230> κύκλος εργασιών: \u8230> \u8230> νόμισμα\par
έτος: \u8230> κύκλος εργασιών: \u8230> \u8230> νόμισμα\par
έτος: \u8230> κύκλος εργασιών: \u8230> \u8230> νόμισμα\cell\row
<?=$tbl[3]?>
2β) Ο {\b μέσος} ετήσιος {\b κύκλος εργασιών του οικονομικού φορέα στον τομέα και για τον αριθμό ετών που απαιτούνται στη σχετική διακήρυξη ή στην πρόσκληση ή στα έγγραφα της σύμβασης είναι ο εξής<?=$fns?>Μόνον εφόσον επιτρέπεται στη σχετική διακήρυξη ή στην πρόσκληση ή στα έγγραφα της σύμβασης που αναφέρονται στην διακήρυξη.}}:\cell
{\fs18\i (αριθμός ετών, μέσος κύκλος έργασιών):}\par
\u8230> , \u8230> \u8230> νόμισμα\cell\row
<?=$tbl[4]?>
Εάν η σχετική τεκμηρίωση διατίθεται ηλεκτρονικά, αναφέρετε:\cell
<?=$ask0?>\cell\row
<?=$tbl[1]?>
3) Σε περίπτωση που οι πληροφορίες σχετικά με τον κύκλο εργασιών (γενικό ή ειδικό) δεν είναι διαθέσιμες για ολόκληρη την απαιτούμενη περίοδο, αναφέρετε την ημερομηνία που ιδρύθηκε ή άρχισε τις δραστηριότητές του ο οικονομικός φορέας:\cell\u8230>\cell\row
<?=$tbl[2]?>
4) Όσον αφορά τις χρηματοοικονομικές αναλογίες<?=$fns?>Π.χ αναλογία μεταξύ περιουσιακών στοιχείων και υποχρεώσεων.} που ορίζονται στη σχετική διακήρυξη ή στην πρόσκληση ή στα έγγραφα της σύμβασης, ο οικονομικός φορέας δηλώνει ότι οι πραγματικές τιμές των απαιτούμενων αναλογιών έχουν ως εξής:\cell
{\fs18\i (προσδιορισμός της απαιτούμενης αναλογίας - αναλογία μεταξύ x και y - και η αντίστοιχη αξία)}\par\u8230>\cell\row
<?=$tbl[4]?>
Εάν η σχετική τεκμηρίωση διατίθεται ηλεκτρονικά, αναφέρετε:\cell
<?=$ask0?>\cell\row
<?=$tbl[2]?>
5) Το ασφαλισμένο ποσό στην {\b ασφαλιστική κάλυψη επαγγελματικών κινδύνων} του οικονομικού φορέα είναι το εξής:\cell\u8230> \u8230> νόμισμα\cell\row
<?=$tbl[4]?>
Εάν οι εν λόγω πληροφορίες διατίθενται ηλεκτρονικά, αναφέρετε:\cell
<?=$ask0?>\cell\row
<?=$tbl[2]?>
6) Όσον αφορά τις {\b λοιπές οικονομικές ή χρηματοοικονομικές απαιτήσεις}, οι οποίες (ενδέχεται να) έχουν προσδιοριστεί στη σχετική διακήρυξη ή στην πρόσκληση ή στα έγγραφα της σύμβασης, ο οικονομικός φορέας δηλώνει ότι:\cell\u8230>\cell\row
<?=$tbl[4]?>
Εάν η σχετική τεκμηρίωση που {\b ενδέχεται} να έχει προσδιοριστεί στη σχετική προκήρυξη ή στα έγγραφα της σύμβασης διατίθεται ηλεκτρονικά, αναφέρετε:\cell
<?=$ask0?>\cell\row

\pard\sb454\sa226\qj{\b Γ: Τεχνική και επαγγελματική ικανότητα}\par

\sb0\sa0<?=$tbl[0]?>
Ο οικονομικός φορέας πρέπει να παράσχει πληροφορίες {\ul μόνον} όταν τα σχετικά κριτήρια επιλογής έχουν οριστεί από την αναθέτουσα αρχή ή τον αναθέτοντα φορέα στη σχετική διακήρυξη ή στην πρόσκληση ή στα έγγραφα της σύμβασης που αναφέρονται στη διακήρυξη.\cell\row
<?=$tbl[1]?>
\b Τεχνική και επαγγελματική ικανότητα\cell Απάντηση:\b0\cell\row
<?=$tbl[2]?>
\intbl 1α) Μόνο για τις {\b δημόσιες συμβάσεις έργων}:\par
Κατά τη διάρκεια της περιόδου αναφοράς<?=$fns?>Οι αναθέτουσες αρχές μπορούν να {\b ζητούν} έως πέντε έτη και να {\b επιτρέπουν} την τεκμηρίωση εμπειρίας που {\b υπερβαίνει} τα πέντε έτη.}, ο οικονομικός φορέας {\b έχει εκτελέσει τα ακόλουθα έργα του είδους που έχει προσδιοριστεί:}\cell
<?=$years?>\par\u8230>\par Έργα: \u8230>\cell\row
<?=$tbl[4]?>
Εάν η σχετική τεκμηρίωση όσον αφορά την καλή εκτέλεση και ολοκλήρωση των σημαντικότερων εργασιών διατίθεται ηλεκτρονικά, αναφέρετε:\cell<?=$ask0?>\cell\row
<?=$tbl[1]?>
\intbl 1β) Μόνο για {\b δημόσιες συμβάσεις προμηθειών και δημόσιες συμβάσεις υπηρεσιών:}\par
Κατά τη διάρκεια της περιόδου αναφοράς<?=$fns?>Οι αναθέτουσες αρχές μπορούν να {\b ζητούν} έως τρία έτη και να {\b επιτρέπουν} την τεκμηρίωση εμπειρίας που {\b υπερβαίνει} τα τρία έτη.}, ο οικονομικός φορέας έχει {\b προβεί στις ακόλουθες κυριότερες παραδόσεις αγαθών του είδους που έχει προσδιοριστεί ή έχει παράσχει τις ακόλουθες κυριότερες υπηρεσίες του είδους που έχει προσδιοριστεί:}\par
Κατά τη σύνταξη του σχετικού καταλόγου αναφέρετε τα ποσά, τις ημερομηνίες και τους παραλήπτες δημόσιους ή ιδιωτικούς<?=$fns?>Πρέπει να απαριθμούνται {\b όλοι} οι παραλήπτες και ο κατάλογος πρέπει να περιλαμβάνει τόσο δημόσιους όσο και ιδιωτικούς πελάτες για τα σχετικά αγαθά ή υπηρεσίες.}:\cell
\intbl <?=$years?>\par\u8230>\par
\itap2\qc\fs16\b Περιγραφή\nestcell Ποσά\nestcell Ημερομηνίες\nestcell Παραλήπτες\b0\nestcell
<?=$nestrow?>
\itap2\nestcell\nestcell\nestcell\nestcell
<?=$nestrow?>
\pard\plain\cell\row
<?=$tbl[2]?>
2) Ο οικονομικός φορέας μπορεί να χρησιμοποιήσει το ακόλουθο {\b τεχνικό προσωπικό ή τις ακόλουθες τεχνικές υπηρεσίες}<?=$fns?>Όσον αφορά το τεχνικό προσωπικό ή τις τεχνικές υπηρεσίες που δεν ανήκουν άμεσα στην επιχείρηση του οικονομικού φορέα, αλλά στων οποίων τις ικανότητες στηρίζεται ο οικονομικός φορέας, όπως καθορίζεται στο μέρος II, ενότητα Γ, πρέπει να συμπληρώνονται χωριστά έντυπα ΤΕΥΔ.}, ιδίως τους υπεύθυνους για τον έλεγχο της ποιότητας:\cell\u8230>\cell\row
<?=$tbl[4]?>
Στην περίπτωση δημόσιων συμβάσεων έργων, ο οικονομικός φορέας θα μπορεί να χρησιμοποιήσει το ακόλουθο τεχνικό προσωπικό ή τις ακόλουθες τεχνικές υπηρεσίες για την εκτέλεση του έργου:\cell\u8230>\cell\row
<?=$tbl[1]?>
3) Ο οικονομικός φορέας χρησιμοποιεί τον ακόλουθο {\b τεχνικό εξοπλισμό και λαμβάνει τα ακόλουθα μέτρα για την διασφάλιση της ποιότητας} και τα {\b μέσα μελέτης και έρευνας} που διαθέτει είναι τα ακόλουθα:\cell\u8230>\cell\row
4) Ο οικονομικός φορέας θα μπορεί να εφαρμόσει τα ακόλουθα συστήματα {\b διαχείρισης της αλυσίδας εφοδιασμού} και ανίχνευσης κατά την εκτέλεση της σύμβασης:\cell\u8230>\cell\row
<?=$tbl[2]?>
\b 5) Για σύνθετα προϊόντα ή υπηρεσίες που θα παρασχεθούν ή, κατ' εξαίρεση, για προϊόντα ή υπηρεσίες που πρέπει να ανταποκρίνονται σε κάποιον ιδιαίτερο σκοπό:\b0\cell\cell\row
<?=$tbl[4]?>
Ο οικονομικός φορέας {\b θα} επιτρέπει τη διενέργεια {\b ελέγχων}<?=$fns?>Ο έλεγχος πρόκειται να διενεργείται από την αναθέτουσα αρχή ή, εφόσον αυτή συναινέσει, εξ ονόματός της από αρμόδιο επίσημο οργανισμό της χώρας όπου είναι εγκατεστημένος ο προμηθευτής ή ο πάροχος υπηρεσιών.} όσον αφορά το {\b παραγωγικό δυναμικό} ή τις {\b τεχνικές ικανότητες} του οικονομικού φορέα και, εφόσον κρίνεται αναγκαίο, όσον αφορά τα {\b μέσα μελέτης και έρευνας} που αυτός διαθέτει καθώς και τα {\b μέτρα που λαμβάνει για τον έλεγχο της ποιότητας;}\cell<?=$ny?>\cell\row
<?=$tbl[2]?>
\intbl 6) Οι ακόλουθοι {\b τίτλοι σπουδών και επαγγελματικών προσόντων} διατίθενται από:\cell\cell\row
<?=$tbl[3]?>
α) τον ίδιο τον πάροχο υπηρεσιών ή τον εργολάβο,\par {\b και/ή} (ανάλογα με τις απαιτήσεις που ορίζονται στη σχετική πρόσκληση ή διακήρυξη ή στα έγγραφα της σύμβασης)\cell\u8230>\cell\row
<?=$tbl[4]?>
β) τα διευθυντικά στελέχη του:\cell\u8230>\cell\row
<?=$tbl[1]?>
7) Ο οικονομικός φορέας θα μπορεί να εφαρμόζει τα ακόλουθα {\b μέτρα περιβαλλοντικής διαχείρισης} κατά την εκτέλεση της σύμβασης:\cell\u8230>\cell\row
8) Το {\b μέσο ετήσιο εργατοϋπαλληλικό δυναμικό} του οικονομικού φορέα και ο αριθμός των διευθυντικών στελεχών του κατά τα τελευταία τρία έτη ήταν τα εξής:\cell
Έτος, μέσο ετήσιο εργατοϋπαλληλικό προσωπικό:\par
\u8230> , \u8230>\par
\u8230> , \u8230>\par
\u8230> , \u8230>\par
Έτος, αριθμός διευθυντικών στελεχών:\par
\u8230> , \u8230>\par
\u8230> , \u8230>\par
\u8230> , \u8230>\cell\row
9) Ο οικονομικός φορέας θα έχει στη διάθεσή του τα ακόλουθα {\b μηχανήματα, εγκαταστάσεις και τεχνικό εξοπλισμό} για την εκτέλεση της σύμβασης:\cell\u8230>\cell\row
10) Ο οικονομικός φορέας {\b προτίθεται, να αναθέσει σε τρίτους υπό μορφή υπεργολαβίας}<?=$fns?>Επισημαίνεται ότι εάν ο οικονομικός φορέας {\b\ul έχει} αποφασίσει να αναθέσει τμήμα της σύμβασης σε τρίτους υπό μορφή υπεργολαβίας {\b\ul και} στηρίζεται στις ικανότητες του υπεργολάβου για την εκτέλεση του εν λόγω τμήματος, τότε θα πρέπει να συμπληρωθεί χωριστό ΤΕΥΔ για τους σχετικούς υπεργολάβους, βλέπε μέρος ΙΙ, ενότητα Γ ανωτέρω.} το ακόλουθο {\b τμήμα (δηλ. ποσοστό)} της σύμβασης:\cell\u8230>\cell\row
<?=$tbl[2]?>
11) Για {\b δημόσιες συμβάσεις προμηθειών:}\cell\cell\row
<?=$tbl[3]?>
Ο οικονομικός φορέας θα παράσχει τα απαιτούμενα δείγματα, περιγραφές ή φωτογραφίες των προϊόντων που θα προμηθεύσει, τα οποία δεν χρειάζεται να συνοδεύονται από πιστοποιητικά γνησιότητας·\cell<?=$ny?>\cell\row
Κατά περίπτωση, ο οικονομικός φορέας δηλώνει περαιτέρω ότι θα προσκομίσει τα απαιτούμενα πιστοποιητικά γνησιότητας.\cell<?=$ny?>\cell\row
<?=$tbl[4]?>
Εάν η σχετική τεκμηρίωση διατίθεται ηλεκτρονικά, αναφέρετε:\cell<?=$ask0?>\cell\row
<?=$tbl[2]?>
12) Για {\b δημόσιες συμβάσεις προμηθειών:}\cell\cell\row
<?=$tbl[3]?>
Μπορεί ο οικονομικός φορέας να προσκομίσει τα απαιτούμενα {\b πιστοποιητικά} που έχουν εκδοθεί από επίσημα {\b ινστιτούτα ελέγχου ποιότητας} ή υπηρεσίες αναγνωρισμένων ικανοτήτων, με τα οποία βεβαιώνεται η καταλληλότητα των προϊόντων, επαληθευόμενη με παραπομπές στις τεχνικές προδιαγραφές ή σε πρότυπα, και τα οποία ορίζονται στη σχετική διακήρυξη ή στην πρόσκληση ή στα έγγραφα της σύμβασης που αναφέρονται στη διακήρυξη;\cell<?=$ny?>\cell\row
{\b Εάν όχι}, εξηγήστε τους λόγους και αναφέρετε ποια άλλα αποδεικτικά μέσα μπορούν να προσκομιστούν:\cell\u8230>\cell\row
<?=$tbl[4]?>
Εάν η σχετική τεκμηρίωση διατίθεται ηλεκτρονικά, αναφέρετε:\cell<?=$ask0?>\cell\row

\pard\sb454\sa226\qj{\b Δ: Συστήματα διασφάλισης ποιότητας και πρότυπα περιβαλλοντικής διαχείρισης}\par

\sb0\sa0<?=$tbl[0]?>
Ο οικονομικός φορέας πρέπει να παράσχει πληροφορίες {\b μόνον} όταν τα συστήματα διασφάλισης ποιότητας και/ή τα πρότυπα περιβαλλοντικής διαχείρισης έχουν ζητηθεί από την αναθέτουσα αρχή ή τον αναθέτοντα φορέα στη σχετική διακήρυξη ή στην πρόσκληση ή στα έγγραφα της σύμβασης.\cell\row
<?=$tbl[1]?>
\b Συστήματα διασφάλισης ποιότητας και πρότυπα περιβαλλοντικής διαχείρισης\cell Απάντηση:\b0\cell\row
<?=$tbl[2]?>
Θα είναι σε θέση ο οικονομικός φορέας να προσκομίσει {\b πιστοποιητικά} που έχουν εκδοθεί από ανεξάρτητους οργανισμούς που βεβαιώνουν ότι ο οικονομικός φορέας συμμορφώνεται με τα απαιτούμενα {\b πρότυπα διασφάλισης ποιότητας}, συμπεριλαμβανομένης της προσβασιμότητας για άτομα με ειδικές ανάγκες;\cell<?=$ny?>\cell\row
<?=$tbl[3]?>
Εάν όχι, εξηγήστε τους λόγους και διευκρινίστε ποια άλλα αποδεικτικά μέσα μπορούν να προσκομιστούν όσον αφορά το σύστημα διασφάλισης ποιότητας:\cell\u8230>\cell\row
<?=$tbl[4]?>
Εάν η σχετική τεκμηρίωση διατίθεται ηλεκτρονικά, αναφέρετε:\cell<?=$ask0?>\cell\row
<?=$tbl[2]?>
Θα είναι σε θέση ο οικονομικός φορέας να προσκομίσει {\b πιστοποιητικά} που έχουν εκδοθεί από ανεξάρτητους οργανισμούς που βεβαιώνουν ότι ο οικονομικός φορέας συμμορφώνεται με τα απαιτούμενα {\b συστήματα ή πρότυπα περιβαλλοντικής διαχείρισης;}\cell<?=$ny?>\cell\row
<?=$tbl[3]?>
{\b Εάν όχι}, εξηγήστε τους λόγους και διευκρινίστε ποια άλλα αποδεικτικά μέσα μπορούν να προσκομιστούν όσον αφορά τα {\b συστήματα ή πρότυπα περιβαλλοντικής διαχείρισης:}\cell\u8230>\cell\row
<?=$tbl[4]?>
Εάν η σχετική τεκμηρίωση διατίθεται ηλεκτρονικά, αναφέρετε:\cell<?=$ask0?>\cell\row

\pard\sb454\sa226\qj{\b\ul Μέρος V: Περιορισμός του αριθμού των πληρούντων τα κριτήρια επιλογής υποψηφίων}\par

\sb0\sa0<?=$tbl[0]?>
\intbl Ο οικονομικός φορέας πρέπει να παράσχει πληροφορίες {\b μόνον} όταν η αναθέτουσα αρχή ή ο αναθέτων φορέας έχει προσδιορίσει αντικειμενικά και χωρίς διακρίσεις κριτήρια ή κανόνες που πρόκειται να εφαρμοστούν για τον περιορισμό του αριθμού των υποψηφίων που θα προσκληθούν να υποβάλουν προσφορά ή να συμμετάσχουν στον διάλογο. Οι πληροφορίες αυτές, οι οποίες μπορούν να συνοδεύονται από απαιτήσεις όσον αφορά τα πιστοποιητικά (ή το είδος τους) ή τις μορφές αποδεικτικών εγγράφων, εφόσον συντρέχει περίπτωση, που θα πρέπει να προσκομιστούν, ορίζονται στη σχετική διακήρυξη ή στην πρόσκληση ή στα έγγραφα της σύμβασης.\par
\ul Για κλειστές διαδικασίες, ανταγωνιστικές διαδικασίες με διαπραγμάτευση, διαδικασίες ανταγωνιστικού διαλόγου και συμπράξεις καινοτομίας μόνον:\ul0\cell\row
\pard\sb226\sa226\qj Ο οικονομικός φορέας δηλώνει ότι:\par
\sb0\sa0<?=$tbl[1]?>
\b Περιορισμός του αριθμού\cell Απάντηση:\b0\cell\row
<?=$tbl[2]?>
{\b Πληροί} τα αντικειμενικά και χωρίς διακρίσεις κριτήρια ή κανόνες που πρόκειται να εφαρμοστούν για τον περιορισμό του αριθμού των υποψηφίων με τον ακόλουθο τρόπο:\cell\u8230>\cell\row
<?=$tbl[3]?>
Εφόσον ζητούνται ορισμένα πιστοποιητικά ή λοιπές μορφές αποδεικτικών εγγράφων, αναφέρετε {\b για καθένα από αυτά} αν ο οικονομικός φορέας διαθέτει τα απαιτούμενα έγγραφα:\cell<?=$ny?><?=$fns?>Επαναλάβετε όσες φορές χρειάζεται.}\cell\row
<?=$tbl[4]?>
Εάν ορισμένα από τα εν λόγω πιστοποιητικά ή λοιπές μορφές αποδεικτικών στοιχείων διατίθενται ηλεκτρονικά<?=$fns?>Διευκρινίστε ποιο στοιχείο αφορά η απάντηση.}, αναφέρετε για το καθένα:\cell<?=$ask0?><?=$fns?>Επαναλάβετε όσες φορές χρειάζεται.}\cell\row

\pard\sb454\sa226\qj{\b\ul Μέρος VI: Τελικές δηλώσεις}\par
\sb0\sa113 Ο κάτωθι υπογεγραμμένος, δηλώνω επισήμως ότι τα στοιχεία που έχω αναφέρει σύμφωνα με τα μέρη Ι - IV ανωτέρω είναι ακριβή και ορθά και ότι έχω πλήρη επίγνωση των συνεπειών σε περίπτωση σοβαρών ψευδών δηλώσεων.\par
Ο κάτωθι υπογεγραμμένος, δηλώνω επισήμως ότι είμαι σε θέση, κατόπιν αιτήματος και χωρίς καθυστέρηση, να προσκομίσω τα πιστοποιητικά και τις λοιπές μορφές αποδεικτικών εγγράφων που αναφέρονται<?=$fns?>Πρβλ και άρθρο 1 ν. 4250/2014}, εκτός εάν:\par
α) η αναθέτουσα αρχή ή ο αναθέτων φορέας έχει τη δυνατότητα να λάβει τα σχετικά δικαιολογητικά απευθείας με πρόσβαση σε εθνική βάση δεδομένων σε οποιοδήποτε κράτος μέλος αυτή διατίθεται δωρεάν<?=$fns?>Υπό την προϋπόθεση ότι ο οικονομικός φορέας έχει παράσχει τις απαραίτητες πληροφορίες (διαδικτυακή διεύθυνση, αρχή ή φορέα έκδοσης, επακριβή στοιχεία αναφοράς των εγγράφων) που παρέχουν τη δυνατότητα στην αναθέτουσα αρχή ή στον αναθέτοντα φορέα να το πράξει. Όπου απαιτείται, τα στοιχεία αυτά πρέπει να συνοδεύονται από τη σχετική συγκατάθεση για την εν λόγω πρόσβαση.}.\par
β) η αναθέτουσα αρχή ή ο αναθέτων φορέας έχουν ήδη στην κατοχή τους τα σχετικά έγγραφα.\par
Ο κάτωθι υπογεγραμμένος δίδω επισήμως τη συγκατάθεσή μου {\b\i <?=rtf(article(gender($data['Μονάδα Πλήρες']), 2, true) . ' ' . inflectPhrase($data['Μονάδα Πλήρες'], 2))?>}, προκειμένου να αποκτήσει πρόσβαση σε δικαιολογητικά των πληροφοριών τις οποίες έχω υποβάλλει στο παρόν Τυποποιημένο Έντυπο Υπεύθυνης Δήλωσης για τους σκοπούς του διαγωνισμού.\par\par
Ημερομηνία, τόπος και, όπου ζητείται ή είναι απαραίτητο, υπογραφή(-ές):\par\u8230>\par

\sect

<?php

unset($ask0, $fns, $nestrow, $ny, $tbl, $years);
// Δεν διαγράφεται το $category γιατί απαιτείται στην οικονομική προσφορά
// Δεν διαγράφεται το $per_tender γιατί θα διαγραφεί στη διακήρυξη διαγωνισμού

rtf_close(__FILE__);