<?php
require_once('statement.php');

statement_common(
	/** Εξάγει μια υπεύθυνη δήλωση δικαιούχου που βεβαιώνει μη στρατιωτικό εκπρόσωπο.
	 * @param array $data Τα δεδομένα της υπεύθυνης δήλωσης */
	function($data) {
		$data['Προς'] = 'ΔΟΥ';
		$data['Δήλωση'] = 'Σαν «' . rtf($data['Επωνυμία']) . '», δε θα χρησιμοποιήσω σαν άμεσο ή έμμεσο αντιπρόσωπο, μόνιμο ή σε εφεδρεία Αξιωματικό των τριών κλάδων των Ενόπλων Δυνάμεων, εφόσον δεν έχει παρέλθει πενταετία από τον χρόνο αποστρατείας τους, σύμφωνα με την παράγραφο 12 του άρθρου 66 του ΝΔ 1400/73 (ΦΕΚ Α\' 114), όπως τροποποιήθηκε και ισχύει.';
		statement_contractor($data);
	});

rtf_close(__FILE__);