<?
require_once('init.php');
require_once('header.php');
require_once('statement.php');

foreach($data['Τιμολόγια ανά Δικαιούχο'] as $per_contractor) {
	$v = $per_contractor['Τιμολόγια'][0]['Δικαιούχος'];
	if ($v['Τύπος'] != 'PRIVATE_SECTOR') continue;
	$v['Προς'] = 'ΔΟΥ';
	if (!isset($v['Ονοματεπώνυμο'])) $v['Ονοματεπώνυμο'] = $v['Επωνυμία'];
	if (!isset($v['Τόπος Κατοικίας'])) $v['Τόπος Κατοικίας'] = $v['Διεύθυνση'];
	if (!isset($v['e-mail'])) $v['e-mail'] = '';
	$v['Δήλωση'] = 'Σαν «' . rtf($v['Επωνυμία']) . '», δε θα χρησιμοποιήσω σαν άμεσο ή έμμεσο αντιπρόσωπο, μόνιμο ή σε εφεδρεία Αξιωματικό των τριών κλάδων των Ενόπλων Δυνάμεων, εφόσον δεν έχει παρέλθει πενταετία από τον χρόνο αποστρατείας τους, σύμφωνα με την παράγραφο 12 του άρθρου 66 του ΝΔ 1400/73 (ΦΕΚ Α\' 114), όπως τροποποιήθηκε και ισχύει.';
	$v['Ημερομηνία Έκδοσης'] = get_newer_invoice_date($per_contractor['Τιμολόγια']);
	statement($v);
}

rtf_close(__FILE__); ?>